[
  {
    "date_time": "11/7/2012 17:30",
    "shape": "Light",
    "duration": "4 minutes",
    "city": "Bay Lake",
    "state": " FL",
    "latitude": 28.39487199,
    "longitude": -81.57838177,
    "comments": "Three brightly glowing objects above sun during sunset + Fireball 2 hours later.  A few minutes after apparent sunset on 11/7/2012 5:20-5:40 I saw an object begin glowing brightly about 6-7 degrees above the horizon, at this point 3 degrees above the sun (was obscured by tree line) the object was about the same angular size as Venus, maybe a little larger.  It was visible over the course of a minute, I first noticed it as a soft glowing object the same shade as the sun during sunset, but it got continuously brighter until I was able to see white light in the center, it quickly faded until it was just at the edge of my vision and then brightened up again.  During the phase where it brightened back up I noticed an identical object five degrees north of it, and 10 degrees above the horizon.  This one had a much shorter life cycle of about 20-30 seconds and did not re-ignite like the first object.  So transfixed was I on the second object that I did not notice what happened to the first.  After about two minutes of staring at the horizon trying to detect another I noticed a third object about 25 degrees directly above where the sun set, this one may have been in existence longer but I only saw it for about 5-10 seconds, which was enough time to point it out to a passerby to verify that my eyes were not playing tricks on me.  She only noticed the contrail of a plane 10 degrees below object.  All three were exceptionally bright objects that did not move during the times they were visible (verified constantly with reference points on the Horizon), all presented with an orange glow similar to the surrounding sky during sunset, but they all at their peak brightness had a visible bright white core.  What I have concluded/believe:    1. They were not one object.  Two were visible at the same time.  2. It is not an airplane, or airplanes.  Angular size of light source, brightness and duration of visibility especially in close proximity to the sun would not exist without apparent motion.  3. They were not a satellite, positioning is too erratic, and they did not move. AND in order to produce a similar orange glow, light would have been reflected from the sun, but the objects were too close to the sun.  The only man-made objects to pass through area between sun and earth during time specified were ISS (ZARYA), Cosmos 2278, Atlas Centaur R/B and Okean-3.  None of which, according to computer program Stellarium 0.11.3, were in proper position or at proper times to be the objects spotted.  My mind first jumped to supernova, and second to aliens.  Both seem equally improbable.  Location of viewer during sighting: +28&#176; 25' 6.99&amp;quot;, -81&#176; 34' 49.53&amp;quot; (28.418608, -81.580426)  In addition to these viewings at 7:52 a fireball/shooting star fell in the exact same region of the sky as the position of the aforementioned objects.  Angular size equivalent to quarter held at arm&#8217;s length.  No one else in my immediate vicinity appeared to have noticed it.  Highly visible fragmentation, with a short tail roughly equal to that of the body size, there was no noise.  Location of viewer during sighting: +28&#176; 25' 5.35&amp;quot;, -81&#176; 34' 49.88&amp;quot; (28.418152, -81.580522)  (Locations calculated via Google maps)",
    "distance": 0.6378054923727244
  },
  {
    "date_time": "11/13/2012 17:10",
    "shape": "Fireball",
    "duration": "7-10 minutes",
    "city": "Orlando",
    "state": " FL",
    "latitude": 28.43101985,
    "longitude": -81.29180596,
    "comments": "Orange balls gliding through the sky over Orlando  I was walking my dog on the evening of November 13, 2012 at approximately 6:10pm when I saw this orange ball in the sky and thought it looked odd.  I live near Orlando International Airport so I know what planes look like at night.  This was not a jet plane.  I stopped to watch it and then I saw several more orange balls gliding from the north looking as if they were following each other.  Then several more came so I ran inside for my camera.  I took some pictures but they don&#8217;t do what I saw justice.  It looked like someone was tossing these balls into the atmosphere because they just gliding by, not far from the tree tops, and made no noise.  They were beautiful and I stood there in amazement watching them.  I can&#8217;t explain what they are but I know what I saw.  They were following each other sometimes just one and sometimes in a group of three.  They followed each other out to the west.   I am a pet groomer in Orlando and am always out with my dogs.  I have never seen anything like this before and I watch the jets coming and going all the time.",
    "distance": 17.42583023420552
  },
  {
    "date_time": "11/13/2012 6:00",
    "shape": "Circle",
    "duration": "0:05",
    "city": "Orlando",
    "state": " FL",
    "latitude": 28.43101985,
    "longitude": -81.29180596,
    "comments": "Fire like, dots shape similar to Texas state  Dots of bright orange light in sky forming a shape, still no moving try taking pictures but no success on that.  They disappear in like 5 minutes after they appear.",
    "distance": 17.42583023420552
  },
  {
    "date_time": "11/10/2012 18:30",
    "shape": "Circle",
    "duration": "20 minutes",
    "city": "Orlando",
    "state": " FL",
    "latitude": 28.43101985,
    "longitude": -81.29180596,
    "comments": "I observed about 9 or 10 balls of light going to one central destination  On a sat around 18:30 hrs my friend just happened to walk outside.  She was outside for about 3 mins and then she brought something to my attention.  She has a puzzled confused look on her face as she pointed up into the night sky and questioned what are those orange reddish glowing balls.  I then took a good look and came to a conclusion that they weren&#8217;t several things.  Such as candles, air planes, dragon fly&#8217;s.  I knew that they were something odd.  I had already had my camera with me at the time and I soon then called my parents out to determine what they were.  My dad gazed up into the sky to further examine what they were.  At the time all of this was taking place there was a sudden stop of air traffic.  I live right by an air port so planes are coming in and out at all hours.  I notice that there were only two dots side by side heading towards the clouds going east to west.  During this time I soon began to capture everything on camera because I knew you would ha! ve to see it to believe it.  And then a swarm of 5 or 6 followed it in the same path after it disappeared.  After that 1 more came right along in the same direction I closely examined it through my camera lens and I noticed that the orange light started to dim and right in the center was a orange reddish dot.  I took a closer look of the whole thing and I saw a clear  3D outline of what looked like the whole thing.  The best way I am can describe them is floating orange jelly fish.  See high-quality video footage on You Tube:    &quot;Stunning UFO11-10-12 1830hrs Orlando Fl above my house near OIA&quot;   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 17.42583023420552
  },
  {
    "date_time": "11/10/2012 18:30",
    "shape": "Circle",
    "duration": "15 minutes",
    "city": "Orlando",
    "state": " FL",
    "latitude": 28.43101985,
    "longitude": -81.29180596,
    "comments": "Observed up to 9 reddish orange objects flying in commercial airspace near Orland International Airport.  Daughter outside with friends and wife.  They saw 2 circular shaped balls orange red in color.  Called me outside and we then saw 4 flying in a triangular pattern.  No noise.  Looked orange red noticed a slight flash to them.  Approximately 1500 ft not sure.    Live near Orlando internation airport and they were flying in the opposite direction as the normal flight patterns.  After the 4-2 more came about 1 minute after same height flight pattern and shape.  After those passed 1 more came and flew directly over a plane flying east.  Looked like a near miss.  I have video of objects taken on a digital camera.",
    "distance": 17.42583023420552
  },
  {
    "date_time": "11/7/2012 19:51",
    "shape": "Light",
    "duration": "5 seconds",
    "city": "Orlando",
    "state": " FL",
    "latitude": 28.43101985,
    "longitude": -81.29180596,
    "comments": "Bright dark green light flashed in western sky, increased in brightness 2-3 times then nose dived and disappeared.  I was traveling westbound on Interstate 4, half a mile before Exit 79, when I observed a dark green-colored orb in the sky that swelled to a light green color while becoming 2-3 times brighter (within 2 seconds), and then fell straight down very fast and disappeared before reaching the ground.  There was a short tail.  The entire incident lasted approximately 5 seconds.",
    "distance": 17.42583023420552
  },
  {
    "date_time": "11/3/2012 19:45",
    "shape": "Sphere",
    "duration": "3 minutes",
    "city": "Longwood",
    "state": " FL",
    "latitude": 28.70147291,
    "longitude": -81.34574652,
    "comments": "UFO spotted hovering over Winn Dixie parking lot in longwood FL hovering very low.  The craft was lower in the air than a plane would fly.    My kids and I got into the car in a parking lot happened to look up and saw a sphere shaped object in the sky just spinning and hovering.  It had red and whitish lights on it but one white light was much brighter than the other lights on the UFO.    Then it slowly started to go away.    We were in Longwood it was headed towards Altamonte springs.",
    "distance": 24.88561246353901
  },
  {
    "date_time": "11/11/2012 22:30",
    "shape": "Unknown",
    "duration": "20 seconds",
    "city": "Winter Haven",
    "state": " FL",
    "latitude": 28.04690145,
    "longitude": -81.73553122,
    "comments": "Orange orb traveling over house low and caused my whole house to shake",
    "distance": 26.49797774276846
  },
  {
    "date_time": "11/4/2012 19:00",
    "shape": "Disk",
    "duration": "2 minutes",
    "city": "Sanford",
    "state": " FL",
    "latitude": 28.82623947,
    "longitude": -81.30677623,
    "comments": "Look up in sky was disc object loud humming sound had yellow lights circulating around it was moving away from us at slow rate of speed.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 33.461201942043715
  },
  {
    "date_time": "11/10/2012 20:15",
    "shape": "Chevron",
    "duration": "10 minutes",
    "city": "Lakeland",
    "state": " FL",
    "latitude": 28.02824198,
    "longitude": -81.94899958,
    "comments": "Chevron of orange lights trailing sparks.  I was at a festival in Lakeland Florida, when I seen an array of 3 lights in a cheveron shape  to the east (correction needed, it was to the west) (over the tampa area) spinning in circles which seemed to emit long flowing sparks, it would fly in circular and and tight manuvers some times hooking into a figure 8 then stopping.    I quickly ran to a large group of people (about 20 people) and told them to look at it, by this time it had been going on for 5 minutes, it still continued to spin fly in circle patterns and tight hook patterns, just then we seen (what we think) a jet flying after it, then we got the real scale of the craft, compaired to the jet that was really flying fast and tightly manuvering, the ufo was amazingly huge and had to of been covering miles within split seconds in the sky while making circle patterns, it seems to me that the ufo was doing no harm, but was toying with the jet fighter.  After watching it dip and dive and circle around the ! jet it flew directly at the ground.  From my perspective it went behind the tree line, i spoke with other people that seen it from a different view and they said that the lights seperated and split off then joined up and flew away at a high rate of speed.  After it was gone we seen the jet still searching, then a helicopter could be seen in the distance in the same area with it's spotlight on.  I tried taking video but ended up with one snapshot that just shows a streak in the sky.",
    "distance": 34.4594137038428
  },
  {
    "date_time": "11/10/2012 20:15",
    "shape": "Chevron",
    "duration": "10 minutes",
    "city": "Lakeland",
    "state": " FL",
    "latitude": 28.02824198,
    "longitude": -81.94899958,
    "comments": "Chevron of orange lights trailing sparks.  I was at a festival in Lakeland Florida, when I seen an array of 3 lights in a cheveron shape  to the east (over the tampa area) spinning in circles which seemed to emit long flowing sparks, it would fly in circular and and tight manuvers some times hooking into a figure 8 then stopping.   I quickly ran to a large group of people (about 20 people) and told them to look at it, by this time it had been going on for 5 minutes, it still continued to spin fly in circle patterns and tight hook patterns, just then we seen (what we think) a jet flying after it, then we got the real scale of the craft, compaired to the jet that was really flying fast and tightly manuvering, the ufo was amazingly huge and had to of been covering miles within split seconds in the sky while making circle patterns, it seems to me that the ufo was doing no harm, but was toying with the jet fighter.   After watching it dip and dive and circle around the jet it flew directly at the ground.  From my perspective it went behind the tree line, i spoke with other people that seen it from a different view and they said that the lights seperated and split off then joined up and flew away at a high rate of speed.  After it was gone we seen the jet still searching, then a helicopter could be seen in the distance in the same area with it's spotlight on.  I tried taking video but ended up with one snapshot that just shows a streak in the sky.",
    "distance": 34.4594137038428
  },
  {
    "date_time": "11/10/2012 20:00",
    "shape": "Unknown",
    "duration": "15 seconds",
    "city": "Lakeland",
    "state": " FL",
    "latitude": 28.02824198,
    "longitude": -81.94899958,
    "comments": "My family and I seen a fast moving,silent object with bright lights almost like a fireball over our skies  We were sitting on the porch talking when my husband said are they fire works so I looked and seen it go up and come down and then all of a sudden it came back up and started to go side to side and up and down I mean it was all over the place it had 4 bright lights it looked like fire in the sky it was spooky I mean it did not even make a sound and so I ran in to get my camera but by the time I got out there it was gone my husband and kids said it just vanished but I'll tell you I have never seen anything like it in my life I mean it was so fast and so bright and the way it moved was like unreal i can't explain what it was but I know what it wasn't and it was something out of this world.",
    "distance": 34.4594137038428
  },
  {
    "date_time": "11/9/2012 20:45",
    "shape": "Circle",
    "duration": "5 minutes",
    "city": "Land O'Lakes",
    "state": " FL",
    "latitude": 29.03361488,
    "longitude": -81.30162314,
    "comments": "Approx 15 bright orange circular lights slowly moving in the sky in a linear pattern...then they would change positions.  I went outside to take out the trash when from the corner of my eye in the nw sky I saw approximately 15 what appeared to be bright fireballs moving slowly in a double line across the sky. The objects then changed positions moving up and down...they were silent.  I called my wife and kids outside and they witnessed the event.  The four of us watched them for a few minutes and they traveled off to the distance and suddenly disappeared!",
    "distance": 46.592588476132626
  },
  {
    "date_time": "11/3/2012 2:00",
    "shape": null,
    "duration": "hours",
    "city": "Silver Springs",
    "state": " FL",
    "latitude": 29.10279883,
    "longitude": -82.00859708,
    "comments": "Sighting of intelligent life forms seem friendly to me  I have gone out at night to smoke cigars.  I like to look upon the stars, and some nights there are stars that appear from the black deep darkness of space which where not lit up before.  Bright white lights and orange lights display happiness that I speak openly to them. As my other report indicated a U. F. L. (Un Identified light). did a circle and took off into space but this report Is a bit different.  A sighting of  white light doing a straight line after I had ended a sentence of my rambling which I do some nights.  It's some times almost as if they are going to land but then nothing the light returns to space and disappears from sight.  I'll admit I get quiet mad at them because they ignore my demands for a space ship.  I also get mad that I have had no physical response from the military nor any help in establishing any type of visual and communication.  Lights seem to just light up and then disappear after a brief rambling on my part.",
    "distance": 54.9115144559449
  },
  {
    "date_time": "11/7/2012 20:00",
    "shape": "Fireball",
    "duration": null,
    "city": "Tampa",
    "state": " FL",
    "latitude": 28.01781501,
    "longitude": -82.44814761,
    "comments": "I was on my lunch break at work with a friend.    It had to be anywhere from 8:50pm to 9:03pm when me and a friend saw this bright fire ball in the sky coming from the north headed south.  We watch it disapear in the clouds.    I'm not sure the zip code is right, but I work at The University of Tampa next to downtown Tampa.  There's a news channel there were it pass.  They must got footage of it because it was fly pretty low.    All I know is it look red, a bit of yellow and blue like a flame.  Fireball is what my friend said it look like and I agree with him.  I know for sure it wasn't a aircaft I seen before and also it had no noise.   ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
    "distance": 59.38324473528522
  },
  {
    "date_time": "11/8/2012 18:40",
    "shape": "Other",
    "duration": "1 second",
    "city": "Tarpon Springs",
    "state": " FL",
    "latitude": 28.15109244,
    "longitude": -82.75561299,
    "comments": "i was driving home from work after a few stops along the way.  i was traveling northbound when a very fast object raced across the sky from behind southeast moving ahead diagonal of my position northwest.  it had to be a mile up and traveling horizontal not up or down.  it was very bright,  blueish and white, round in shape with a tail that moved erratic like lightning but not the nearly the length of lightning. it quickly seemed to disappear as though it burnt out.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 73.82459001482036
  },
  {
    "date_time": "11/4/2012 19:30",
    "shape": "Light",
    "duration": "2 seconds",
    "city": "Clearwater",
    "state": " FL",
    "latitude": 27.97121439,
    "longitude": -82.69353653,
    "comments": "Brilliant flash of light, possibly very small meteorite  It was a brilliant flash of light that came down quickly from the north and headed south towards the ground.  It went out of sight very quickly  as some trees blocked our sight of it; or else it just burned out or disappeared. We were just driving home and it cut across the sky right in front of us.  We were very close to it and our best guess is that it was a very small meteorite.  There was no sound and we couldn't see where it hit. However, there was a lighter patch of sky, a slight glow, in the direction where the object appeared to originate.  That lighter patch of sky hung around until we came inside the house so I don't know for how long.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 74.29084118797648
  },
  {
    "date_time": "11/5/2012 19:15",
    "shape": "Light",
    "duration": "15 minutes",
    "city": "Arcadia",
    "state": " FL",
    "latitude": 27.22259178,
    "longitude": -81.85729285,
    "comments": "Flying in a Cessna 182 North of LaBelle VOR, encounter strange light not on radar.  Just spent 20 minutes on the phone with Miami ARTCC (Center); would love anyone's insight here.  Bear with me, kind of a long, detailed story:  Flew back from FXE to TPF direct with my student tonight.  All of the Avon Park MOA's and Restricted areas were active/hot, and we could see about 6 F-16's (as per Miami center) dog fighting and practicing intercept procedures at 7000' and above.  Upon clearing the MOA and due east of Arcadia, what appeared to be a LED landing light abruptly popped on just above the cloud layer and immediately caught our attention.  It appeared to be about 500ft below us, at our 2 o'clock and figured about 5-7 miles, and looked as if it might be in conflict in a few minutes.  The light then started flashing, presumably because he saw us up ahead crossing and wanted to make his position known.  I turned on our landing and taxi light of the 182 to acknowledge, yet this other aircraft kept turning this light on at odd and random intervals until he went dark for about a minute.  Fed up, I asked the Miami controller for a traffic advisory on the aircraft at our 2 o'clock and about 3-4 miles.  He responded that he didn't observe any traffic in the area.  A little puzzled, I asked him if he had any primary targets in the area and he told me to standby.  A long 15 seconds passed by and the light appeared again!  This time it appeared to now be at our 1 o'clock but the light still pointed at us (?) and then quickly went out again.  The controller came back on and said that he had checked and rechecked his backup systems and assured me that there were NO primary(pure radar return) targets in the area.  Just when he said that, an aircraft behind us a few miles asked where we were, the controller told him, and that pilot reported that he was watching all of this happen AS well!  Then a third aircraft also chimed in and said he too was seeing the strange light and it was moving across the sky rapidly.  Three aircraft in all saw this.  The controller was completely bewildered at this point....needless to say, upon landing, I called up Miami Center.  I talked on the phone for 20 minutes to the D-Side of the sector I was in, who turned out to be a supervisor and was training the R-Side.  He too was sufficiently freaked out and confused along with the rest of the guys on &quot;the floor.&quot;   He said that in his 27 years, he had odd occurrences like this every few years and they usually turned out to be flares IN the MOA but never in this location, intermittent, and underneath another aircraft moving laterally.  He thought that it was a UAV (which is of course illegal to operate in the NAS), and that if it was, it could have been much closer to our aircraft than we had thought (that's always comforting to hear) and it would also explain why it was not on their radar if it was small enough.  I chimed in and figured that it started turning its lights on and off in an effort to avoid us.  This was not a flare or laser.  It changed position laterally and maintained its altitude.",
    "distance": 83.41223085827461
  },
  {
    "date_time": "11/8/2012 20:40",
    "shape": "Fireball",
    "duration": "10 minutes",
    "city": "Okeechobee",
    "state": " FL",
    "latitude": 27.24187954,
    "longitude": -80.83077607,
    "comments": "three bright red lights over lake Okeechobee  Was on way home when i noticed a bright glowing Red ball of light hoovering about 1 mile distant over lake Okeechobee.  When i got home i could still see the light it was even brighter so i went and got Binoculars and my Green Laser.    I returned to the front lawn and saw what appeared to be three brights together hoovering.  When i pointed the laser in their direction they vanished! i continued to observe the area for several hours after the event but they didnt return",
    "distance": 92.34146436430422
  },
  {
    "date_time": "11/14/2012 17:30",
    "shape": "Sphere",
    "duration": "5-10 minutes",
    "city": "Cape Coral",
    "state": " FL",
    "latitude": 26.59787613,
    "longitude": -81.98793718,
    "comments": "UFO's fly by festival in Cape Coral Florida on 11/10/2012  There were about 17-20 orb shaped lights or giant glowing balls of light (hard to say how large since if they were 1/4 a mile away I would guess the size of a basketball. They may have been a few miles away then they would be the size of a car. They were in a group of four about 20ft apart then a few ain a row then another group. They had an orange glow and were organized as to how they maved across the sky. It took 5 to 10 minutes to complete.  We were at a festival that night and everyone that saw this was amazed.  There were thousands of people at the fair and with all the confusion of a fair people may have missed it but I'm pretty sure lots of the people saw this and just don't know how to report it.",
    "distance": 127.31642659314427
  },
  {
    "date_time": "11/10/2012 21:35",
    "shape": "Sphere",
    "duration": "5 minutes",
    "city": "Cape Coral",
    "state": " FL",
    "latitude": 26.59787613,
    "longitude": -81.98793718,
    "comments": "Several red spheres over Cape Coral moving south to north then turning toward Gulf of Mexico.  About 10 red and white flashing spheres, spaced apart, moving across the sky quickly from south to north, then turning west to go out over the Gulf of Mexico.  Several other people were outside watching from down the street.  There was no sound.  They all followed the same path.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 127.31642659314427
  },
  {
    "date_time": "11/7/2012 21:00",
    "shape": "Fireball",
    "duration": "15 seconds",
    "city": "Cape Coral",
    "state": " FL",
    "latitude": 26.59787613,
    "longitude": -81.98793718,
    "comments": "Super bright orangish red shooting flame across the sky in Cape Coral, FL  On November 7th, 2012, I was driving home from picking up my 14 year old son at a friend&#8217;s.  We were sitting at a light at Burnt Store and Pine Island Rd when we both looked up and saw what we thought was a shooting star.    I remember stating that it was the brightest shooting star I have ever seen.  It was so big and bright like it was SUPER close.  But the direction that it traveled was very odd it went in a 45 degree angle across the sky for a few seconds and then disappeared.  It was so strange that for the past week I have not been able to forget about it.",
    "distance": 127.31642659314427
  },
  {
    "date_time": "11/17/2012 15:10",
    "shape": "Sphere",
    "duration": "30 seconds",
    "city": "Boynton Beach",
    "state": " FL",
    "latitude": 26.53357529,
    "longitude": -80.07656628,
    "comments": "Two metallic spheres moving west over then south over Boynton Beach  Driving north on Congress Avenue about 1/2 mile south of Hypoluxo Blvd, I saw two spherical objects moving west through the sky. At first I thought they were small passenger planes from the local airfield, but didn't see any wings. They glinted in the sun, the same bare-metal color and reflection as a WWII Mustang fighter plane.  My second thought was that they were party balloons flying thorugh the air. But as I got closer they appeared to be too big - about 10 feet in diameter. After passing over Congress Ave they continued on then turned south and kept going parallel with the street behind me. They disappeared behind the trees, and I turned around at Hypoluxo Blvd to go back south and try to catch them on my camera, but never saw them again. They were in view for perhaps 30 seconds, starkly visible against the bright blue sky and cumulous clouds.  They appeared to be about 200-300 years away at the beginning, and maybe 50-75 yards up. They kept their formation the whole time, one higher and ahead of the other. I couldn't tell if it was directly in front of the other or not. I was in the car in traffic and heard no sound from the spheres.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 158.62802129054683
  },
  {
    "date_time": "11/7/2012 19:30",
    "shape": "Other",
    "duration": "45-60 seconds",
    "city": "Delray Beach",
    "state": " FL",
    "latitude": 26.46053359,
    "longitude": -80.09048323,
    "comments": "Huge, boomerang shaped, unlit object flying over the cirrus clouds, N to S over Delray Beach, FL, 2 witnesses  Date:  11/7/2012 Time: approximately 7:30 to 7:40 pm Location: Delray Beach, Florida   We walked out of our condo to go for a short walk.  Looked up into the sky to check out the stars.  I observed a huge, boomerang shaped object moving from North to South.  I pointed it out to my friend.  At first, I thought that it was a formation of birds since the shape was somewhat of a Vee, but with rounded edges.  However, it was dark and birds don&#8217;t usually fly in formation, at night.  There were no visible lights on the object.  It moved silently, high above the cirrus clouds which were at a very high altitude.  Commercial airline traffic was in the air, at much lower altitudes.  These aircraft were dwarfed by the object that we observed. We were amazed at the size of this flying object or formation.  It moved at a very high speed and, within 45 to 60 seconds it could no longer be seen.",
    "distance": 162.3024608405958
  },
  {
    "date_time": "11/15/2012 7:45",
    "shape": "Light",
    "duration": "2 minutes",
    "city": "Coral Springs",
    "state": " FL",
    "latitude": 26.27505152,
    "longitude": -80.24988415,
    "comments": "3 reddish colored ball of light and an aircraft of somekind were seen on university drive and sample road in coral springs .  ON THURSDAY NOVEMBER 15, 2012, MY DAUGHTER AND I WERE TRAVELING NORTH ON UNIVERSITY DRIVE IN CORAL SPRINGS FL WHEN WE APPROACHED SAMPLE ROAD AND NOTICED ON THE WEST SIDE OF OUR VEHICLE OUTSIDE OUR WINDOW 3 RED/ORANGE COLORED LIGHTS IN THE SKY THAT WERE TRAVELING SOUTH AND LOOKED LIKE FIRE.  THEY WERE ROUNDISH SHAPED.   THERE WAS AN AIRCRAFT OF SOME KIND THAT FLEW RIGHT THROUGH ONE OF THEM OR SO IT APPEARED THAT WAY.  THE 3 LIGHTS SLOWLY FADED OUT.   MY DAUGHTER TOOK PICURES ON HER CELL PHONE BUT THEY PICTURES ONLY SHOW THE LIGHTS BUT NOT THE COLOR OF THEM.",
    "distance": 168.14590871687082
  },
  {
    "date_time": "11/9/2012 21:30",
    "shape": "Sphere",
    "duration": "2 minutes",
    "city": "Coral Springs",
    "state": " FL",
    "latitude": 26.27505152,
    "longitude": -80.24988415,
    "comments": "Orange Spheres flying over Coral Springs  My sister and I were going to the Coral Springs Country Club and were walking from the car in the parking lot to the front door. I looked up at the sky and noticed a round orange sphere coming from the Northeast and heading toward the Southwest.  It was flying at a higher altitude than the usual air traffic and it was flying pretty fast.    As it passed overhead it started flying faster and turned upward and disappeared from view.  My sister and I were both wondering what it was since it did not look like anything that we had ever seen flying in the sky.  We came out of the country club a little over an hour later.  I again looked up at the sky and noticed that clouds had moved in.    As I looked toward the Northeast I noticed a round orange sphere (again!!) going toward the Southwest.  This time it was flying lower than the previous one that we had seen.  As it was coming towards us another orange sphere came up behind it.  It was probably a few miles behind it but it was following the same trajectory path as the one in front of it.    Both spheres flew into the clouds and disappeared from our view.",
    "distance": 168.14590871687082
  },
  {
    "date_time": "11/2/2012 19:00",
    "shape": "Light",
    "duration": "several minutes",
    "city": "Coral Springs",
    "state": " FL",
    "latitude": 26.27505152,
    "longitude": -80.24988415,
    "comments": "It moved way too fast to be a plane or helicopter, and it was silent.  I saw something in the sky last night I didn't know how to ID.  I tried to film it but couldn't get a good view.    Driving north on Coral Ridge between Sample and Wiles, I saw a flashing orange light overhead. Within about a half-second, it moved significantly westward.    Then, it alternated 2 lights; 1 light; and so on.",
    "distance": 168.14590871687082
  },
  {
    "date_time": "11/5/2012 1:24",
    "shape": "Fireball",
    "duration": "20 minutes",
    "city": "Weston",
    "state": " FL",
    "latitude": 26.10891758,
    "longitude": -80.40305267,
    "comments": "Amazing light show, with no answers!  While exiting I75 onto 595 around the time of 1:20 am in weston florida. I experienced 6 orange glowing orbs that seem to have taken off from a tree line and accending toward and past the moon.No sound radiating and the movement of the objects seem to be controlled. This is strange. I cannot rationalize what i witnessed   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 174.20393723930553
  },
  {
    "date_time": "11/7/2012 0:30",
    "shape": "Circle",
    "duration": "4 seconds",
    "city": "Cutler Bay/Miami",
    "state": " FL",
    "latitude": 25.9793974,
    "longitude": -80.20254528,
    "comments": "A steady white light falling slowly from the sky.  Disappeared just a second before it fell behind the tree line.",
    "distance": 187.6193638670589
  },
  {
    "date_time": "11/2/2012 7:00",
    "shape": "Unknown",
    "duration": null,
    "city": "Miami",
    "state": " FL",
    "latitude": 25.9793974,
    "longitude": -80.20254528,
    "comments": "There were bright lights couldn't real tell the shapes of them but it was pretty cool and amazing to see this the the little triangle formation that they was in an the way they just took off was at the speed off lighting   ((NUFORC Note:  We suspect a hoax because of the error in the time and date.  The witness, who elects to remain totally anonymous, submitted the report on Thursday night for a sighting that allegedly occurred on Friday morning.  Not possible.  PD))",
    "distance": 187.6193638670589
  },
  {
    "date_time": "11/2/2012 7:00",
    "shape": "Unknown",
    "duration": null,
    "city": "Miami",
    "state": " FL",
    "latitude": 25.9793974,
    "longitude": -80.20254528,
    "comments": "There were bright lights couldn't real tell the shapes of them but it was pretty cool and amazing to see this the the little triangle formation that they was in an the way they just took off was at the speed off lighting   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 187.6193638670589
  },
  {
    "date_time": "11/1/2012 23:30",
    "shape": "Fireball",
    "duration": "&lt;1 minute",
    "city": "St. Simons Island",
    "state": " GA",
    "latitude": 31.18237928,
    "longitude": -81.38521042,
    "comments": "Two people witness 5+ dull orange spheres.  My wife and I were sitting in a rented, beach front condo, 4th floor open air balcony around 11:30 pm.  The condo is on a Georgia island in the Atlantic ocean.  The night sky was clear with the final stage of a full moon.    My wife was the first to notice a dull orange sphere floating above the condo unit opposite of where we were observing.  It appeared to move and float without a sound.  The sphere seemed to be traveling along the beach, but then made a 90 degree turn and headed out over the ocean, disappearing in the darkness.    This same route and sequence was soon repeated by 5 or more other, identical looking dull orange spheres.    This was observed for approximately one minute or less.?",
    "distance": 192.32228135197164
  },
  {
    "date_time": "11/10/2012 20:00",
    "shape": "Triangle",
    "duration": "15 minutes",
    "city": "Vidalia",
    "state": " GA",
    "latitude": 32.21658338,
    "longitude": -82.41167589,
    "comments": "orangish lights floating over a field then disappearing and reappearing later over another field.  As my friend and I were driving we noticed a cluster of orangeish lights hovering over a field (they kinda looked like old street lights)  They were about 50 feet off of the ground and stayed there for a few minutes.  They disappeared then reappeared just a mile or two away over another field.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 268.1011665212996
  },
  {
    "date_time": "11/8/2012 20:00",
    "shape": "Fireball",
    "duration": "5 seconds",
    "city": "Walterboro",
    "state": " SC",
    "latitude": 32.89596028,
    "longitude": -80.67579228,
    "comments": "Green/orange fireball trailing black smoke.  The object was an egg shaped fireball, coloration orange and green with white flashes.  It was trailing smoke and coming in at a very steep angle at a fast rate of speed.  My wife and I saw it, also saw runner lights from a small aircraft almost immediately after.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 314.96638699861126
  },
  {
    "date_time": "11/7/2012 21:00",
    "shape": "Circle",
    "duration": "5 minutes",
    "city": "Mount Pleasant",
    "state": " SC",
    "latitude": 32.85842435,
    "longitude": -79.83850577,
    "comments": "Coastal residents near Mount Pleasant SC witness 5 bright orange round lights darting among each other at 9:00 PM on Wednesday, Nov-7th  My co-worker reported to me this morning that last night, he saw 5 Round Orange Lights - similar in shape, size, and height to those reported as seen by my neighbors 8:00 PM November 4 over Sullivan's Island SC. He reports that the 5 he saw while driving eastbound across the Isle of Palms Connector were noiselessly darting among each other above the Inter-coastal Waterway between Mount Pleasant and Isle of Palms SC at 9:00 PM and that the intensity of the lights faded slowly in and out for about 10 seconds before fading completely out.",
    "distance": 324.662683647265
  },
  {
    "date_time": "11/3/2012 20:00",
    "shape": "Circle",
    "duration": "30 minutes",
    "city": "Mount Pleasant",
    "state": " SC",
    "latitude": 32.85842435,
    "longitude": -79.83850577,
    "comments": "SC coastal residents near Charleston witness single file orange lights at 8 PM moving slowly due North, eventually fading from sight  My neighbors reported seeing about 20 round orange lights in a single file formation, moving slowly and noiselessly in a synchronized, due North direction across the night sky above Sullivan's Island SC from the vantage point of the Intra-coastal Waterway causeway road connecting Sullivan's Island and Mount Pleasant SC.   My neighbors were traveling on this road as were many other people, most of whom stopped along the side of this causeway as they did, to stare and wonder.  When asked about the height of these lights, they explained they could appear to be a slow moving formation of helicopters, but helicopters around here and at that height make a loud sound.  That many of them would definitely have been heard.  But from these, no sound emanated or was heard.    Also, they explained that these lights diminished in intensity, or in number, from sight as a few at a time and eventually all of them, faded out of sight, like wicker oil lamps being turned down then off.",
    "distance": 324.662683647265
  },
  {
    "date_time": "10/29/2012 23:00",
    "shape": "Fireball",
    "duration": "5 seconds",
    "city": "Goose Creek/Hanahan",
    "state": " SC",
    "latitude": 32.98115936,
    "longitude": -79.97477608,
    "comments": "On 10/29/12 at 11:00pm, we were driving on Henry E Brown Jr. Blvd from hanahan towards Goose Creek,SC just passing Yeamans Hall Rd. while we were just over a little river we suddenly saw a huge fire ball coming down from the sky at the north east from where we were at.  It was greenish/Blue around and reddish/orange and lighter in the center with a little tail coming straight down.  We were not able to see where did arrive because it is a forest area.  We were stoning, we never saw anything like that before it was so fast, just unbelievable.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 330.2707901902416
  },
  {
    "date_time": "11/5/2012 19:36",
    "shape": "Formation",
    "duration": "3-7 seconds",
    "city": "Moncks Corner",
    "state": " SC",
    "latitude": 33.19958594,
    "longitude": -80.0007233,
    "comments": "On 11/5/12 seven lights were seen that appeared in a sequence, making a perfect line in the sky, and then disappeared.  While driving down 17-A from summerville towards Moncks Corner, my wife and I observed three lights in the sky off to our right.  These lights looked like an airplane making a turn in the sky. What caught our attention was the altitude of said lights.  They were low for the planes we normally see flying over that area.  The center light was almost a blue with the two other lights on either side of it being orange and equally distanced from the center one.  Four more lights appeared to the left of the three already visible lights.  The way they appeared was one right after the other, almost like the runway marker lights of an airport, one right after the other. As soon as the fourth new light, or seventh total light appeared, all seven went out simultaneously and were not seen again.  The initial three lights were seen over trees, and guessing distance, I would have to guess they were between the area of Highway 176 and Cypress Gardens Rd.  The other four lights that appeared were seen over 17-A.  All seven lights were in a perfect line and spaced equally apart from each other.  The furthest left light was at the highest altitude with the furthest right light being at the lowest altitude.  The best description of the lights were almost flare like without the long falling, strobing, associated with flares.  The lights appeared to never move direction.  It was like a light switch, first they were flipped on in sequence, then they were shut off all at the same time.  The background for this sighting was a clear dark night, with stars clearly visible in the sky.",
    "distance": 344.2988443168541
  },
  {
    "date_time": "11/13/2012 21:30",
    "shape": "Triangle",
    "duration": "2 minutes",
    "city": "West point",
    "state": " GA",
    "latitude": 32.8789041,
    "longitude": -85.16159516,
    "comments": "triangle shaped lights over KIA motors manufacturing Georgia  At 9:30 pm I was walking towards the building I work at, KIA motors manufacturing Georgia.  Above the building and off in the distance I saw a large object flying overhead.  All I could make out was seven lights forming a triangle.    The object was moving a little slower than the airplanes that I am accustomed to seeing.  The object moved in complete silence.  I followed the object through the sky until the parking lot lights made it impossible to see the object anymore.  The whole encounter lasted about one minute     After arriving in the building and discussing this with other employees I learned I was not the only one who saw something strange.  A co worker of mine said he saw what looked like two shooting stars chasing each other.   Another said he could here jets flying overhead but saw nothing.",
    "distance": 375.4618541036174
  },
  {
    "date_time": "11/6/2012 18:26",
    "shape": "Circle",
    "duration": "20 seconds",
    "city": "Pawleys Island",
    "state": " SC",
    "latitude": 33.426123,
    "longitude": -79.12523153,
    "comments": "On 11/06/2012 at 6:26 pm at Pawley's Island SC I observed 4 stationary red orange orbs of the same size in a straight horizontal pattern about 45 degrees above the horizon.   They suddenly disappeared without ever having changed position.  In the same direction as the red orbs that had just disappeared, a white strobe like light then flashed briefly but noticeably from horizon upward.",
    "distance": 376.1833958440118
  },
  {
    "date_time": "11/8/2012 17:00",
    "shape": "Triangle",
    "duration": "5 minutes",
    "city": "Hampton",
    "state": " GA",
    "latitude": 33.38434735,
    "longitude": -84.28728819,
    "comments": "red balls of light in a triangular  formation at low altitude.  i was driving approx. west on jonesboro road towards my home and noticed three bright red lights  in an triangular formation on the horizion at  the 10 o'clock position .as i continued driving the lights were moving along  the treeline  towards me .my vehicle and the lights intersected approx  5 minutes later ,and i lost sight of it .it appeared several times to be going both away and towards me alternating with out leaving its course,they were a not so much as bright ,but a very  dense, deep  ,or intense quality.",
    "distance": 379.7596855475198
  },
  {
    "date_time": "11/10/2012 20:30",
    "shape": "Light",
    "duration": "5 minutes",
    "city": "Murrells Inlet",
    "state": " SC",
    "latitude": 33.56307004,
    "longitude": -79.05777647,
    "comments": "15-20 orange/reddish orbs, moving in a similar pattern, heading south, then disappearing.  15 - 20 orange/reddish orb type lights &quot;floating&quot; south then disappearing and reappearing.  There was no sound whatsoever.  Smaller orbs were breaking off some of the larger orbs.  They were all moving in a similar pattern.  Some higher than others.  They were moving together in a line but it was not a perfectly straight line.    Later that night, I do not know if the lights were related, but there was a green falling flash that came out of an empty sky.  The green ligh happened around 3am.",
    "distance": 386.41164193733835
  },
  {
    "date_time": "11/9/2012 17:00",
    "shape": "Other",
    "duration": "15 minutes",
    "city": "Lawrenceville",
    "state": " GA",
    "latitude": 33.95676378,
    "longitude": -84.00280527,
    "comments": "Double Columns of light in lawrenceville, ga  At approximately 1700 hrs on the evening of 9 November 2012, this person and his wife were exiting Sugarloaf Mills Mall when the two of them saw what appeared to be two very large columns of light side by side in the West/Northwestern sky.  The lights appeared not to be reflections, but emanating from whatever the craft was itself.  They looked perhaps like the fire one would see from a jet propulsion engine, but they were vertical rectangular/cylindrical in shape.  No trail, as one would see with a con-trail from an airplane, was left.    The two witnesses thought perhaps it was the international space station, although it looked to be too large and too close to be so.    It drifted slowly from the West/Northwestern sky to the Northern sky as its distance became greater.    The two witnesses watched as the craft went between the clouds and the horizon, in front of the clouds, so the two witnesses realized it must not be anything too far in the sky.  It appeared to be flaming, as a comet would.    As it drifted further away, the two witnesses conferred that it could still be seen at a distance of at least fifteen miles.  END REPORT.   ((NUFORC Note:  Possible contrails??  PD))   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 409.5649322063834
  },
  {
    "date_time": "11/5/2012 19:08",
    "shape": "Formation",
    "duration": "9-12 seconds",
    "city": "Myrtle Beach",
    "state": " SC",
    "latitude": 33.81113489,
    "longitude": -78.69839864,
    "comments": "Fleet Formation of 7 fireballs in a linear pattern.  Formation of 7 fireballs in a linear pattern.  Witnessed from two different distances within the same 10 mile radius.  3 lit up an orange-golden amber in an ascending line segment of about 45 degrees.  Another three followed the same light up pattern totaling 6 visible at once.  Each of them dimmed in the same pattern as they fired.  As the last two were dimming a 7th light identical to the other 6 followed the same pattern of dimming.",
    "distance": 410.5427301837702
  },
  {
    "date_time": "11/4/2012 19:00",
    "shape": "Formation",
    "duration": "2 minutes",
    "city": "Myrtle Beach",
    "state": " SC",
    "latitude": 33.81113489,
    "longitude": -78.69839864,
    "comments": "Bright orange lights in a formation, some seperation movement, then vanish in SC.  I was standing outside my front door having a cigarette and just happened to look towards the lower sky in front of me.  I see 4 or 5 orange glowing lights almost in a circle/oval type shape, they didn't move at first, then it appeared at least two of them started moving into the center of the formation after a min or so and then all of the lights vanished at the same time.  The lights were brighter than stars and all of them glowed orange in color.  After they vanished i heard faint rumbling sounds like thunder for about 30 seconds in the sky.  This was not very high in the sky either....from my view point the lights were maybe 300-500 feet in the air.  I noticed flashing lights from aircraft shorty afterwards flying around and through the area.",
    "distance": 410.5427301837702
  },
  {
    "date_time": "11/2/2012 22:00",
    "shape": "Fireball",
    "duration": "10 seconds",
    "city": "Litchfield Beach",
    "state": " SC",
    "latitude": 33.81113489,
    "longitude": -78.69839864,
    "comments": "Bright orange light descending towards ocean, two flashes and then it looked like it just dissipated.",
    "distance": 410.5427301837702
  },
  {
    "date_time": "10/30/2012 23:00",
    "shape": "Light",
    "duration": "~1 second",
    "city": "Myrtle Beach",
    "state": " SC",
    "latitude": 33.81113489,
    "longitude": -78.69839864,
    "comments": "A bright light moving across the sky, then it changed direction.  I was taking my 2 dogs out for their evening bathroom break and it was around 11 at night on Oct 30, 2012.     While I watched my dogs do their thing I caught a bright small white light out of the corner of my eye.  It was moving across the sky north of my house and was moving from East to West.  It was moving so fast that it traversed the sky in less than a second.    As it was approaching the West side of the horizon, it turned its trajectory away from the ground and disappeared  from view.  It was totally silent and appeared to be fairly high up.    I did see something similar to this sighting a couple of years ago, but didn&#8217;t report it.",
    "distance": 410.5427301837702
  },
  {
    "date_time": "11/18/2012 21:05",
    "shape": "Fireball",
    "duration": "1-2 minutes",
    "city": "Roswell",
    "state": " GA",
    "latitude": 34.01465617,
    "longitude": -84.34031652,
    "comments": "Reddish Orange fireballs over Roswell Georgia  My sighting started at approximately 9:05pm EST.  I was on the back porch of my home looking to the north,north east , away from the moon which was approximately 180 degrees the other direction and below the tree line. This is my largest view of the night sky as i am mostly surrounded by very tall trees.  I was sitting facing this direction and noticed 2 bright reddish orange lights emerging over the tree line at 30 degrees off compass north, which is my horizon and the lowest tree line in sight.  The lights appeared about an inch apart from my point of view moving from what appeared to be an East to West bearing.  The lights were bright but not as bright as Jupiter which was off to my right which i see regularly and is often the brightest object in the sky other than the moon.  The sky was completely clear, and i could see stars on the tree line/ horizon in the background, as well as a few passing/blinking planes in the same approximate area as for comparison. I am very familiar with the air traffic around this area and am very familiar with the the flight paths over this area as it seems to be a relatively high traffic area for planes.  However this was nothing like anything i have seen for myself before.  The 2 lights we diverging and disappeared in about 10-15 seconds.  They seemed to be ascending horizontally rather than any sort of decent, as possibly a flare would have, and were moving at a steady rate.   The relation to each other was about 12 o&#8217;clock and 5 o! &#8217;clock top to bottom, as if a plane was on an extremely high banking maneuver, although the lights seemed much too far apart and to quickly moving to be one object.  I quickly determined that these lights were not connected because they seemed to be drifting apart from one another while holding their bearing of East to West while moving at their own independent rates of speed.  When i stood up out of curiosity and took about 3 steps forward, about 10-15 sec later, 3-4 more of the same objects appeared as the 2 before over the same spot heading in the same direction.  My house is situated on a hill and i immediately went up the hill to gain a better perspective and as i did a total of 6-7 lights appeared moving in this similar direction.  I grabbed my iPhone and began recording what i could.  It was completely dark so i didn't know if they would show up or not, but despite the neighbor&#8217;s patio light glaring against the camera i managed to capture s few of the lights.  Unfortunately i stopped recording on accident when i starting moving up the stairs to the top of the hill, so when i got to the top i started another recording.   Although ! you can make out some of the lights in the video it really does no justice to the sighting as i was filming on a phone at night and had a bad glare.  I happen to be a videographer/ video editor and hesitate to post the footage due to its poor quality even though some of the lights are visible in the video it is certainly not a definitive piece of evidence in any way as to what these lights were or really even their bright reddish orange color. Mostly it will serve as documentation to myself that it actually happened.  With in about a minute all of the lights disappeared in front of me, not in any kind of sequence and although they were flying in some sort of formation relative to one another,  there was no recognizable pattern.  These lights were not blinking but had some sort of vague pulsing regularity that never stopped until they disappeared.  There was also no noise whatsoever before the sighting, during or after.  I stayed for about 20 min examining the sky for any further explanation but had no further sightings.",
    "distance": 420.62091100380644
  },
  {
    "date_time": "11/8/2012 19:00",
    "shape": "Oval",
    "duration": "15 seconds",
    "city": "Loris",
    "state": " SC",
    "latitude": 34.05824582,
    "longitude": -78.89316864,
    "comments": "We were driving southeast towards the direction of North Myrtle Beach and saw 4 separate bright orange lights high in the sky.  We were very alarmed.     When we saw the lights there were only 2 at first, then another appeared then the 4th appeared.  They were spread out in a diamond shape. When they disappeared they did so in order like 4, 3, and then the last 2 went out at the same time.   I believe the whole thing lasted about 15- 30 seconds.  When the lights went out it was as if a door was pulled accross them from left to right and each one went out in this sequence.    I do not believe this could have been flares because they appeared and went out in a very orderly way as if it was in a pattern that someone was controlling.",
    "distance": 421.5932080364551
  },
  {
    "date_time": "10/28/2012 23:07",
    "shape": "Unknown",
    "duration": "10 seconds",
    "city": "Marietta",
    "state": " GA",
    "latitude": 33.95398699,
    "longitude": -84.55293782,
    "comments": "Sky changed color in several bright flashes.  The entire sky changed color red green and purple illuminating heavy cloud cover for the entire field of vision.  The event was in progress when I was told to observe, I do not know how long it had been going before it was noticed.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 421.8584309718347
  },
  {
    "date_time": "11/4/2012 20:45",
    "shape": "Fireball",
    "duration": "10 minutes",
    "city": "Woodstock",
    "state": " GA",
    "latitude": 34.09812942,
    "longitude": -84.51243034,
    "comments": "Woodstock Georgia 8:45pm 11/4/2012 several balls of fire in sky  This was witnessed in Downtown Woodstock.  There were at least nine, no  more than 12 balls of fire in the sky.  They didn't appear to be moving.  They didn't seem to be any type  of aircraft that was flying; they literally looked like balls of fire, like a constellation.   When I got to my car they were gone.  I tried to take pictures with my cell phone, but was unable to because it was dark and the phone couldn't focus.",
    "distance": 429.90559137451515
  },
  {
    "date_time": "11/8/2012 21:30",
    "shape": "Fireball",
    "duration": "5 seconds",
    "city": "Whiteville",
    "state": " NC",
    "latitude": 34.32561602,
    "longitude": -78.69968375,
    "comments": "I was driving down a rural Highway 701S leaving Clinton, NC going towards Myrtle Beach, SC.  While in Whiteville, NC, on 701S I witnessed a ball of fire approximately the size of what a hot air balloon would look like a mile away, it appeared to have an engine trail behind it and it appeared to have landed in a field of trees to my left. It was at least a mile ahead of me at the time, I could not get a photo, it was much too fast, within 4-5 seconds it had disappeared into the trees.  I looked up into the sky to see if anything else was coming and there appeared to be hundreds of bright stars in the sky.",
    "distance": 442.9226717416536
  },
  {
    "date_time": "11/3/2012 22:05",
    "shape": "Circle",
    "duration": "objects in the sky",
    "city": "Greenville",
    "state": " SC",
    "latitude": 34.8404398,
    "longitude": -82.38647697,
    "comments": "There were 50 to 60 colored objects slowly moving across the sky.  Last night 11/03/2012 around 10:05 pm, as I was on my way to work, I looked up into the sky and seen a lot of objects slowly moving to the west.  There were at least 50 to 60 0f them.  They looked to be almost round in shape and about the size of a basketball.  They were red and orange colored and looked like a small flame around them.   I pulled my truck over and got out to get a better look at them.  I did not hear no sound in the sky.  I tried to take pictures of these objects with my camera phone but as I aimed my camera toward the sky all I could get was a black screen.  I couldn&#8217;t believe what I was seeing.    I stood there and watched the objects for about 10 minutes and had to leave.",
    "distance": 447.27968904845835
  },
  {
    "date_time": "11/7/2012 20:35",
    "shape": "Light",
    "duration": "10 minutes",
    "city": "Wilmington",
    "state": " NC",
    "latitude": 34.21850551,
    "longitude": -77.89953223,
    "comments": "Two stationary orange lights in the sky flickering on and off, fading to a reddish color before dissapearing.  Two orange lights/orbs appeared in the sky in Wilmington, North Carolina.  These lights were visible for 10-20 seconds before fading away.    After a few minutes, a single orange light/orb appeared at the same spot, was visible for roughly the same time period before fading away.    After a few more minutes, the light appeared for a third time, visible for several seconds before fading to a reddish/orange color and finally flickering out.   Throughout the duration of the sightings, the lights did not appear to move or change position, and no sounds were heard",
    "distance": 456.5691297858966
  },
  {
    "date_time": "11/18/2012 6:40",
    "shape": "Unknown",
    "duration": "30 seconds",
    "city": "Birmingham",
    "state": " AL",
    "latitude": 33.54944719,
    "longitude": -86.79825125,
    "comments": "Fast Light Moving  a bright light moving extremely fast over the red mountain express, with a tail of fire, lasted about 5 secs and the light went out.",
    "distance": 471.1032523209118
  },
  {
    "date_time": "11/13/2012 5:37",
    "shape": "Egg",
    "duration": "2-3 minutes",
    "city": "Birmingham",
    "state": " AL",
    "latitude": 33.54944719,
    "longitude": -86.79825125,
    "comments": "metallic object rolling across morning sky  Walking to my car this morning, I looked up into the sky and looked at a pair of stars for a moment.    All of the sudden a spherical/oval - metallic object (almost looked like it had a line down the middle) was moving past the first star, almost as if it was &amp;quot;rolling&amp;quot;.  Object continued moving past second star and over my head.  All I could do was stand there with my jaw dropped.  Checked satellite trackers and the only one that came through the area thirty five minutes prior - lasting for a duration of 5 minutes.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
    "distance": 471.1032523209118
  },
  {
    "date_time": "11/8/2012 20:00",
    "shape": "Circle",
    "duration": "1 minute",
    "city": "Gulfport (near)",
    "state": " MS",
    "latitude": 30.435995000000002,
    "longitude": -89.05639642,
    "comments": "Circular aircraft casting green spiral light flying north from the gulf.  Driving on the I-10 east near the canal st exit, a circular strobing green light roughly 40 feet in diameter passed over the road.  The aircraft was moving perpendicularly to the road.  As it passed over the road the circular light strobed over the whole highway 2-3 times.    We then looked up toward the sky we saw a circular aircraft flying at an altitude of about 100-150 feet northbound.  Very hard to describe the light, but it was very bright, when we then discussed it afterward, we both drew the exact same picture.    This light had a very particular shape and pattern to it that was clear to both of us.",
    "distance": 471.4379347772808
  },
  {
    "date_time": "11/7/2012 11:30",
    "shape": "Changing",
    "duration": "10 minutes",
    "city": "Gulfport (near)",
    "state": " MS",
    "latitude": 30.435995000000002,
    "longitude": -89.05639642,
    "comments": "11:30am in gulfport,  MS cigar shape craft broke into two ships lasted 15 mins a plane couldnt land circled 3xs    I noticed a reg.plane circling and can't land.went into circles three times on hwy 49 in the back was a white sigcare shape going right then went left then broke off Into two shapes kept looking then they disappeared and noticed the plane had to Go towards biloxi from gulfport to keesler airforce base.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 471.4379347772808
  },
  {
    "date_time": "11/1/2012 21:00",
    "shape": "Triangle",
    "duration": "2 minutes",
    "city": "Oneonta",
    "state": " AL",
    "latitude": 33.95200796,
    "longitude": -86.47247545,
    "comments": "immediate u- turn. no noise.  I came out to let my dog use the bathroom and was walking with her to the back yard.  I looked up above the trees on the mountain behind the house and seen three rectangular lights in a triangle shadow moving slow with no noise at all.  It was coming straight at me but then did an immediate u-turn and slowly went back over the trees.  I knocked on the back door and had my wife come look at it and as soon as she seen it, it shot off very fast. It did make a sound like loud wind.",
    "distance": 480.1757544261724
  },
  {
    "date_time": "11/16/2012 10:42",
    "shape": "Sphere",
    "duration": "1.5 minutes",
    "city": "Newton",
    "state": " NC",
    "latitude": 35.66907306,
    "longitude": -81.22066165,
    "comments": "Fiery orange/red ord traveling across the sky  Fiery orange/red orb appeared south east of our home.  It was extremely large (making venus look small in the sky) it moved in a rather fast clip across the sky toward the west and eventually changed directions and headed south, we lost track of it after that due to the tree line.  It had no sound at all and seemed to pulse, like an ember from a fire.  This is the second time we have seen this exact same thing.  The first time was 11/2 at 9:47pm and it appeared to ascend into the sky at the same location as the 11/16 object, however this first time it rapidly traveled north and eventually faded out. Again, it had no sound.",
    "distance": 502.4305417630909
  },
  {
    "date_time": "10/30/2012 15:00",
    "shape": "Circle",
    "duration": "unknown",
    "city": "Cullman",
    "state": " AL",
    "latitude": 34.17660902,
    "longitude": -86.82329734,
    "comments": "white circle, looked like it may have something on the bottom maybe an &quot;X,&quot; can't tell from pictures  Taking pictures of the rainbow effect seen yesterday around the sun, later when zooming in to look at the rainbow noticed the circle... took 4 pictures (three around the same time and 1 about 3 hours later) noticed that it was in all 4 shots in different areas (even the first three that were taken anywhere from 1 to 3 minutes apart the circle shows up in different areas).",
    "distance": 504.8530011154765
  },
  {
    "date_time": "11/10/2012 19:00",
    "shape": "Other",
    "duration": "15 minutes",
    "city": "Chattanooga",
    "state": " TN",
    "latitude": 35.04537556,
    "longitude": -85.25562318,
    "comments": "400 foot long craft with half circle lights  a long sequence of lights attached to a craft approximately 400 feet wide with half circle shaped lights on bottom followed by 6 other smaller crafts throughout the area.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 507.1701797060171
  },
  {
    "date_time": "10/29/2012 23:15",
    "shape": "Teardrop",
    "duration": "few seconds",
    "city": "Chattanooga",
    "state": " TN",
    "latitude": 35.04537556,
    "longitude": -85.25562318,
    "comments": "I saw a blue teardrop object fall from the sky.  I was driving northbound on I-75 in Chattanooga, TN, when I saw a blue light in the shape of a tear drop fall out of the sky.  This light seemed darker on the outside and lighter on the inside.   I only saw the object for a few seconds and then the object disappeared.",
    "distance": 507.1701797060171
  },
  {
    "date_time": "10/31/2012 22:13",
    "shape": "Circle",
    "duration": "4 seconds",
    "city": "Statesville",
    "state": " NC",
    "latitude": 35.80211614,
    "longitude": -80.85983463,
    "comments": "bright, fast, silent  I was standing in the driveway talking, something caught my eye above i looked up it was a very bright round light it didnt look very high in the sky, and was moving super fast it went over the yard in seconds.   I didnt hear a noise come from it at all.",
    "distance": 512.906189096556
  },
  {
    "date_time": "11/15/2012 19:08",
    "shape": "Other",
    "duration": "5 seconds",
    "city": "Lexington",
    "state": " NC",
    "latitude": 35.79050387,
    "longitude": -80.27217526,
    "comments": "Very small dimly lit object the size of a tennis/ racquetball silently flies a few feet over my house in the night sky.  I was sitting in my backyard on a small patio petting my dog when a very dimly light object about the size of a tennis ball/racquetball flew in a straight line just a few feet over my rooftop through the backyard out of site into the trees.  The backyard is about a half acre deep to a fence line which adjoins to a cow pasture.   It is about 50 - 75 feet before the tree line begins in the cow pasture.  Not a bird as it had no wings and was utterly silent.  It did not lose any altitude and was so dimly lit that it disappeared as soon as it passed over.  It seemed to have a very fine, thin trail at least 25+ ft that also dissolved into thin air.  Very eerie experience. I have never seen anything that substantial in size fly in such a straight pattern so quietly in the dark.",
    "distance": 516.0542378319719
  },
  {
    "date_time": "11/18/2012 1:40",
    "shape": "Other",
    "duration": "10-20 seconds",
    "city": "Pigeon Forge",
    "state": " TN",
    "latitude": 35.78757332,
    "longitude": -83.55877141,
    "comments": "Cloud like structure flew quickly across the sky.  Standing on our balcony smoking a cigarette, girlfriend and I were looking at the stars hoping to see some Leonids.  A bright cloud like structure came into view from the Eastern sky, and quickly jetted across the entire skyline. It was similar in shape to this little mspaint thing I drew up:   http://i.imgur.com/795OK.jpg    It lasted about ten to twenty seconds.",
    "distance": 523.1711038532052
  },
  {
    "date_time": "11/8/2012 23:21",
    "shape": "Disk",
    "duration": "45 seconds",
    "city": "Bogalusa",
    "state": " LA",
    "latitude": 30.78312469,
    "longitude": -89.86343625,
    "comments": "Craft emits no light or sound flys over just able to see reflection and blacked out stars as it passed  I happened to walk outside around 11 at night to let the dogs out and on my way in around 20 min later I noticed what looked like a dim reflection of a flying craft that was within 500 ft of the ground.  The craft then I could tell was indeed round and was blocking out the stars as it passed heading north to south at a slow speed making no noise and emitting no light but a reflection on the leading edge as it neared the southern edge of town near bens ford wildlife management area it took off at an extreme rate of speed with no sound",
    "distance": 524.1565564668812
  },
  {
    "date_time": "11/12/2012 18:50",
    "shape": "Triangle",
    "duration": "20 seconds",
    "city": "Clayton",
    "state": " NC",
    "latitude": 35.65034523,
    "longitude": -78.45972392,
    "comments": "BLACK TRIANGLE  I WAS DRIVING HOME FROM WORK LAST NIGHT [11/12/20120]HEADING DOWN HWY 40 SOUTH OF RALEIGH N.C. CLOSE TO THE EXIT FOR HWY 70 AND SAW A TRIANGLE CRAFT WITH 3 LARGE WHITE LIGHTS IN THE CORNERS.  THE CRAFT WAS LOW AND MOVING SLOW. IT WAS GOING FORWARD BY THE LARGE FLAT SIDE AND NOT ONE OF THE POINTS, I THOUGHT THIS WAS ODD. IT WAS AN OMG MOMENT AND I DID NOT GET A PICTURE AS I COULD HARDLY TAKE MY EYES OFF OF IT UNTIL IT DISSAPPEARED OVER THE TREE LINE. IT DID NOT MAKE ANY NOISE THAT I COULD HEAR AND SHOULD HAVE FALLEN FROM THE SKY AT THAT SPEED.",
    "distance": 532.8703617668357
  },
  {
    "date_time": "11/10/2012 20:32",
    "shape": "Changing",
    "duration": "3-4 minutes",
    "city": "Cut Off",
    "state": " LA",
    "latitude": 29.51891068,
    "longitude": -90.32462271,
    "comments": "Low-flying, shape-changing aircraft seen in a small Southern Louisiana town.  My mother, aunt, cousin, boyfriend and I were driving up my street earlier to go to a fair.  My mom, who is a skeptic on such things, stops the car when she sees a low-flying craft right nearby.  It was dark, so we couldn't see much except for changing, flashing lights.   The lights came from different areas of the craft, and it looked a bit like a trapezoid, but then seemed to change shape.   Getting out of the car, there was a quiet drone unlike anything I've heard before.   Soon it started flying away at incredible speed.  That's the second UFO I see close to my home, and to think so live in a town so small, most maps don't even recognize it.",
    "distance": 534.3039932343478
  },
  {
    "date_time": "11/10/2012 12:08",
    "shape": "Teardrop",
    "duration": "30 seconds",
    "city": "Dandridge",
    "state": " TN",
    "latitude": 36.02156912,
    "longitude": -83.41788566,
    "comments": "Blimp shaped, shiny silver object during TN Earthquake.  During an earthquake, I witnessed a UFO shaped like a blimp, very shiny silver in color, no wings, no vapor trail and no sound.  Moving slowly in a straight line directly above my house.  No cloud coverage.  I could not see any windows but it was extremely shiny and bright so there could have been.  The UFO was not as low as a helicopter but much lower than a commercial aircraft.  No other aircrafts were in the sky at the time.  Once the earthquake was over the object could not be seen.",
    "distance": 537.2107766371544
  },
  {
    "date_time": "11/8/2012 21:00",
    "shape": "Triangle",
    "duration": "1 minute",
    "city": "High Point",
    "state": " NC",
    "latitude": 36.08058175,
    "longitude": -79.9775474,
    "comments": "slow moving Triangle made no noise  Had gone out to check the mail and while at the mail box noticed lights above.  Six white lights on the bottom of triangular shaped craft.  The lights formed a triangle inside a triangle.  It was extremely low and moved very slow.  It made no noise at all and just floated beyond the tree line.",
    "distance": 538.5783011451919
  },
  {
    "date_time": "11/8/2012 12:03",
    "shape": "Disk",
    "duration": "1 minute",
    "city": "Winston-Salem",
    "state": " NC",
    "latitude": 36.12465464,
    "longitude": -80.26509521,
    "comments": "2 discs  Was driving up number 8 back towards Germanton and could see two discs in the sky.    As I was trying to keep my eye on one, I spotted the second, as I moved my eye back to the first it was gone.    Then went back to the second and it was gone.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 538.9376539389885
  },
  {
    "date_time": "11/9/2012 22:00",
    "shape": "Sphere",
    "duration": "10 minutes",
    "city": "Greensboro",
    "state": " NC",
    "latitude": 36.06697038,
    "longitude": -79.84384656,
    "comments": "What was in the skies over Greensboro Friday night, 11/09/12?  Clusters of 3-4 red to orange in color.  They seemed to flying in a pattern south to north.",
    "distance": 539.0622397211852
  },
  {
    "date_time": "10/31/2012 22:00",
    "shape": "Egg",
    "duration": "15 seconds",
    "city": "Greensboro",
    "state": " NC",
    "latitude": 36.06697038,
    "longitude": -79.84384656,
    "comments": "blue egg shaped light shot across my apartment in greensboro then disappear.  It was a blue egg shape object, about the size of a helicopter hovering about 500 feet above me.    And as soon as I saw it, it shot across the sky leaving a blue trail streak.   It probably went about the length of a football field in about 2 second then disappear.  I have never seen anything like it in my life.   I did not hear any sound coming from it either, even as it shot across the sky.   ((NUFORC Note:  We have corrected the date above.  PD))",
    "distance": 539.0622397211852
  },
  {
    "date_time": "11/9/2012 6:20",
    "shape": "Oval",
    "duration": "8-10 minutes",
    "city": "Grifton",
    "state": " NC",
    "latitude": 35.3775026,
    "longitude": -77.43324224,
    "comments": "Bright light staying still for about 5-6 minutes then moves across the sky, no blinking lights and slowly fades away.  Me and my mother were walking to the local store just as it was becoming dark.  When we were walking back she spotted a suspicious light that was very bright in the sky.  It wasn't moving at first but my mother was very suspicious of the way it looked.    As we got closer to home the object started to move without sound or blinking light, and as it was moving it started to fade away until it was no longer visible.    We were shocked and both agreed it was very strange and tried to come to reason with what it could be.    My theory is it may be some type of spy device that surveys an area and disguises itself as a star so it doesn't seem suspicious then when it moves it fades away so no one can see when it moves to another area to survey.",
    "distance": 539.5489631617617
  },
  {
    "date_time": "11/12/2012 20:00",
    "shape": "Circle",
    "duration": null,
    "city": "Folsom",
    "state": " LA",
    "latitude": 30.63172331,
    "longitude": -90.19503146,
    "comments": "Gold/yellowish light stops by what might be ufo then I see a circular object fly by with green and red lights  Around 8 pm we walked outside to see something far off in the distance.  When I grabbed the binoculars I seen something that was blinking green...red...orange...then repeats.  I don't know what that was but then 5 mins later a gold, yellowish ball shot out randomly from the sky and went next to what we thought was a UFO blinking green red and orange...it sat next to it for about 5 seconds then started coming over towards my house.   When it came over my house I looked through the binoculars...I saw a circular object!   A green light on the front, a red light on the back and one green light on both sides of the object...then we ran to the front to see and it was too far away.  I got a picture but its too small.  My dad and sister thought it was a plane...but before that happened two planes flew over us and I know what a plane looks like.  This was a ball of a bold gold/yellowish light and it was pretty big...  And a plane doesn't stop in the air...it happen to stop rig! ht by what we thought was already a UFO...then when it took off the gold/yellow light was turned off and green and red lights were seen then.  And I don't know if those planes I saw were after the object because they were going the opposite direction but the planes came around 2 minutes before the ball of light",
    "distance": 540.4021472174601
  },
  {
    "date_time": "11/17/2012 17:00",
    "shape": "Unknown",
    "duration": "10 seconds",
    "city": "Knoxville",
    "state": " TN",
    "latitude": 35.9716528,
    "longitude": -83.95906226,
    "comments": "Brilliant bright light seen above high altitude airplane with no plume then disappears over Knoxville, TN.  Traveling 275 to I-40 West, approximately 5pm, right before taking the Alcoa Exit, noticed a high altitude aircraft toward the West with a white plume behind it.  In perspective, approximately 1-2 inches above this aircraft was a brilliant white light, shape unknown, with no trailing plume, which the light became even brighter than before, then completely disappeared. I believe this was too close to be another airplane.  Also, if it was an airplane, it would not have disappeared. It did not have a trail of any kind.  I was the front passenger in the car, and was telling the driver, my sister, to look at the object, and why it did not have a plume, when it completely disappeared.  She was driving and did not see it.  We were traveling to UT Medical Center with 2 grandchildren to see my new grandchild.  I have never seen a UFO before. I am 55 years old, have been a Registered Nurse for over 30 years, and have lived in Anderson County most all of my life.",
    "distance": 541.0853632828289
  },
  {
    "date_time": "11/14/2012 22:20",
    "shape": "Circle",
    "duration": "45 seconds",
    "city": "Knoxville",
    "state": " TN",
    "latitude": 35.9716528,
    "longitude": -83.95906226,
    "comments": "I observed what  I thought was a low flying plane, but as I approached I realized it was stationary and hovering.  On the evening of November 14th I was driving home from in the western suburbs of Knoxville, Tennessee on Westland Drive.  I was headed east when I noticed what appeared to be a very low flying airplane in the distance.  There is McGhee Tyson airport about 8 miles to the southwest, so I didn't, at that moment, think it was out of the ordinary, except for the altitude it was at.  For the next 45 seconds I had a clear view of this craft. I kept waiting for it to pull away and gain altitude, but as I got closer, I realized that I was gaining on it.  I slowed down as I got closer and realized that it was hovering about what appeared to be 400 feet above the road.  It had two white lights on either side of what I first thought were the wings, with a red light blinking in the center.  As I got closer and closer, now only going maybe 20 miles an hour I had a totally clear view of this craft.  As I drove under it, only then was I able to see that it had an oval or rounded shape to the underside of it.  I really wanted to pull over, get out and observe this craft, but I was just a little freaked by the whole experience.  As I drove away I kept looking in my rear view mirror, but never saw the lights or craft again.  I would really like to think that it was a plane or helicopter, as it was hovering, but I know of no plane that can do that and I've seen too many 'copters and it made no noise that I could hear.  The exact location was on Westland Drive right across from A.L. Lotts Elementary school.",
    "distance": 541.0853632828289
  },
  {
    "date_time": "11/3/2012 3:35",
    "shape": "Circle",
    "duration": "10 seconds",
    "city": "Knoxville",
    "state": " TN",
    "latitude": 35.9716528,
    "longitude": -83.95906226,
    "comments": "Circular object floating in place for a few seconds then darting off into the distance  I was driving home at 3:35 am and saw an object that looked like a shooting star but hovered over the horizon for a few seconds then darted off into the distance   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 541.0853632828289
  },
  {
    "date_time": "11/3/2012 21:00",
    "shape": "Triangle",
    "duration": "3 seconds",
    "city": "Carrboro",
    "state": " NC",
    "latitude": 35.95013207,
    "longitude": -79.10064509,
    "comments": "Black Triangle jets silently over Carrboro NC  While peeing in the composter in my backyard on Saturday November 3, 2012, at approximately 9pm I saw what at first I thought was a falling star.  I was looking at the constellation Cassiopeia when a streak of light caught my attention.  The object came out of the North to the left of Cassiopeia.   As I craned my neck to follow it across the sky I realized it was a perfect black triangle with white lights on each point.   It continued its straight path out of sight beyond the tree line.  It was very fast, with no sound. 3 seconds total.",
    "distance": 541.0951193485212
  },
  {
    "date_time": "11/1/2012 16:30",
    "shape": "Unknown",
    "duration": "about 20-30 minutes",
    "city": "Franklin",
    "state": " NC",
    "latitude": 36.10471837,
    "longitude": -78.45134367,
    "comments": "Disk shaped cloud, strange looking cloud moved quickly across town  I saw a few people posting photos of a strange looking cloud on the internet....i immediately ran outside with my camera and saw a Disk Shaped Cloud....i took photos of it and it grew further away....i took one last photo of it and it quicky dissolved after i took the photos.  While it was at that distance away it looked as if there was a jet flying below it.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 562.4732003508345
  },
  {
    "date_time": "11/13/2012 21:20",
    "shape": "Triangle",
    "duration": "5 minutes",
    "city": "Kingsport",
    "state": " TN",
    "latitude": 36.52437987,
    "longitude": -82.52877813,
    "comments": "A silent triangle with three white lights on each point with a pulsing red light in the middle moved E to W then slowly toward SW.  After returning from watching a movie we (my fianc&eacute; and myself) came home. I saw a triangle silently moving across the tree line above my house.  Three white lights on each corner were continuously lit up with a pulsing red light directly in the middle of the 3 white lights. I have an iphone video of the event but only star light shows with our voices captured in the back ground.  The object moved east to west then turn slowly toward the south west until I lost sight of it.  A few minutes later what looked like a medical helicopter flew in what looked like the opposite direction of where this silent triangle craft was moving.  The helicopter was visible and very loud unlike the triangle which was silent.",
    "distance": 563.8253691484563
  },
  {
    "date_time": "11/13/2012 22:00",
    "shape": "Circle",
    "duration": "hour",
    "city": "Mussel Shoals",
    "state": " AL",
    "latitude": 34.75491955,
    "longitude": -87.64860661,
    "comments": "Round, flashing lights hovering in the same spot 2 nights in a row.  Located under Orion's Belt.  Seen 2 nights in a row.  Flashing red and white/blue light.  After 30 minutes I could see the object move a short distance and hover. Moving up and down and in circles.  Both nights there was what looked to be a shooting star directly underneath the object.  Both nights it showed up on the same spot and moved in the same direction.   ((NUFORC Note:  Possible sighting of Sirius.  PD))",
    "distance": 565.6903591238286
  },
  {
    "date_time": "11/9/2012 16:00",
    "shape": "Cylinder",
    "duration": "~2 minutes",
    "city": "Meadville",
    "state": " MS",
    "latitude": 31.47241638,
    "longitude": -90.89330175,
    "comments": "White cylinder shaped craft with no wings flies over Meadville MS on clear and cloudless day.  I walked put to my car to get something, noticed what a beautiful day it was as the sky was deep blue and there were no clouds.   I looked up and saw a white cylinder shaped craft with no visible wings coming from a bit Northwest and headed dead on Eastward.   My partner was sitting on the porch and I called for him to come see.  He saw it as well and agreed it was rather strange.  It had no contrail and passed over in a fast way that didn't look like a conventional airplane.",
    "distance": 596.5075147547855
  },
  {
    "date_time": "10/30/2012 17:45",
    "shape": "Circle",
    "duration": "3 minutes",
    "city": "Franklin",
    "state": " TN",
    "latitude": 35.90672112,
    "longitude": -86.85985067,
    "comments": "Driving home I saw a very bright slow moving object going from east to west - not a plane,  I thought it was like a shooting start but it was moving to slow, and was very bright for 5:45 PM.   Not sure what it was and can not find anything anywhere on it.  There was an aircraft looking to be on approach to BNA that was north of the object neither seamed to react to each other.",
    "distance": 603.2823350014258
  },
  {
    "date_time": "11/9/2012 22:00",
    "shape": "Flash",
    "duration": "30 minutes",
    "city": "Radford",
    "state": " VA",
    "latitude": 37.12411187,
    "longitude": -80.56060533,
    "comments": "Saw two flashing lights, blue-green light fell from sky. Moving slow,many helicopers following  behide   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 605.412210332783
  },
  {
    "date_time": "10/30/2012 17:00",
    "shape": "Unknown",
    "duration": "several minutes",
    "city": "Nashville",
    "state": " TN",
    "latitude": 36.21362309,
    "longitude": -86.78348894,
    "comments": "4 objects not visible to the naked eye, flying around odd vertical  &quot;rainbow.&quot;  Driving home at 5pm headed towards the city from Elm Hill and 40-W I saw a small vertical rainbow in the sky.  I pulled over to take a few pictures, since the vertical sliver of rainbow was something I had never seen.  When looking at the camera screen I noticed 4 objects flying around the&amp;quot; rainbow&amp;quot;.  I looked without using the camera and could not see the objects with the naked eye.  I once again looked at the screen and the objects were still moving around the &quot;rainbow.&quot;  I did this several times with the same result.  I cleaned my lens, as well as checked my camera by taking photos of other things in the area.  This was not a dirty lens.  The objects could be disc shaped but it is hard to tell.  I have a series of photos.",
    "distance": 619.1261242609819
  },
  {
    "date_time": "10/30/2012 6:15",
    "shape": "Fireball",
    "duration": "5 minutes",
    "city": "Nashville",
    "state": " TN",
    "latitude": 36.21362309,
    "longitude": -86.78348894,
    "comments": "Huge bright object the size of a house slowly traveling across sky.  I was traveling towards Hermitage from Donelson and saw a huge ball of bright light the size of a house traveling at a slow steady pace.    I cannot figure out what this could have been could not have been a meteor it was traveling too slow.    I considered myself a skeptic about UFOs until now.  Very scary object.",
    "distance": 619.1261242609819
  },
  {
    "date_time": "10/30/2012 6:10",
    "shape": "Circle",
    "duration": "5 seconds",
    "city": "Nashville",
    "state": " TN",
    "latitude": 36.21362309,
    "longitude": -86.78348894,
    "comments": "WE SAW A GREEN BALL SHAPE FALLING OUT OF THE SKY AT 6:10 AM ON TUESDAY OCTOBER 30TH 2012.  IT WAS VERY LARGE BUT WAS GONE IN 5 OR 10 SECONDS.  I WAS ON MY WAY TO WORK ON I-40 TO NASHVILLE, TN, COMING FROM HERMITAGE TN..",
    "distance": 619.1261242609819
  },
  {
    "date_time": "10/27/2012 22:00",
    "shape": "Other",
    "duration": "60 seconds",
    "city": "Nashville",
    "state": " TN",
    "latitude": 36.21362309,
    "longitude": -86.78348894,
    "comments": "White light on small lunar lander shaped object  UFO Sighting I was driving north on second ave. Downtown Nashville TN. While stopped at a traffic light on the corner of 2nd ave.  And Korean veterans pkwy.  I saw a white light coming towards me traveling in a southwestern direction.  At first i thought it was an airplane but then i noticed it was lower than it seemed.  There was a tall building in front of me and i thought since it was of normal airplane altitude, it would go behind the building, but it went in front of the building. S o then i knew it was quite a bit lower than it seemed.  Maybe 100 feet off the ground.  I was able to get a pretty good look at it considering it was quite low.  It looked like a very small lunar lander, maybe 3 to 4 feet across.  It seemed to have very stable flight, very smooth.  Ruling out a flying toy or something like that.  It was traveling at about 30 to 40 MPH.  The street light turned green and i started moving while continuing to watch it as it moved passed me still traveling in a southwestern direction.   I then stopped at the next light and looked for it again and found it on the same path but climbing higher.",
    "distance": 619.1261242609819
  },
  {
    "date_time": "11/18/2012 19:20",
    "shape": "Fireball",
    "duration": "2 minutes",
    "city": "Russell Springs",
    "state": " KY",
    "latitude": 37.04976149,
    "longitude": -85.07448448,
    "comments": "Orange fireball passes directly overhead in southern KY  At approximately 7:15pm on 11/18/12 we observed in the sky a ball of fire moving from the north to the south.  I came almost directly overhead maybe 800 to 1000 feet off the ground.    I first thought it was an airplane on fire as it was moving toward local airport.  As it came overhead you could see that there was no structure on fire but just this huge ball of fire moving silently through the sky.    As it went on to the south it appeared to veer to the right moving westward and continued until it went out of sight over the horizon.    This thing cast an immense glow and you could see the flames jumping and flickering.  You would expect to hear something as you would with any other craft passing overhead but it was silent.    My ex-wife who is an RN witnessed this also.  She spotted it first.  I am a college graduate and am mostly skeptical of any UFO reports.    This was truly unexplainable.",
    "distance": 630.9064902010823
  },
  {
    "date_time": "11/18/2012 17:45",
    "shape": "Disk",
    "duration": "2 minutes",
    "city": "Russell springs",
    "state": " KY",
    "latitude": 37.04976149,
    "longitude": -85.07448448,
    "comments": "Red flame saucer over Kentucky  It was red.A disc or saucer shape.  Spinning,was visible for around two minutes.  Picture was taken.  Only one.  Observer is completely sane.",
    "distance": 630.9064902010823
  },
  {
    "date_time": "11/12/2012 18:30",
    "shape": "Circle",
    "duration": "1 hour+",
    "city": "Lynchburg",
    "state": " VA",
    "latitude": 37.40942681,
    "longitude": -79.19386946,
    "comments": "Lynchburg orb seen on Simons run and memorial by witnesses  Faint yellow orb solid in color slowly moving west. It slowly zigzagged in large patterns across the sky.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 637.3535824689966
  },
  {
    "date_time": "11/14/2012 15:53",
    "shape": "Formation",
    "duration": "50 seconds",
    "city": "Chesapeake",
    "state": " VA",
    "latitude": 36.64905624,
    "longitude": -76.30084603,
    "comments": "7 to 8  orange balls in a line, 4  additional balls  from top left coming down T an angle.no sound and I followed it across th sky as far as I could see.",
    "distance": 647.0489209193825
  },
  {
    "date_time": "11/14/2012 3:53",
    "shape": "Formation",
    "duration": "50 seconds",
    "city": "Chesapeake",
    "state": " VA",
    "latitude": 36.64905624,
    "longitude": -76.30084603,
    "comments": "A formation of several orange circular lights gliding through the sky.  There was a formation of about 6 orange circular lights gliding through the sky.  They were similar to that of a formation of geese, however it was not a perfect 'V' shape...it shaped like an arrow with only 1 arm.  The lights traveled silently together soaring through the sky.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 647.0489209193825
  },
  {
    "date_time": "10/31/2012 2:15",
    "shape": "Oval",
    "duration": "45",
    "city": "Campbellsville",
    "state": " KY",
    "latitude": 37.35427177,
    "longitude": -85.34176426,
    "comments": "are we alone??  i have always been a skeptic about any kind of &quot;ufo&quot; discussions i thought only weak minded people believed in this stuff till 2:15am this morning i was up and my friend wanted to go out side to smoke so i went with her and as we was standin there i noticed up in the sky what i thought was a aircraft like a plane but it was way too high in the sky and i commented on that right off well my friend started lookin at the object with me and we both noticed the object started movein in a zig zag type movement then it would just stop well to the objects left was another object movein towards it we saw some kind of light more like a missle or something i quick little flash well the new object just disappeared..  the moon as we was lookin up was to our right well the object started movein right like towards the moon it went from goin dead ahead straight to zig zag then a complete stop to movein right when it got to the moon it was gone..now this shocked me so much that i felt like i needed to tel someone,,anyone about this i couldnt call the cops they would thought i was on drugs..now idk this could have been military some kind of new plane or something idk but i know what i saw i woudnt go out of my way to report this on here i hope someone understands what im sayin..i am not makein this up this has really freaked me and my friend out..what was this &quot;thing&quot;??   i think ill never know ..   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  Witness does not indicate a duration for the sighting, and we have no way to contact him/her.  PD))",
    "distance": 655.7256123148
  },
  {
    "date_time": "10/31/2012 23:00",
    "shape": "Triangle",
    "duration": "10 minutes",
    "city": "Piperton/Rossville",
    "state": " TN",
    "latitude": 35.03140687,
    "longitude": -89.63024231,
    "comments": "6 UFO's spotted in 5 mile radius  Driving down hwy 57 I encountered an object in the sky with red, blue, and clear lights.  Setting completely still and no sound.  Kept driving and saw 2 more, one above gas station and another over a bank on other side of street.  Only several  feet from eachother.  Went about 5 miles down the road and saw 2 more flying very close to each other.  All 6 were not moving setting still and close enough to the ground that I could see their shape.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 658.1299180940905
  },
  {
    "date_time": "11/13/2012 23:00",
    "shape": "Diamond",
    "duration": "ufo sighting",
    "city": "Clarksdale",
    "state": " MS",
    "latitude": 34.20039138,
    "longitude": -90.57484809,
    "comments": "UFO sighting clarksdale ma  My friends and I were riding Down highway 1 towards Helena Arkansas.  We then turned around heading back towards clarksdale ms when we see this bright object in the sky.  We stopped dead center in the road and cut our lights off to see if it was moving and it was.  It then shined a bright light on us and pretty much made a 180 and started moving the opposite direction.  We then head back towards home after and we see blinking white lights in the sky, and they then stopped blinking and it's just a bright star looking objects moving in a pattern in the same direction we saw many many more that did the exact same thing.  I don't knowing anyone else has seen it but it was truly amazing.",
    "distance": 664.8004098850065
  },
  {
    "date_time": "11/17/2012 23:30",
    "shape": "Light",
    "duration": "30+ minutes",
    "city": "Ansted",
    "state": " WV",
    "latitude": 38.13827297,
    "longitude": -81.09909142,
    "comments": "multicolored flashing light on cloudy night.  I walked outside to lock my car and looked up and saw the light in the sky, I didn't think anything of it until I realized it was very cloudy.  I sat outside in my car for a little while just watching it for about 15 minutes.  My husband came outside wondering what I was doing and he was amazed he had never seen anything like that either.  A few minutes later I got a phone call from my niece who lives about ten minutes away asking me if I saw a strange light outside towards the south over the mountain, she was doing some homework for her astronomy class in college.  We were seeing the same thing, she got off the phone to call her professor to see if he was seeing the same thing and I did not hear back from her.  But she said it was roughly 30 degrees to the southwest of Jupiter and roughly 50 degrees south south west away from Sirus whatever that means.  I took a video of the strange light in the sky.  It was changing colors, pale blue, white, orange, green a! nd red and it was flashing in and out.  There was no sound.",
    "distance": 673.1771183814036
  },
  {
    "date_time": "11/8/2012 22:45",
    "shape": "Light",
    "duration": "10-15 seconds",
    "city": "Ansted",
    "state": " WV",
    "latitude": 38.13827297,
    "longitude": -81.09909142,
    "comments": "Bright blue light near Jupiter, appeared and disappeared in a matter of seconds.  I was outside walking my dogs and looked up at the south eastern sky around Jupiter, there was a bright blue light (the same color blue as the lights from a police car).  It was about 5 inches to the right of Jupiter.  It was dim and got really bright and then just blinked out in just a matter of a few seconds. It is a cloudless night and the moon is not visible.  I was the only person that I know that observed it because I was walking my dogs, my dogs acted as if they were scared because they all came in within a minute of the sighting which is unusual for them.  I call myself a hobbiest astronomer, I do know where some things in the are in the sky.  I normally have my cell phone with me but tonight I forgot it in the house before I walked my dogs.",
    "distance": 673.1771183814036
  },
  {
    "date_time": "11/3/2012 0:00",
    "shape": "Oval",
    "duration": null,
    "city": "Tunica",
    "state": " MS",
    "latitude": 34.69930301,
    "longitude": -90.37826414,
    "comments": "they have been here far back as b4 airplanes were invented . people who dont believe will soon  i was with a friend at fitzgeralds casino and a ufo came out of the sky and caused a blue 4 door car to reck . we were behind the car on fitzgeralds main road almost to the enterance and the person in the car in front of us was almost hit by it they ran off the road and recked i dont thimk they survived. the lights to fitzgeralds casino were knocked out when the ufo appeared and thye reck happend it was 2 am on a saturday and the ufo hovered over the tree tops from 2 am to 4 am when the lights came back on it left right before it left a shooting star shot out the sky to it and it had 3 red lights on one side one bright light it shined at us on other side and a white light in the center of the craft . alot of people reported it at the casino thry were military helicopters everywhere and about 20 in all surrounding it.the ufo killed the tree to a burnt black looking color i went over the next day and it had white stuff on the ground and the tree was dead   ((NUFORC Note:  We are uncertain as to whether this is a serious, or well-documented, report.  If anyone knows anything about this alleged incident, we would welcome other reports.  PD))",
    "distance": 676.0744728579069
  },
  {
    "date_time": "11/11/2012 21:00",
    "shape": "Triangle",
    "duration": "30 seconds",
    "city": "Fredericksburg",
    "state": " VA",
    "latitude": 38.30177819,
    "longitude": -77.48626502,
    "comments": "Orange/red blurred lights in the shape of a triangle moving across the sky then disappeared.  We were walking our dog and I noticed three blurred orange/red lights in a triangle shape moving across the sky at a moderate pace and then it slowly disappeared.  There was no sound and it lasted about 30 seconds.  This is not the first time I've seen something like this.",
    "distance": 723.2926264470015
  },
  {
    "date_time": "11/14/2012 22:00",
    "shape": "Triangle",
    "duration": "5-7 minutes",
    "city": "England",
    "state": " AR",
    "latitude": 34.54142181,
    "longitude": -91.97302566,
    "comments": "Large black, triangular shaped aircraft with many bright white lights hovering over rural area along Hwy 161.  I opened the back door to smoke a cigarette before going to bed and noticed a large bright set of white lights with red and green lights hovering beyond a tree break about a half mile from the house. This sparked my attention because I saw the same bright lights around the same day of the week and time of night last week.  I watched it hover for a long time and thought it could have been a helicopter because of how it was hovering and how low it was.  I stepped outside to see if I could hear it because if it was a helicopter, you would have definitely been able to hear it because it was so close.  I can make the helicopter sound comparison because of an aerial search conducted recently for an escaped convict from a local prison in which helicopters were used to search in our area.  The aircraft didn&#8217;t sound anything like the helicopter I heard several weeks ago and as a matter of fact, didn&#8217;t have a sound at all until it was flying overhead.  After several minutes, the aircraft began slowly moving closer and eventually flew directly over our house and was so low I could see it was a triangle shaped aircraft with lots of bright white lights and a green and red light.  If the aircraft had been a plane, you would have definitely been able to hear it as it was so low and so close but I couldn&#8217;t hear anything but what sounded like a plane that was flying at a high altitude, miles and miles above.  Once it flew over, I didn&#8217;t see anything else but will be looking from now on for sure.  I am a middle class working mother of one who works in a physician&#8217;s office and is educated.  I don&#8217;t use drugs and was not under the influence of medication or alcohol at the time of the sighting.  I have seen this object twice now and can&#8217;t deny what I saw was not like any aircraft I have ever seen even at all the airshows I went to as a child.",
    "distance": 744.4222649820824
  }
]