[
  {
    "date_time": "11/1/2012 19:15",
    "shape": "Circle",
    "duration": "25 seconds",
    "city": "Oklahoma City",
    "state": " OK",
    "latitude": 35.41019003,
    "longitude": -97.49532595,
    "comments": "Ball of lights  Around 715 pm November 1st  I was lying in bed when I noticed something bright like a star or a meteor falling or descending straight down from the sky it was moving very slow to be a meteor or airplane I then past a blue smaller looking star as it keep moving down the blue ball of light started to move straight up this was over by Wiley airport in Oklahoma city I watched it for 15 to 20 seconds before I lost it in the tree line the blue ball of light I can still barley see in the sky it looks like it&#8217;s moving away and disappearing if anyone else has seen this please let us",
    "distance": 19.359212943066886
  },
  {
    "date_time": "11/8/2012 23:57",
    "shape": "Unknown",
    "duration": "45-60 seconds",
    "city": "Agra",
    "state": " OK",
    "latitude": 35.89528973,
    "longitude": -96.87001479,
    "comments": "Falling fire ball or stream  I was driving home about 2-3 miles south of 33 highway on 18 highway south. I observed a light on the passenger side and looked over assuming break lights.  The entire window was bright red and orange. In a few seconds or more I had come to a stop and watched it dwendel down to a fine stream at about a 15* angle.  It flashed with some heat and slowly faded away.   I waited in the middle of the road for a few minutes looking for a smoke trail in the clear night sky.  Or an impact flash or smoke.   Nothing. I then called my wife to apologize for not believing her white orb with a colorful trail of triangles that was aimed for the field next to our property back in October.   I checked that our the next day and found nothing. I will check out the area around where I saw this in the morning or afternoon job permitting.",
    "distance": 30.8051686127736
  },
  {
    "date_time": "11/16/2012 3:00",
    "shape": "Teardrop",
    "duration": "3 minutes",
    "city": "Pond Creek",
    "state": " OK",
    "latitude": 36.66701683,
    "longitude": -97.80228654,
    "comments": "Slow moving teardrop shaped craft  Craft moving east to west across red hill road , aprox speed about what a slow moving small airplane would look like from ground, alt seemed like about 3000-5000 feet, looked just like a comet bright light and lit up flowing back teardrop shape craft.  Could tell it was not a small craft.  No sound observed. White- reddish color. Not a meteor.",
    "distance": 74.40263384247079
  },
  {
    "date_time": "11/6/2012 16:15",
    "shape": "Unknown",
    "duration": "~10 seconds",
    "city": "Miami",
    "state": " OK",
    "latitude": 36.88712875,
    "longitude": -94.87322942,
    "comments": "Shiny, reflective object  On Tuesday, November 6, returning home from picking up my grandson at school, I had to stop for a train.  As I was sitting there something in the sky caught my eye.  I assumed at first that it was a plane but was way too shiny and reflective and hovering.  There were some light clouds but the object was far below them.  I tried to determine a shape which I never figured out but it was too compact to be an airplane.  What intrigued me was how shiny it was.  As I was watching it, it just disappeared, no movement what so ever, just gone.",
    "distance": 161.30893080770258
  },
  {
    "date_time": "11/1/2012 19:07",
    "shape": "Light",
    "duration": "60-70 seconds",
    "city": "Parsons",
    "state": " KS",
    "latitude": 37.380811200000004,
    "longitude": -95.25429109,
    "comments": "Small ball of white light moving incredibly fast to the South East of Parsons, KS.  I, age 16, and my father, age 62, were exiting our house in the center of town to leave for dinner.  We had just gotten into the truck, and while rolling up my window I glanced at a bright star or planet to the South-South East giving off shine that I often look up to glance at.   I noticed a bright star I assumed I hadn't noticed before just off to the side of this other star, but when I glanced out the passenger side window I noticed it was moving at an incredible speed, I estimate 200mph, in a South Eastern direction.    My father, being a veteran birder, picked up his binoculars and glanced, then passed them to me.  What I observed was a small ball of light, pure and shimmering white moving INCREDIBLY fast.  It cleared all the way to the horizon in at least a minute flat.  I've seen satellites move before but not at such an accelerated rate.",
    "distance": 165.88756895771073
  },
  {
    "date_time": "11/3/2012 15:00",
    "shape": "Disk",
    "duration": "2 hours",
    "city": "Denton",
    "state": " TX",
    "latitude": 33.19338819,
    "longitude": -97.11712393,
    "comments": "They are bright silver and disk shape. They are too fast. It seems that they play around there. Its vertical and horizontal movement is  I saw UFOs in the sky, which are much higher than a airline in terms of altitude.  The shape of UFO is the combination of two hemispheres up and down with a dish between them.  The radius of dish is twice of that of hemisphere.  I guess that it is the typical UFO shape. Its color is bright silver. It seems that they play around there. They flight up and down so easily and in curved path. In addition to that, the smooth and sharp curves are observed in the path of the UFO.  They disappear and appear in the sky.  The speed of UFO is amazing.  Since I saw the flight in the sky, I can compare between the UFO and the airline.  I can tell that the UFO can flight at least several times faster than the airline.  I think there are at least more than 10 UFOs.  The maximum number of UFO in my camera at the same time was 7.  Since there was no cloud in the sky and they were in the high altitude, it was not easy for people to observe it.  I don't think other people observed them.  I asked one of my friends to see that.  He was taking a nap at the moment.  He missed it.  When I moved to the other place to get a tripod, but I could not observe them for the brightness from the sun.  My apartment has a door to the east.  Because of appropriate shield, I could find them.  They were above me and a little bit in the east.",
    "distance": 170.7761732272094
  },
  {
    "date_time": "11/3/2012 19:00",
    "shape": "Rectangle",
    "duration": "25 seconds",
    "city": "Neosho",
    "state": " MO",
    "latitude": 36.85784117,
    "longitude": -94.37047222,
    "comments": "Red cigar rectangular light in Neosho, mo.  Standing at our private  ball field I noticed a red rectangular cigar shaped light hovering at aircraft height but not moving.  I was looking for deer that sometimes graze the grass in the ball field when it cought my eye.  I didn't think anything of it until it dawned on me it wasn't moving nor did it have any blinking lights on it.  It was average red brightness but what happened next is why I am somewhat perplexed.  It never moved nor did it change shapes or colors for around 15-25 seconds and then all of the sudden it split into 4 or 5 little balls and the little balls shot off instantly and disappeared.   I'm 47 and am certain it wasn't an airplane nor some type of fireworks or floating candle like a Chinese lantern.  It was the strangest thing I have ever seen.my wife says it wasn't an airplane either and she was laughing at me when I first told her to look up and see it saying &amp;quot; that's just an airplane&amp;quot;. It was silent and there was a light northerl! y wind but it was unseasonably warm for that time of year.",
    "distance": 184.81626919874952
  },
  {
    "date_time": "11/13/2012 6:30",
    "shape": "Cigar",
    "duration": "5 minutes",
    "city": "Benbrook",
    "state": " TX",
    "latitude": 32.67050039,
    "longitude": -97.46873392,
    "comments": "Flying cigar shaped object with six lights over Benbrook by the lake;  We we traveling home from Benbrook to Granbury on 377.  There was a large object with six lights that were in a straight line and a light blue square in between the 3rd and fourth light.  It was going thru the sky very slow and it was traveling to low to be a large aircraft.  I was driving and my daughter saw it also.  She said it was not an airplane.  It did not make any noise.  I say cigar shape because of how the lights were in a straight line.  Could it have been a blimp?   Why would there be a blimp flying over Benbrook close to the entrance of LAKE?   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 206.59292850929612
  },
  {
    "date_time": "10/27/2012 23:15",
    "shape": "Triangle",
    "duration": "2 minutes",
    "city": "Arlington",
    "state": " TX",
    "latitude": 32.65849547,
    "longitude": -97.13476999999999,
    "comments": "Low rumble revealed sparkling lights, resolved into dark Triangular craft with lighting at two leading edges.  As I sat in my studio, I was beginning to get ready for bed.  I emptied my pockets onto my desk and thought that I should go out side before my shower.  As this was the second time in a few minutes that I had thought about going outside, I stopped what I was doing, lit a smoke,  and walked to the back door, opened it, and walked onto the patio.  I noticed that there was a distant rumbling sound that seemed loud, loud  enough that I wondered why I had not heard it inside my house.  The sound was much like the sound of a jet engine, without the usual high pitched whine.  Just the low frequency component of the sound like an Atlas rocket at a distance, or maybe a Harrier jet.  I am a professional audio engineer, and have very good hearing. I'll also point out that I grew up in the Land Surveying business, working many years in that field before my mid 20's.  Since the security lighting had activated when I went onto the patio, I reached my hand back inside the door and turned off the light to get a better look at the sky.  Still hearing the rumble, I looked up to see what it could be.  Above me about 60 degrees above the horizon, and due west, I saw an odd haze that would sparkle light, mostly white, with red and blue green. My first thought was that it was too low to be an airplane, and that it did not appear to be moving fast enough for flight.  The sound was incorrect for it to be a helicopter.  The lights seemed to twist and turn, with no discernible shape.  As the sky was otherwise clear, this confused me.  I noticed that there was an occasional brighter flash in red and then blue green.  The object continued to morph, and as I watched, it solidified into a shape.  It became an equilateral triangle with one end pointed directly south.  The object seemed dangerously close to the ground and just hanging there.  With my right hand outstretched to 30 inches, the object was about 9 -12 inches on each side, and about &#189; to &#190; inches thick.  The lights appeared along the perimeter of the two leading edges, with the brightest areas at the middle of each of those two edges.  I noticed that the southern most tip of the triangle had a soft white glow, and that the remainder of the bottom was a dull dark matt finish. The light area did not appear to be illuminated, only contrasted to the rest of the surface.   Much to my surprise, the bottom was not flat.  There appeared to be two large rectangular areas, one on each side of the center line, and while one was along the axis of (very slow) travel, the other was at 90 degrees to it.  The rectangular boxes had rounded edges.  I remember thinking, that this was not a good aerodynamic shape. Another incongruity.  Once the position of the object stabilized, the lighted edges were barely visible from my perspective, but the occasional brightening of the nearest mid-side light was red.  I thought, maybe they were FAA lights, so I waited for the next flash.  The flashing did not have consistent timing.  The next time it was green, and still hazy in a digital sort of way.  Checking the far side lights, I realized that they were also inconsistently colored also..  It was more like the lights were displayed as camouflage, something that would appear correct to the casual observer.  Wanting to take a photo, I realized that I did not have a camera on me, and that in order to get a photo I would have to get back into the studio, grab my phone off the desk and turn it on.  By this time, the object was already 45 degrees south of my position and I realized that I did not have time to get to the camera, and I decided to just continue watching.  The object continued south and within a few seconds had moved to the horizon, the sparkle growing ever smaller and less distinct.  I have some surveillance cameras located around my house, and I later checked to footage.  I left the studio at 11:15 pm CDT to go outside, and the event lasted barely 2 minutes.  I saved the recordings from the system and looked at it later, hoping that some more information could come from it.  The studio camera has an audio channel, but the camera over the patio does not.  I could not detect any low frequency information from the sound track, as the noise floor on such systems is rather high.",
    "distance": 207.59931287911166
  },
  {
    "date_time": "10/30/2012 23:30",
    "shape": "Triangle",
    "duration": "3 minutes",
    "city": "Midlothian",
    "state": " TX",
    "latitude": 32.48635941,
    "longitude": -97.00753042,
    "comments": "Two identical triangular shaped objects flying high, orange color orbs underneath.  At approximately 23:30 on Tuesday the 30th of October, 2012, I spotted two triangular flying objects high in the sky flying rather close to each other.  They had three lighted orbs on the bottom that was visible and was an orange like color.    They flew at a constant speed and they didn't have any blinking lights like mostly any other commercial aircraft.  I observed it for a duration of three minutes until they were no longer in my sight.    This was my first sighting of a UFO!",
    "distance": 219.9780489591291
  },
  {
    "date_time": "11/16/2012 4:00",
    "shape": "Fireball",
    "duration": "12 seconds",
    "city": "Pleasanton",
    "state": " KS",
    "latitude": 38.19134286,
    "longitude": -94.69057937,
    "comments": "On 11/16/2012, I was with a friend getting ready for a morning duck hunt in Pleasanton, KS.  At around 4AM, we witnessed an orange, elongated (it was longer than it was wide) object/light moving at an incredible rate of speed.  It was mostly fire orange in color but at the front/tip, it seemed a lighter orange or possibly whitish orange.  It seemed like a fast moving plane on fire when I first viewed it; but at closer glance realized it was not anything like that.  The object was to our West moving North to South at a constant speed and altitude.  There was no noise at all.   We had been seeing shooting stars all night and this object was nowhere near that kind of speed (buzzing across the entire skyline in 2 seconds).  However, it was moving fast enough that we were only able to view it for about 12 seconds before it was far enough away we could no longer see it.",
    "distance": 227.96513780270718
  },
  {
    "date_time": "11/8/2012 21:40",
    "shape": "Light",
    "duration": "2 minutes",
    "city": "Texarkana",
    "state": " TX",
    "latitude": 33.44881563,
    "longitude": -94.07333258,
    "comments": "Dim blue/grey orb, at low altitude.  At approximately 9:40 p.m. 11/8/2012 I was home alone watching t.v., my dogs began to bark, and I felt the house rumbling.  As if someone was listening to a loud stereo in front of the house. Instead of a rhythmic thumping, it was more of a constant stub-audible rumble.  I walked out front to see what the dogs were barking at and saw nothing in the street, but when I stepped out from under the eaves, I felt heat on my back.  I looked up and at tree top level above the house was a blue/gray glowing sphere.  As soon as I looked up, it took off due east, like it had been shot from a gun.  It got brighter as it picked up speed and about two miles it bounced north west, like a tennis ball hitting a brick wall.  After the bounce it was only visible for a flash and then disappeared.  Two noteworthy observations.  First, the sky was overcast with low clouds, and it was well under the cloud cover. Secondly, as it took off from over the house, I could feel a sub-harmonic vibration, in the driveway.  But it never made an audible sound.  There wasn't much to it, but it was a hair raising couple of minutes.",
    "distance": 240.33210823327457
  },
  {
    "date_time": "11/17/2012 18:45",
    "shape": "Light",
    "duration": "2 minutes",
    "city": "Springfield",
    "state": " MO",
    "latitude": 37.1904258,
    "longitude": -93.27894761,
    "comments": "Red light moves at excessive speed, stays absolutely still and changes direction abruptly  I was in my front yard when I saw what I thought was a skyrocket.  It was bright red, like police lights but not flashing.  I watched it going up waiting for it to explode.  It stopped dead still for about 5 seconds then took off at a very high rate of speed and stopped abruptly for a split second, then changed direction and flew slowly out of sight.",
    "distance": 249.11706504660518
  },
  {
    "date_time": "11/17/2012 18:35",
    "shape": "Flash",
    "duration": "4-5 minutes",
    "city": "Springfield",
    "state": " MO",
    "latitude": 37.1904258,
    "longitude": -93.27894761,
    "comments": "Red flashing lights in sky  Was driving westbound with my wife to pick up a pizza.   She pointed out a cluster of lights in the sky and asked my if I could see them and if they were stars.  I looked to where she was pointing and at a glance what I saw did appear to be stars of constellations.  As I continued to look at these lights I noticed that they appeared to be moving.  The lights were not maintaining the pattern they were in when I first looked at them.  They also seemed to be much closer in distance than what most stars look like.  I looked around in different directions and noticed that there were not any actual stars out yet.  These lights were the only lights in the sky.  We arrived at our destination and got out of the car for a better view.  The lights appeared to be moving in a north/northwest direction.  They looked as if they were flashing red and white.  At first, when we first saw the lights, there were about 20 to 30 lights.  When we were out of the car there were only about 10 to 15.  As we were watching the remaining lights, the lights were moving and would just disappear.  Two more individual lights appeared in my peripheral vision, coming out from the south over some trees.  These lights did not make it as far across my view point before vanishing.  All of the lights observed while outside of the car seemed to be as close in distance as a local airplane might be if flying through the sky.  Definitely within the Earth's atmosphere.  Thought these might be related to the meteor shower that was being reported to be taking place, but there were no streaks or tails and they were not moving very fast.  Tried to get a photo taken with camera phone.  Zoomed in to 4x zoom.  The image at that zoom level was a fuzzy red dot and that dot was about a quarter of an inch wide.  From first sighting to last light vanishing, t",
    "distance": 249.11706504660518
  },
  {
    "date_time": "11/10/2012 4:38",
    "shape": "Unknown",
    "duration": "3 minutes",
    "city": "Crosby",
    "state": " TX",
    "latitude": 33.65906693,
    "longitude": -101.2396433,
    "comments": "Pulsing light looks like a flashing stay but moved away from earth Into distance.  About 0430 I needed to use the restroom and notices it was very dark in the house.  I thought their must be no moon tonight.  I opened my curtain to take a look around and saw a flash about as bright as a medium star.  I thought it was an airplane.  I kept watching as as it continues to flash about once every 5 seconds or so, I decided to go downstairs and look from outside and noticed that this flash did not move.  I used to work in the navy and I know what aircraft look like at night and I knew it was not an aircraft.  I thought it might be something else but I have no idea what.  I tried to record on my iPhone but it does not show anything.  Perhaps it could be professionally edited to show this pulsing or flashing light.    After a minute of watching from outside it seemed to become more faint and moved away from me into space.  I can't recall how bright it was initially from my bedroom window, I guess because I had just woke up.  After the thing was gone a quick streak went across the sky like a shooting star.",
    "distance": 261.3515109444641
  },
  {
    "date_time": "11/12/2012 12:15",
    "shape": "Triangle",
    "duration": "2 seconds",
    "city": "Raymore",
    "state": " MO",
    "latitude": 38.80048887,
    "longitude": -94.46006654,
    "comments": "3 lights in triangle shape moving very fast from north to south.  Was outside stargazing and watching for shooting stars.  Saw 3 steady lights about the same brightness of average visible stars in a triangle shape and about the width of Orion's belt in the sky moving very fast from north to south.  I noticed it as it past near Betelgeuse and followed it without blinking as it head south and then out of sight.  It didn't appear to move toward the horizon, just simply away.  As it moved it passed in front of some stars.  It didn't block them out but they were not clearly visible either.  Instead the star light seemed disrupted as it passed over them, like looking through moving water.  The thought occurred to me afterward that it looked like the cloaked effect used in sci-fi movies.  It was dead quiet outside and there was no sound.  Waited to hear a delayed jet sound but there was nothing.  I'm not ruling out meteors but this was like nothing I have ever seen.  They never seemed to change in brightness, no trails, and they didn't ever seem to fizzle out.  I watched for a long time after but never saw it again.",
    "distance": 268.60010417320433
  },
  {
    "date_time": "11/12/2012 1:00",
    "shape": "Circle",
    "duration": "~10 seconds",
    "city": "Shawnee",
    "state": " KS",
    "latitude": 39.02182543,
    "longitude": -94.7981625,
    "comments": "3 circles flying close together, motionless, and without a sound!  It was 1am and I was letting the dogs out.  I was admiring the clear sky and the bright stars when I saw 3 circles moving together in a straight line.  I saw it less than 10 seconds... But enough to scare me.  It wasn't birds... No flapping or fluttering.  Not a plane or helicopter... Moved across the sky too quickly and didn't even make a sound.  The flight was direct... Didn't steer off path.  Was from northeast heading southwest.  I hope someone else described this thing!",
    "distance": 270.9742761549661
  },
  {
    "date_time": "11/11/2012 20:30",
    "shape": "Formation",
    "duration": "30 minutes",
    "city": "Shawnee",
    "state": " KS",
    "latitude": 39.02182543,
    "longitude": -94.7981625,
    "comments": "Lights in the sky in Shawnee, KS  At 8:30 pm on Sunday night my family was sitting outside and one person saw a strange formation in the sky.  She pointed it out to the rest of us and we watched it.  It appeared to be shaped like a boomarang.  It had dim lights on the front and was well below the stars.  We have been watching it for over a hour now.  It is going from North to South, then circling and going North to South again.  We now have 7 people watching it.  We spot it about every 5 to 10 minutes.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 270.9742761549661
  },
  {
    "date_time": "11/9/2012 1:00",
    "shape": "Flash",
    "duration": "2 seconds",
    "city": "Petersburg",
    "state": " TX",
    "latitude": 33.87155358,
    "longitude": -101.5983923,
    "comments": "Brite green flash in west texas sky lights up the night as if it was dawn for about 2 seconds.  At 1.00 AM on NOV.9th while driving North on hiway 789 from Petersburg,TX.  My friend and I seen a brite green flash in the dark night sky so brite it lit up the night as if it was dawn for only about 2 seconds and had a brite white short streek unlike any shooting star I have ever witnessed.  It was almost as if it came in and out of our atmospere verry rapidly FLASH and then it was gone.",
    "distance": 271.61684367788365
  },
  {
    "date_time": "11/6/2012 21:00",
    "shape": "Rectangle",
    "duration": "1-2 minutes",
    "city": "Damascus",
    "state": " AR",
    "latitude": 35.370609,
    "longitude": -92.4096716,
    "comments": "There have been silent ( what I thought where planes) flying very low but no noise, I looked night after night and one finally was at the right place right time and it was solid dark with one light in center and one on each edge.  They flash like lighting when low but stop when higher, starts at dark stops about 9.",
    "distance": 277.7271699322596
  },
  {
    "date_time": "10/29/2012 20:25",
    "shape": "Circle",
    "duration": "2-3 minutes",
    "city": "Lee's Summit",
    "state": " MO",
    "latitude": 38.93809369,
    "longitude": -94.38276678,
    "comments": "Large, bright light, moving slowly then zipping away.  October 29, 2012 Tonight (Oct.29) about 8:25 p.m., looking to the west, just above the trees, saw a dim star when a  bright, white light (LED brightness)  appeared on the north side of it.    It was going southeast, called my sons to look.    Saw my neighbor (a Marine) outside, asked if he knew what it could be, &quot;no.&quot;   It continued going southeast, slowly, then it just zipped out of sight.  Appeared to disappear upwards, not  lateral.",
    "distance": 278.70740404922503
  },
  {
    "date_time": "10/28/2012 21:15",
    "shape": "Changing",
    "duration": "1-2 minutes",
    "city": "Lee's Summit",
    "state": " MO",
    "latitude": 38.93809369,
    "longitude": -94.38276678,
    "comments": "Lee&#8217;s Summit, MO Last night (Oct.28) about 9:15 p.m.    I was looking at the moon (east) when a large bright, white (like LED light) appeared on the left (north) side of it.  I thought it might be Jupiter until it went from a round shape to an elongated shape and began moving to the east (over the moon).  Called my husband &amp; son to see it, they did.  It continued east very slowly for a few seconds and disappeared.",
    "distance": 278.70740404922503
  },
  {
    "date_time": "11/6/2012 19:50",
    "shape": "Chevron",
    "duration": "&gt;2 hours",
    "city": "Kansas City",
    "state": " MO",
    "latitude": 39.12367192,
    "longitude": -94.51720887,
    "comments": "Crescent shaped lights that emitted green light and then moved jerkily and then hovered in place  I walked onto my deck at 19:50 and a flash caught my eye in the western sky. I live only 6 miles from the Kansas City airport so I am accustomed to seeing planes takeoff and land. I looked at it for a time and realized that it was making jerky movements preceded by a green flash. It was a light at high altitude, crescent shaped.    I watched it for half an hour and it moved repeatedly, then I sighted two more in the southwest sky. I also witnessed what appeared to be planes with red and white flashing strobes, and I assumed that it was military observation of the phenomenon.    Then I sighted two more in the southern sky.  After 22:00 the lights from a nearby shopping center were dimmer and I was able to see more right overhead and in the eastern sky.  I became unable to count accurately due to the number of UFOs in the skies.  Until last night, November 6, 2012, election night, I have been a skeptic and now I am a believer. I phoned my sister in Syracuse, NY, who is professor emeritus SUNY, during this sighting, since she attends UFO conferences and is a staunch believer.    She questioned me and was sure that I was in fact witnessing an event.    They looked different from stars which appear as a bright light that twinkles sometimes and do not move in the manner of water bugs on surface tension on a body of water like these objects did.    I am not sure of the exact duration of the event, because the election coverage was on TV and I went inside to see who was elected. I ceased watching at 22:00 and went back out at 00:30 and they were no longer there. The constellations had changed position, but that was all I saw in the skies by that time.",
    "distance": 285.0453204837231
  },
  {
    "date_time": "11/11/2012 23:30",
    "shape": "Cigar",
    "duration": "20 seconds",
    "city": "Blue Springs",
    "state": " MO",
    "latitude": 39.02559598,
    "longitude": -94.2721015,
    "comments": "Black floating, silent object floating lower than 300 feet not terribly high above the trees, 11:30 pm, could see the outline, but no lights on it.  It was moving NNW and appeared to be in between RD Mize and HWY 7 in blue springs.  Saw it out my window, then ran around out on the porch to see if maybe it was just a blackhawk helicopter and it was silent, very large, and low for a jet, if it was it would be comparable to a Jumbo Jet in size.  Shape was vague but cigarish, possibly domed or thicker in the middle.",
    "distance": 287.10678576143914
  },
  {
    "date_time": "10/31/2012 19:50",
    "shape": "Triangle",
    "duration": "5 minutes",
    "city": "Little Rock",
    "state": " AR",
    "latitude": 34.80164813,
    "longitude": -92.29151927,
    "comments": "3 white blinking lights in triangle formation the size of multipe football fields.  Driving West on 630 threw Little Rock,  Ar, we observed 3 white lights flashing to the north. It was moving parallel with us. It looked to be hundreds of yards long, a few thousand feet up in the air.  We were traveling at 70 mph, and the lights stayed in formation as it moved to the west.  At the location where IS 630 ends at IS 430 the object was no longer to the north, but due west in front of us.  It made no noise, and seemed to be a triangle that covered a large area in the sky.",
    "distance": 290.7438192219936
  },
  {
    "date_time": "11/12/2012 4:58",
    "shape": "Triangle",
    "duration": "8 minutes",
    "city": "Platte City",
    "state": " MO",
    "latitude": 39.36195972,
    "longitude": -94.77275039,
    "comments": "Triangle shape object observed, no sound or lights  Okay so I obviously have never thought I would be making this kind of report.  I live approx 3 mi NW of Kansas City International Airport and was woke up (4:50) by our dog to go out as usual.  As I am standing there I saw something out of the left corner of my viewing area. I thought it was a very thin cloud floating or maybe remnants of a contrail.  I did a double take and sure enough I could clearly see its shape... It was a wing like shape similar to the B2 but had a metallic skin.  I observed the slowly moving object for about 8 minutes heading on a North Westerly heading then it went due North with no change in speed unitl I lost sight.  This object wasn't the typical fire, lights or aliens in my window sighting that you see on TV. Instead this had no lights or sound but was completely illuminated by the lights from the airport and the bright stars - clear as day! I then ran inside to inform my girlfriend of what I saw and made a drawing of the object.  I am not a licensed pilot but have been flying for over 20 years and never finished my exam and have extensive knowledge of any aircraft both military and commercial. I wish to remain anonymous but felt like I should make this report...   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 291.8926676492717
  },
  {
    "date_time": "11/12/2012 22:00",
    "shape": "Light",
    "duration": "30 minutes",
    "city": "Smithville",
    "state": " MO",
    "latitude": 39.40189041,
    "longitude": -94.5830787,
    "comments": "3 hovering lights over small town  The 3 lights were hovering around radio antennas off the highway.  They would come together then split back apart.  One got closer to my house and looked more triangular and made absolutely no noise.  Another flew right over the town of Smithville about a quarter mile off the ground.  These lights didnt blink like planes, as well as they didn't make noise at all.",
    "distance": 299.38913397008565
  },
  {
    "date_time": "11/14/2012 22:00",
    "shape": "Triangle",
    "duration": "5-7 minutes",
    "city": "England",
    "state": " AR",
    "latitude": 34.54142181,
    "longitude": -91.97302566,
    "comments": "Large black, triangular shaped aircraft with many bright white lights hovering over rural area along Hwy 161.  I opened the back door to smoke a cigarette before going to bed and noticed a large bright set of white lights with red and green lights hovering beyond a tree break about a half mile from the house. This sparked my attention because I saw the same bright lights around the same day of the week and time of night last week.  I watched it hover for a long time and thought it could have been a helicopter because of how it was hovering and how low it was.  I stepped outside to see if I could hear it because if it was a helicopter, you would have definitely been able to hear it because it was so close.  I can make the helicopter sound comparison because of an aerial search conducted recently for an escaped convict from a local prison in which helicopters were used to search in our area.  The aircraft didn&#8217;t sound anything like the helicopter I heard several weeks ago and as a matter of fact, didn&#8217;t have a sound at all until it was flying overhead.  After several minutes, the aircraft began slowly moving closer and eventually flew directly over our house and was so low I could see it was a triangle shaped aircraft with lots of bright white lights and a green and red light.  If the aircraft had been a plane, you would have definitely been able to hear it as it was so low and so close but I couldn&#8217;t hear anything but what sounded like a plane that was flying at a high altitude, miles and miles above.  Once it flew over, I didn&#8217;t see anything else but will be looking from now on for sure.  I am a middle class working mother of one who works in a physician&#8217;s office and is educated.  I don&#8217;t use drugs and was not under the influence of medication or alcohol at the time of the sighting.  I have seen this object twice now and can&#8217;t deny what I saw was not like any aircraft I have ever seen even at all the airshows I went to as a child.",
    "distance": 312.77471567256157
  },
  {
    "date_time": "11/8/2012 18:00",
    "shape": "Light",
    "duration": "3 minutes",
    "city": "Temple",
    "state": " TX",
    "latitude": 31.11311372,
    "longitude": -97.38845639,
    "comments": "I noticed two yellowish orange lights and I knew they weren't street lights they were much brighter and were moving.  They would dissapear and come back but as we followed them they descended and disappeared.  Almost diamond shape lights.",
    "distance": 314.07900872014665
  },
  {
    "date_time": "11/8/2012 17:50",
    "shape": "Fireball",
    "duration": "~10 minutes",
    "city": "Granger",
    "state": " TX",
    "latitude": 30.71844571,
    "longitude": -97.44232272,
    "comments": "Balls of light in formation in the north west area.  I was out walking in our field and just happened to look up above the horizon and saw these very bright lights.  My meditate reaction was that it was a new cell tower or something.  As I continued to stand there I realized that this was no plain or tower.  All I wanted to do is stand there and watch but I pulled out my phone and started taking video.    I called my brother to come see cause I knew he would never beleive me if I told him what happend. The lights where North West in a funny formation. There was four of them.  Omost in a straight line except the second light was a little lower making what it looked like was a v shape.  The balls of light seemed to be flashing omost but more like flickering. They did not appear to be moving.   Then they one by one disappeared. The one on the far left disappeared first then if was the second and within a couple of seconds they were gone. I wad on the phone with brother when they disappeared. In shock I was looking all ar! ound wondering if the lights were all around. Next thing I know my brother said there back.   I turned back around to the area where I say them last and there was nothing. I told him that I didnt see them. Instead of the lights being in the same spot the light were now more west. The lights made a giant triangle in the sky with only three this time. Two were high up level with each other and the third was very low to the ground. they did not move.   I had told my brother to come out there with me. So ny this time he was with me.  I called a real good friend that lives in town to step out side and see.  He also saw what me and my brother were looking at. My parents were gone but by the time we got to the house my parents were home.  We told them we say a ufo and they just nodded and said they saw it to.   My dad is veteran and was telling me all these laws about plains in formations. And was saying things about how lights ate on plains but long story short he was saying there was no way those were aircraft.   From what they say he said that the on! e appear ed as if it had landed but from my point it was still barely in the air. The lights in the triangle also disappeared quickly in sink. My parents said the say one move but I never did. I am now a true believer.",
    "distance": 341.3905866416146
  },
  {
    "date_time": "11/3/2012 20:15",
    "shape": "Light",
    "duration": "3 minutes",
    "city": "Bertram",
    "state": " TX",
    "latitude": 30.74463687,
    "longitude": -98.06015620000001,
    "comments": "Round orange glowing light passed over Bertram,Texas.  My husband and I were walking our dogs and we noticed a bright round orange light moving across the sky.  It moved from southeast to northwest and we know that it was not an airplane,planet or satellite.  The whole object was glowing orange.  After it passed over us,I had a hard time getting my dog to walk with me on her leash.I know this sounds odd but, she just wanted to stand in one place. The sighting was just about three minutes long.My husband is 62 and I am 56.",
    "distance": 342.0968320267361
  },
  {
    "date_time": "11/6/2012 19:17",
    "shape": "Circle",
    "duration": "5-10 seconds",
    "city": "Jefferson City",
    "state": " MO",
    "latitude": 38.57697843,
    "longitude": -92.20863622,
    "comments": "Perfectly circle lit up underneath  I saw a UFO on Tuesday, November 6, 2012 at 7:16 pm on hwy 50 south of town at the Militia Dr exit. My daughter and I were driving home from COMO and saw red blinking lights in the sky, My daughter was the first to ask what it was and asked if there was a tower there.  I was thinking the same thing but I told her no and we slowed down to look as we passed by and looking out my side window I saw plane as day a UFO still in the sky.  Not much higher in the sky than above the tree line. It was perfectly round, the bottom side was lit up with a light like a soft white fluorescent and it had lights around the outside of that in white and red color.  I could just see the shape of it on top because there were no lights on top and it was rounded.",
    "distance": 346.9873654773524
  },
  {
    "date_time": "11/8/2012 17:45",
    "shape": "Light",
    "duration": "30 minutes",
    "city": "Taylor",
    "state": " TX",
    "latitude": 30.58118507,
    "longitude": -97.41341466,
    "comments": "2-4 bright lights hovering over Granger, TX  Thursday evening I was driving north down Highway 95 from Taylor to Granger, TX.  I saw 3 extremely bright large twinkling lights in a triangle formation fairly low to the ground hovering over what looked like the Granger, TX area.    It was so unusual that I did not turn down FM 1331 but stayed on Hwy 95 to try and get a closer look at the lights.  They stayed in the tight triangular formation for several minutes &amp; then one instantly disappeared.  The other 2 stayed for a couple of minutes longer &amp; then disappeared.    It was still daylight at that point but getting dark.  I then drove home which took me about 10 minutes &amp; when I got settled into the house, my husband &amp; daughter were looking outside towards Granger &amp; the lights just reappeared around 6:30pm.    There were 2 of the large twinkling bright lights this time that hovered over the Granger, TX area for about 10-15 minutes.  We did capture them on videotape &amp; you can have a copy of what we captured.    At times, 1 or 2 more lights would appear but for the majority of the time the 2 main lights stayed fairly motionless over the Granger area.  About an hour later helicopters or aircraft were flying very slowly in a circular pattern over where the sighting happened.",
    "distance": 350.8480847128634
  },
  {
    "date_time": "10/30/2012 22:45",
    "shape": "Light",
    "duration": "90 seconds",
    "city": "Atwood",
    "state": " KS",
    "latitude": 39.80704181,
    "longitude": -101.04161640000001,
    "comments": "At about 2245, an object that appeared to be a star or planet caught my eye.  I looked away, then glanced back up, and noticed that the &quot;star&quot; was moving rather quickly from North to South.  I then noticed 3 aircraft that appeared to either be traveling in formation with the white object, or chasing it, coming up from the North of the object.  After about 10 seconds, I could make out individual strobes on the 3 aircraft, and a blinking red light on just one of them.  The original object was solid white, not blinking or pulsing, and did not have any red or green lights to it.  The intensity of the white light never varied.  About 10 seconds after this, the aircraft on the Northern end of the &quot;formation&quot; of 3 sped up, and placed itself on the Southeastern tip of the formation, and closest to the white object. About now, I could make out the body of the aircraft that appeared to be in the middle of the formation, and saw reflections from it&#8217;s strobe on the bottom of the airframe.  The objects proceeded directly South, with the white light leading the group and the 3 aircraft in apparent formation back to its North, Southeast and West.  The 3 aircraft following the unblinking white light never once overtook the (object), but stayed to its North, East and West, even when the Northern aircraft sped up to overtake the other two!  I cannot say for sure, but, I thought I could make out some type of structure to the object emitting the white light, because of the moon shining onto it.  Also, I cannot prove this, but, it kind of looked like the 3 aircraft in pursuit of the white light were staging themselves in position to visually observe the white object.  That is just my appreciation of what I saw, and how the 4 objects were traveling in relation to one another.  This did not appear to be a satellite, and it certainly was not a planet or a star!  The entire time I observed the white light, and the 3 aircraft following (or chasing it), was about 90 seconds.    My sighting ended when the lights went behinds a light cloud haze.    ((NUFORC Note:  We spoke via telephone with this witness, and he seemed to us to be quite serious-minded and eloquent.  We suspect that he is a highly reliable witness.  PD))",
    "distance": 350.91329195252865
  },
  {
    "date_time": "10/29/2012 1:40",
    "shape": "Triangle",
    "duration": "5 seconds",
    "city": "College Station",
    "state": " TX",
    "latitude": 30.604005800000003,
    "longitude": -96.32297775,
    "comments": "pitch black triangle shaped object travelling across the night sky  I work graveyard shift on Texas A&amp;M campus and went outside to smoke a cigarette. It was somewhere between 1:40-1:45 am.  I was looking at the stars noticing that the sky was very clear.  I was looking at Orion's belt when a very subtle &amp;quot;shift&amp;quot; or motion near it. It was very subtle, but as I focused my attention on it, I noticed it was a perfect v-shape. My instant thought was that it was geese because of the shape, but as I watched I was thinking to myself &amp;quot;no way&amp;quot; because it was travelling too fast, and the shape was a PERFECT v with no fluctuation.  It appeared to be a solid V-shaped object, based on the subtle line of the edge I could distinguish. I could only for certain see the V edges, and not sure about a third edge. It appeared solid and uniform.  I also could not make out any individual birds or wings, nor was there any sound that you would hear when geese fly by overhead. There was no sound at all.  I have never seen a flock of geese fly so perfectly in a v formation and that quickly.  It was  black on black against the night sky. I could barely make it out and would have NEVER noticed if it hadn't come into a very small field of vision while I was looking at the stars.  Even as I told myself it must be geese, something about it... I can't put into words ....made me feel like it definitely wasn't. It spooked me. In those few seconds my mind was racing to rationalize it. the V was, however, flying south-east, a direction I assume geese would fly this time of year. But it seemed to be a very large dark triangle/boomerang shaped object flying about the altitude of a regular plane and travelling quickly, maybe similar speed to some planes. I'm not good at giving estimates on size, or even distance in the sky, so could be unreliable on measurements.  I only got about 4-5 seconds of being able to see it before it blended into the night sky/too far away.  If it were geese, it seems like they would have been low enough to hear AND see (full or nearly full moon), and the speed was too great. I've never seen geese fly that perfectly in unison, either.  Maybe it was military aircraft??",
    "distance": 354.1152456318761
  },
  {
    "date_time": "11/8/2012 23:00",
    "shape": "Flash",
    "duration": "5-10 seconds",
    "city": "Tucumcari",
    "state": " NM",
    "latitude": 35.17130606,
    "longitude": -103.7267162,
    "comments": "On Hwy 54 headed North, the entire sky lit up in a bright blue light beginning in the north horizon and encompassing entire 360 view.  While traveling Northeast on Highway 54 as we passed over the overpass right outside of Tucumcari, NM heading towards Logan, NM the entire sky lit up in a bright blue light beginning in the north horizon. It encompassed the entire sky from horizon to horizon and it faded the same way it appeared but faded from the south horizon to the north horizon. It lit up everything in view like daylight except in a blue tone.",
    "distance": 361.41391044373853
  },
  {
    "date_time": "11/16/2012 5:28",
    "shape": "Unknown",
    "duration": "3-5 minutes",
    "city": "Brainard (6 mi. E of; on Hwy. 92)",
    "state": " NE",
    "latitude": 41.18108009,
    "longitude": -97.00267284,
    "comments": "Orange cresent object with trail moving northwest to southwest..no sound, no decent 2-3 min across sky  On my way to work on hwy 92 6 miles east of brainard at 5:28am. I stopped my car and got out when I saw an object coming from east-northeast moving west-southwest. It was glowing orange in a cresent shape the size of my fist..void/dark behind the cresent shape then coming back together forming a orange trail. At first I thought it was an airplane with a bad engine. Then I thought it could be a very large asteroid. However it moved across the sky without desending,completely silent, taking about 2-3 minutes to cross the sky... horizon to horizon.",
    "distance": 382.0321645101304
  },
  {
    "date_time": "10/31/2012 20:15",
    "shape": "Light",
    "duration": "2 minutes",
    "city": "Pinehurst",
    "state": " TX",
    "latitude": 30.18940436,
    "longitude": -95.70068975,
    "comments": "Second Light near Pinehurst, Texas  This report is about an hour or so after the other, so about 20:15, I came out of the Kroger&#8217;s lot at 249 &amp; 2920 (in Tomball)  heading north once more, I passed CVS and noticed there was a Bright Light again in the northwest sky.  This Light was not as bright as the other one.    As I headed north I passed the seafood restaurant on the right which is near West Rollingwood &amp; 249 North.  As I came up to the 249 and 1744 split the light started to move east and not as bright.  It was an amber colour with no strobes or marker lights of any kind.  I made a right on to 249 (towards Magnolia) and I lost the light behind the trees.      I am a former truck driver and now small business owner.",
    "distance": 389.58437969567603
  },
  {
    "date_time": "11/16/2012 5:30",
    "shape": "Other",
    "duration": "5 seconds",
    "city": "Omaha",
    "state": " NE",
    "latitude": 41.25363765,
    "longitude": -96.01896175,
    "comments": "While running in the early morning, a friend and I witnessed an object flying at a low altitude emitting an orange glow behind it.  My friend and I were running this morning, 11/16/2012, the same route we run every Friday at that time.  It was still dark, stars were out.   Out of the corner of my eye I caught movement and a light.  I looked up and some type of craft was passing in front of my line of sight.  It was a dark half-circle shape I believe and had an orange glow behind it across the entire back of the object.  The orange glow tailed out behind for a short distance and there seemed to be occasional sparks within the glow.    The object continued past moving to the southwest, maintaining a constant altitude which was fairly low in the sky.  Neither one of us heard any sound coming from the craft.  It seemed to be moving at a high rate of speed but was easy to follow across the sky until we lost it over the hill.  My friend&#8217;s initial thought was that it was a meteor, but I didn&#8217;t get that feeling at all.  It was maintaining a constant altitude and seemed to be banking slightly to the! Southwest.",
    "distance": 393.11462554164285
  },
  {
    "date_time": "11/11/2012 14:20",
    "shape": "Disk",
    "duration": "30 seconds",
    "city": "Omaha",
    "state": " NE",
    "latitude": 41.25363765,
    "longitude": -96.01896175,
    "comments": "Disappearing object  While I was stopped at a red light, something in the sky caught my eye.  There was a cylindrical shapped object which was flying to the south.  Due to the reflection of the sun I was able to determine that this object was cylindrical in shape.  It then stopped moving from what I could tell.  At the very moment it stopped it became an extremely bright white and simply disappeared.",
    "distance": 393.11462554164285
  },
  {
    "date_time": "11/7/2012 23:00",
    "shape": "Fireball",
    "duration": "30 seconds",
    "city": "Omaha",
    "state": " NE",
    "latitude": 41.25363765,
    "longitude": -96.01896175,
    "comments": "Huge ball of light came up from the ground and shot into the atmosphere   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 393.11462554164285
  },
  {
    "date_time": "11/3/2012 20:03",
    "shape": "Other",
    "duration": "4-5 minutes",
    "city": "Omaha",
    "state": " NE",
    "latitude": 41.25363765,
    "longitude": -96.01896175,
    "comments": "Two mysterious red lights floating across the sky, it lasted about 4 minutes and suddenly dissapeared.  Theyre was 2 red lights floating across the sky, they seemed to come from the middle of no where and suddenly kept coming closer and dissapeared, it was two flashing lights I took a glimpse and they were both shaped like saucers.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  We suspect that the sighting took place as night, so we have amended the time above.  PD))",
    "distance": 393.11462554164285
  },
  {
    "date_time": "11/3/2012 8:03",
    "shape": "Light",
    "duration": "4 minutes",
    "city": "Omaha",
    "state": " NE",
    "latitude": 41.25363765,
    "longitude": -96.01896175,
    "comments": "Two mysterious red lights hoovering across the providence. lasted about 4 minutes.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 393.11462554164285
  },
  {
    "date_time": "11/1/2012 20:15",
    "shape": "Rectangle",
    "duration": "5 minutes",
    "city": "Omaha",
    "state": " NE",
    "latitude": 41.25363765,
    "longitude": -96.01896175,
    "comments": "Large rectangle 168th blondo Omaha ne  At first sight it appeared to look like a pair of bright white headlights in the sky with a flashing red light on the back when it turned 90* to the west.  It was heading from approximately 156 and blondo and we saw it coming toward 168 and blondo.  Flying low - the altitude of a helicopter.  When we got closer, and were practically underneath it we looked up.  No noise made by the craft completely silent. Very large rectangle shape with mini white and red lights underneath. It turned sharply to the southeast and took off.  The last time we could see it it looked like a string of white lights in the sky moving rapidly toward the dodge expressway.  Side note: think we saw the same crafts about 45 mins earlier at 156 and dodge area.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 393.11462554164285
  },
  {
    "date_time": "10/29/2012 19:45",
    "shape": "Rectangle",
    "duration": "3 minutes",
    "city": "Omaha",
    "state": " NE",
    "latitude": 41.25363765,
    "longitude": -96.01896175,
    "comments": "A hovering large, rectangle-shaped object with lights over the 150th St. area just south of Dodge Exprsswy  Between 144th and 156th street exits on the Dodge Expressway, I saw a large object in the sky.  It was a large rectangle shape and all across the front, it had bright white lights.    Underneath the craft, you could see what looked like a faint light coming from inside the object.  At the back, was a red light.    It came from the Southwest and hovered over about 150th St., on the south side of Dodge for about three minutes.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 393.11462554164285
  },
  {
    "date_time": "10/31/2012 19:30",
    "shape": "Light",
    "duration": "&gt;1 minute",
    "city": "The Woodlands",
    "state": " TX",
    "latitude": 30.17180569,
    "longitude": -95.49550993,
    "comments": "2 dots of light resembling stars, moving very slowly and disappeared  It looked like 2 stars, one was above and a little to the right of the other one.  They looked like stars but I look often at the sky and my intuition told me they couldn't have been.  They appeared about 30 degrees off the ground but very far away and far to too bright to be an aircraft.    I thought I saw them move so i ducked a little to use my roof as a reference and I watched them go behind my roof, I continued doing that about 2 or 3 more times before i assured myself that they were in FACT, moving.    I ran inside to get my dad but when i got back out the front dot was gone and the one in rear disappeared as i stared at it pointing for my dad to see.  ====PLEASE CALL the 936-((number deleted)) number because the one i called on is my housephone====    ((NUFORC Note:  Possible satellites??  PD))",
    "distance": 393.81825907304705
  },
  {
    "date_time": "11/13/2012 23:00",
    "shape": "Diamond",
    "duration": "ufo sighting",
    "city": "Clarksdale",
    "state": " MS",
    "latitude": 34.20039138,
    "longitude": -90.57484809,
    "comments": "UFO sighting clarksdale ma  My friends and I were riding Down highway 1 towards Helena Arkansas.  We then turned around heading back towards clarksdale ms when we see this bright object in the sky.  We stopped dead center in the road and cut our lights off to see if it was moving and it was.  It then shined a bright light on us and pretty much made a 180 and started moving the opposite direction.  We then head back towards home after and we see blinking white lights in the sky, and they then stopped blinking and it's just a bright star looking objects moving in a pattern in the same direction we saw many many more that did the exact same thing.  I don't knowing anyone else has seen it but it was truly amazing.",
    "distance": 395.9245422783677
  },
  {
    "date_time": "10/31/2012 19:11",
    "shape": "Light",
    "duration": "2-3 mintutes",
    "city": "Tomball",
    "state": " TX",
    "latitude": 30.10591435,
    "longitude": -95.61698571,
    "comments": "Bright Light becomes two Lights over Tomball, Texas  I was driving North on 249 and I observed a very bright light in the sky to the northwest about 30-35 degrees up  as I approached Holderieth   I continued to follow the road past the 249 Business turn off and as I watched the Light seemed to remain stationary.  As the road came up to the cross road Hirschfield Road, the light broke into two smaller lights and I had to pay attention to the ramp traffic going up to 249 North and the North Bound Service Road,  I looked up and both lights were gone.    There were no clouds that I could see; the Light when at its brightest was just as bright as the 249 streetlights  or brighter.   When they broke into two, I could only see these lights and no stars.  There were no jets in the air around either and neither at marker lights, strobes or red lights as aircraft is required to have.     I am a former truck driver and now small business owner.",
    "distance": 396.38461707360915
  },
  {
    "date_time": "11/3/2012 0:00",
    "shape": "Oval",
    "duration": null,
    "city": "Tunica",
    "state": " MS",
    "latitude": 34.69930301,
    "longitude": -90.37826414,
    "comments": "they have been here far back as b4 airplanes were invented . people who dont believe will soon  i was with a friend at fitzgeralds casino and a ufo came out of the sky and caused a blue 4 door car to reck . we were behind the car on fitzgeralds main road almost to the enterance and the person in the car in front of us was almost hit by it they ran off the road and recked i dont thimk they survived. the lights to fitzgeralds casino were knocked out when the ufo appeared and thye reck happend it was 2 am on a saturday and the ufo hovered over the tree tops from 2 am to 4 am when the lights came back on it left right before it left a shooting star shot out the sky to it and it had 3 red lights on one side one bright light it shined at us on other side and a white light in the center of the craft . alot of people reported it at the casino thry were military helicopters everywhere and about 20 in all surrounding it.the ufo killed the tree to a burnt black looking color i went over the next day and it had white stuff on the ground and the tree was dead   ((NUFORC Note:  We are uncertain as to whether this is a serious, or well-documented, report.  If anyone knows anything about this alleged incident, we would welcome other reports.  PD))",
    "distance": 398.3848844760217
  },
  {
    "date_time": "11/13/2012 18:30",
    "shape": "Sphere",
    "duration": "5 minutes",
    "city": "Novinger",
    "state": " MO",
    "latitude": 40.23267619,
    "longitude": -92.70568582,
    "comments": "small light low to ground in novinger mo  about 6:3 november 13 , 2012 i observed a strange light over the middle of novinger . i saw it from six hiway and thought it was a light on top of a new cell tower in town. i turned north on 149and went untll it was strait to the left of me. i turned left at 4th street. it was in front of me then. i turned right on swanson then left on davis .it was still in front of me. i turned right on novinger ave then left on missouri ave. it was moving north and crossed my path left to right about snyder ave,  and when i looked up again it crossed my path again. I  thought there must be two but never saw two at the same time.  i stopped the car and shut it off.i heard no noise. it continued north til it was out of sight. the light had a starburst design below and a very faint rounded structure above. light changed from yellowish to red",
    "distance": 404.27657040884657
  },
  {
    "date_time": "11/8/2012 19:45",
    "shape": "Fireball",
    "duration": "2 minutes",
    "city": "Farmington",
    "state": " MO",
    "latitude": 37.78830508,
    "longitude": -90.42023197,
    "comments": "Huge fireball type object with humanoid object in the center  On the night of November 8th 2012 I was walking down a street in Farmington Missouri and I glanced up at the sky.  This is when i noticed that in the north west sky there was a bright object.  There was a building obstructing my view so I walked a little quicker to get around it and that is when I saw a huge fire ball type object sitting in sky silently maybe as low as 10 stories up.  It looked like a mini sun that was just hovering there.  The middle of the huge buring object however was black and I noticed it looked like something in the middle of it was moving. When I got a better look it realized that in the middle of this burning ball of light was what appeared to be the shape of a human  only larger than any man that I have ever seen. I noticed the figure appeared to raise it's arms up then the fire around it started to get bigger and bigger and then it went from a still position to moving slowly away. Then It moved diagonally up and imploded on it's self! after making an enormous flash of light.",
    "distance": 410.1663237891669
  },
  {
    "date_time": "11/11/2012 2:00",
    "shape": "Other",
    "duration": "2-4 seconds",
    "city": "New Braunfels",
    "state": " TX",
    "latitude": 29.68811304,
    "longitude": -98.12751742,
    "comments": "Me and a couple of buddies were out on the Guadalupe river last night when the area we were in lit up. Not even a few seconds before that were staring up at the stars since it was such a clear night. My best friend had said something so we all were looking at eachother talking when the everything lit up like lighting which we knew was impossible.  So we look up immediately and I see a bright white light about an inch under the north star (almost the exact same size as the north star) and it just.. blew up? The white light turned into a ring of light expanding out from the center and I didn't see the trail but everyone of my buddies saw a smoke trail that was going through the ring and then it just disappeared.. we freaked out for a while. we felt so uneasy after it happened.",
    "distance": 415.0872995433038
  },
  {
    "date_time": "11/13/2012 19:55",
    "shape": "Fireball",
    "duration": "30 seconds",
    "city": "Katy",
    "state": " TX",
    "latitude": 29.78250667,
    "longitude": -95.83217871,
    "comments": "Glowing fireball going through night sky  My wife and I were outside playing with the dogs when I noticed an orange ball of light ascending through the air from the North aky. I called attention to it because it looked as if a plane were on fire in the air but had none of the colored directional lights typically seen on aircraft at night.  The object moved relatively slowly to the South and the &quot;fire&quot; seemed to grow and then get smaller while flying through the air (just like a fire would in a fireplace).  We could not make out any kind of shape for the flying object, but there was definitely fire.  We heard no sound accompanying this craft. After about 30 seconds, the object seemed to disappear or just fly out of sight.  We are not crazy people and are not implying the existence of UFOs from other planets, etc.  I found this sight while trying to find out if there was a plane on fire in the area but after reading a few other similar accounts, felt like it made sense to share this sighting in hopes of an explanation.",
    "distance": 415.28669724509734
  },
  {
    "date_time": "10/28/2012 16:40",
    "shape": "Fireball",
    "duration": "3 seconds",
    "city": "Houston",
    "state": " TX",
    "latitude": 29.85938411,
    "longitude": -95.40558481,
    "comments": "Day Light UFO Over Katy, TX, 16:40 Central Time, Fire Ball lighter than sun materialized then disappeared.  As I was driving west on I-10 before the Gessner exit, I saw a fire ball, whiter than the sun, and it was in the sky in the same direction as the sun, it came from being invisible materialized then disappeared.    The whole thing lasted less than 3 seconds.    I asked my girlfriend if she saw it, but she was not looking at the sky. so she could not see it.",
    "distance": 416.06148370674094
  },
  {
    "date_time": "11/17/2012 18:00",
    "shape": "Triangle",
    "duration": "1 minute",
    "city": "St. Louis",
    "state": " MO",
    "latitude": 38.79501516,
    "longitude": -90.78704358,
    "comments": "Silent Black Triangle",
    "distance": 420.28778552296484
  },
  {
    "date_time": "11/7/2012 22:10",
    "shape": "Fireball",
    "duration": "30 seconds",
    "city": "North Platte",
    "state": " NE",
    "latitude": 41.13598597,
    "longitude": -100.77413100000001,
    "comments": "fastest thing ever went from 10000 feet to 50000 feet .in 15 sec.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  We have no idea what the report addresses.  If this is a legitimate report, we would like the witness to submit a much more detailed report.  PD))",
    "distance": 421.7247891786329
  },
  {
    "date_time": "10/29/2012 6:10",
    "shape": "Light",
    "duration": "15 seconds",
    "city": "St. Charles",
    "state": " MO",
    "latitude": 38.797680799999995,
    "longitude": -90.50181434,
    "comments": "A large green orb light hovered for a moment near the clouds then zoomed away over the horizon.",
    "distance": 433.88163410460515
  },
  {
    "date_time": "10/31/2012 23:00",
    "shape": "Triangle",
    "duration": "10 minutes",
    "city": "Piperton/Rossville",
    "state": " TN",
    "latitude": 35.03140687,
    "longitude": -89.63024231,
    "comments": "6 UFO's spotted in 5 mile radius  Driving down hwy 57 I encountered an object in the sky with red, blue, and clear lights.  Setting completely still and no sound.  Kept driving and saw 2 more, one above gas station and another over a bank on other side of street.  Only several  feet from eachother.  Went about 5 miles down the road and saw 2 more flying very close to each other.  All 6 were not moving setting still and close enough to the ground that I could see their shape.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 436.3226963585118
  },
  {
    "date_time": "11/8/2012 22:30",
    "shape": "Flash",
    "duration": "1 hour",
    "city": "Roswell",
    "state": " NM",
    "latitude": 33.38086066,
    "longitude": -104.525642,
    "comments": "Bright flashes in sky east of Roswell.  Decended with not trail towards the ground.  Working on southern end of Roswell when co-worker called on radio claiming sighting of bright flash east of town.  Met up with 3 co workers on east side of town.  Saw one bright flash while togther.  Shortly after another co-worker called and asked if we had seen the flashes in the sky.  Thought it might be meteors.",
    "distance": 438.4134784174079
  },
  {
    "date_time": "11/3/2012 23:00",
    "shape": "Sphere",
    "duration": "2 minutes",
    "city": "Florissant",
    "state": " MO",
    "latitude": 38.80368648,
    "longitude": -90.32170893,
    "comments": "AMBER LIGHTS SPOTTED IN FLORISSANT, MO  Approximately 11:00 PM central time, I was driving north in Florissant, Missouri.  I looked east and saw what appeared to be 12 spherical, amber lights.  They were in no particular line or pattern and appeared to be stationary or extremely slow-moving and did not leave any sort of trail.  The objects were very small - probably the size of a Smart car and were no more than 1,000 feet off of the ground.  I quickly turned around and started to head south to try and follow them, but they had already disappeared.   ((NUFORC Note:  We spoke via telephone with this witness and she struck us as being unusually eloquent and objective in her description of the event.  PD))",
    "distance": 442.67209324601987
  },
  {
    "date_time": "11/8/2012 23:00",
    "shape": "Unknown",
    "duration": "20 seconds",
    "city": "Pueblo",
    "state": " CO",
    "latitude": 38.36518317,
    "longitude": -104.7067416,
    "comments": "Huge smoke like trail going across the sky  I was on my way to get my mother from work about 11:00pm downtown in Pueblo, Colorado, on the night of 11/8/12.    Heading from North to the South I saw a huge white cloud looking object appear and go across the sky and then disappear, kind of how airplanes leave a trail of smoke, only this was much larger and late at night.  It lasted about 20 to 30 seconds.   I saw it while I was driving and didn't know what I was seeing.    I pulled over to check it out.  It went across the sky very fast but the stream behind it was extreamly long and lasted a long time.",
    "distance": 447.47082018911783
  },
  {
    "date_time": "11/8/2012 1:30",
    "shape": "Fireball",
    "duration": "2 minutes",
    "city": "Pueblo",
    "state": " CO",
    "latitude": 38.36518317,
    "longitude": -104.7067416,
    "comments": "Multicolored flashing ball of light (disco-ball)  At approximatly 1:30 am i took my dogs outside to relieve themselves and was looking up at the night sky when i noticed a ball of light that flashed multiple colors white then blue then green the yellow then red and so on.  It was stationary and never moved but it was bright and not anything like a planet or star.  I've seen these objects here in Pueblo before.    About 4 years ago i was talking a walk through the park late at night and there must of been 10 to 15 of these lights in the sky.  I've never seen these lights anywhere else except in Pueblo.   ((NUFORC Note:  Possible observation of the star, Sirius, we suspect.  PD))",
    "distance": 447.47082018911783
  },
  {
    "date_time": "11/3/2012 23:45",
    "shape": "Fireball",
    "duration": "10 minutes",
    "city": "Des Moines",
    "state": " IA",
    "latitude": 41.6507275,
    "longitude": -93.60197155,
    "comments": "3 Bright Red Lights in a Triangle Formation  At approximately 11:45pm central time on November 3rd I went out into my front porch to smoke a cigarette.  I was looking east when I noticed a bright orange/red light in the sky.  Upon a second look I noticed two more identical lights.  The lights were aligned like the 3 points of a triangle.  I could not see a solid object between the lights but the way they moved together made me believe they were part of a solid object.  The lights were above the tree line and appeared to be very close to me.  I was worried that while I was sitting there the object/lights were going to fly over my house.  They appeared to be much lower than an airplane would fly.  I would estimate that they were approximately 100-200 feet in the air, maybe higher but definitely below the light cloud cover.   I remember thinking that when the object flew over, it was so low that I would be able to see all the detail and that frightened me.  The lights were gliding very slowly, not wavering from their position in the triangle and moving in a westerly direction.  The lights were circular in shape and were about 5 times brighter and larger than the brightest/largest star in the sky.  I watched the lights for about 10 minutes as they moved west, toward me, then they began to slowly fade until they appeared no brighter or larger than the average star.  I wish, in retrospect, that I had grabbed my camera but I was too scared/in awe to go get it while the event was happening.  After the lights faded I immediately went inside and woke my husband but it was too late, they were gone.  I am a 30 year old mother of two with a 4 year degree from a reputable university.  I am an admitted skeptic.  I have never witnessed anything like this before.",
    "distance": 460.34571161132175
  },
  {
    "date_time": "11/4/2012 18:34",
    "shape": "Fireball",
    "duration": "~3 seconds",
    "city": "Ranchos de Taos",
    "state": " NM",
    "latitude": 36.36515077,
    "longitude": -105.600834,
    "comments": "Large westward moving blue-white meteor  18:34 MT seen from Taos, NM  This was almost certainly a large meteor.  It was a very bright white (nearly blue-white) ball.  It appeared directly overhead and headed straight west at high speed covering 30 to 35 degrees of sky in approximately 3 seconds.  It then appeared to simply go out, which I assume was its  burning up in the atmosphere.  I have witnessed many meteor showers and this was very similar.",
    "distance": 464.40215725012166
  },
  {
    "date_time": "11/9/2012 16:00",
    "shape": "Cylinder",
    "duration": "~2 minutes",
    "city": "Meadville",
    "state": " MS",
    "latitude": 31.47241638,
    "longitude": -90.89330175,
    "comments": "White cylinder shaped craft with no wings flies over Meadville MS on clear and cloudless day.  I walked put to my car to get something, noticed what a beautiful day it was as the sky was deep blue and there were no clouds.   I looked up and saw a white cylinder shaped craft with no visible wings coming from a bit Northwest and headed dead on Eastward.   My partner was sitting on the porch and I called for him to come see.  He saw it as well and agreed it was rather strange.  It had no contrail and passed over in a fast way that didn't look like a conventional airplane.",
    "distance": 470.1592521635878
  },
  {
    "date_time": "11/8/2012 21:30",
    "shape": "Formation",
    "duration": "over a hour",
    "city": "Paton",
    "state": " IA",
    "latitude": 42.16501525,
    "longitude": -94.25506740000002,
    "comments": "A opening in space that formed a hole from which I could see many flying objects keeping the hole open.  I went outside to feed my cats at around 21:30 and living out in the country I have very few lights so I have a clear view of the sky.  As I bent over to put cat food in the cat&#8217;s bowls I saw a streak of light from the corner of my eye as I was beginning to bend over.  I looked up and the first thing I saw was how bright the planet Jupiter was and then I saw another blast of light which pinpointed where the first light I saw had come from.  I stood there in awe with my mouth open because I could not believe what I was seeing.  It was a clear night with a few clouds and a soft breeze blowing and what I saw was a hole in the sky.  It was dark outside but enough light to show that clouds were around this hole but not blocking it.  Inside this hole which almost seemed like looking through a tunnel, it was very clear through it almost like it really wasn&#8217;t our sky.  It was full of dancing lights that moved around all over the place and once in awhile they moved together in synch.   One more time I saw a blast of light come from something inside this hole that exited and seemed to go into our clouds.    The beam looked like this:   --------- --   ------   -- -------- -- ------------ -- ------------- -- -----------.     It was long and short beams going in a straight line. No sounds were ever heard during all this.  Most of the lights were red and white with a slight amber color on one.  It seemed they were working on keeping this hole open and around the outside portion of the hole in what I think were clouds; they seemed to be manipulating the clouds or something into something that would appear alive.  In other words, the outside of the hole along with the inside of the hole seemed like a living entity. It moved very fluently as if looking around.  I totally could not believe this and I ran in the house and called my parents to see if they saw anything from where they live 20 miles away.  My dad said he saw something in the east but I told what I was watching was South East I went to my neighbors across the road and they stepped out and I had to point it out to them where to look.  They both stood there in amazement and couldn&#8217;t believe it either how these bright dancing lights moved inside, and how the outer portions of the hole would move as if it were alive. At that moment two packs of coyotes started to howl and my neighbor&#8217;s wife went in the house. I came back to my place and called my dad and then I went out to see if the hole was still there. It was, but this time much fainter and fewer lights are in it.  I can handle lights in a tunnel like hole but it bothered me how it was forming shapes that almost seemed humanoid at times.  The best way I can describe it is think of yourself as a tiny ant inside a hollow egg.  Someone comes along and drills a hole in the egg and puts his eye up to the egg to see the ant inside. The ant would see you and see you moving from his perspective outside that hole. That is what it looked like to me.  A giant peephole with something holding this hole open manipulating the area around it and then moving this animated matter in the shape of an animal or human reaching and grabbing things. If the bible is true and they say god will open the heavens and you will see him then I think I just saw a practice run, because I still don&#8217;t believe what I saw, but I did, and it&#8217;s disturbing on",
    "distance": 479.03746387368454
  },
  {
    "date_time": "10/30/2012 0:00",
    "shape": "Circle",
    "duration": "20 minutes",
    "city": "Burlington",
    "state": " IA",
    "latitude": 40.81084531,
    "longitude": -91.12500713,
    "comments": "Saw big bright flickering amber light/object flying upwards that disappeared and reappeared with several planes sweeping the sky.  Both my friend and I were outside getting a breath of fresh air and looking at the stars in the country when we saw a huge flickering amber light.  My friend asked me what star it was.  I said it didnt look like a star let alone a planet.  So we kept watching for at least another min or two and realized the object was moving up at a fairly good pace.  No other objects were noticed in the sky at the time.  But as we watched my friend turned to me and said wouldnt that be weird if it just disappeared?  I said well yeah!.  Just then we look back and its gone and several planes were seen around the same area. We rushed inside to tell more people but no one wanted to go outside in the cold.  And as we got back, it reapeared and then again disappeared for a second time.  Planes were all over the place flying in different directions and sometimes in a pattern together.  And they all were flying very very slowly.  These planes didnt make hardly a sound though either until they! were right above your head.",
    "distance": 490.011458721474
  },
  {
    "date_time": "10/31/2012 19:42",
    "shape": "Fireball",
    "duration": "25-30 seconds",
    "city": "Commerce City",
    "state": " CO",
    "latitude": 39.90330148,
    "longitude": -104.88019840000001,
    "comments": "Slow moving orange ball of fire.  While trick or treating with my son tonight, he spotted something directly over us and pointed up.  Myself along with a few neighbors looked up to see a large, round, orange object, moving fairly slow.  It seemed to have a weird haze around it, almost like it was on fire.   It was very bright, silent, and seemed to be twice the size of a 737 airplane.    Since it was dark, it was hard to tell how high it was, but I&#8217;m guessing maybe 1,500 feet or less.    The object moved toward the west.  My son was terrified and demanded to go home and stop trick or treating.  I have seen meteors, shooting stars, the Northern lights, airplanes, helicopters, etc., nothing compares to this.    It was only around for maybe 25-30 seconds (I was trying to get my phone for video, but was too late) and then it started to fade in and out, until finally it was completely gone.  I called the local police department and they suggested it was a helicopter, but it wasn&#8217;t.    I feel like it&#8217;s an insult to my intelligence when everyone I tell says it must have been a plane or a helicopter.  My son is almost nine and is now scared to sleep in his bed alone tonight because of what he saw.    I am a female criminologist in my late thirties, college educated, and honestly never really believed in UFO&#8217;s before tonight.  After experiencing what we saw, I don&#8217;t believe there is currently anything that can explain it.",
    "distance": 505.464778711933
  },
  {
    "date_time": "11/4/2012 18:00",
    "shape": "Light",
    "duration": null,
    "city": "Lakewood",
    "state": " CO",
    "latitude": 39.70626515,
    "longitude": -105.1078368,
    "comments": "5 strange bright lights lined up in the sky over Lakewood Colorado.  As my husband was coming home from the store on the night of November 4, 2012, he claimed to have seen 5 bright lights lined up in the sky.  I didn't believe him at first, but as he went on and on about these strange lights I decided to go for a drive and see if I could see them for myself.  I figured if he was telling the truth they would have probably dissapeared by now though.  Strangely enough as I was pulling up to where he had told me to go I did infact see 5 bright lights lined up in the sky they were too big and bright to be stars and they couldn't have been any sort of aircraft because they stood completly still. I was in shock, I couldn't believe I was actually wittnessing this.    I reached over to grab my phone to record it then I realized I had forgotten my phone at home.  I rushed back home to grab my phone.  My husband decided to come along with me this time.  When we arrived the strange bright lights were no longer in a straight line but instead all over the place still near eachother though.  We recorded them on our phone and then left to go back home.",
    "distance": 508.49669531405624
  },
  {
    "date_time": "11/12/2012 18:55",
    "shape": "Light",
    "duration": "1 minute",
    "city": "Cotulla (south of)",
    "state": " TX",
    "latitude": 28.43837538,
    "longitude": -99.23837897,
    "comments": "Star like object with osculating flight path heading N NE South Texa's  This is the second time I have seen a blue light which appears to be at a high elevation no flashing light last appearance was 6/11/12&#8230;  The object appears to look just like a medium magnitude blue star..  I work in the oil field and smoke behind my sleeping quarters and scan the sky.  I first observed the object at about 90 degrees to the horizon, so pretty much straight above my head.. the object generally flew north and then north east..  What is particularly odd about the object is that its flight path is not a straight line the is a wobble to the path back and forth.. think of a rope stretched tight and you flick one end.. the flight path reassembles the osculation of the rope, this can not be a conventional plane .. there is no flashing light just blue to bluish white&#8230; looks just like a moving star..  not much wind at ground level.. the object appears to be very high in the sky&#8230;",
    "distance": 511.1434664210055
  },
  {
    "date_time": "11/2/2012 23:00",
    "shape": "Light",
    "duration": "30 minutes",
    "city": "North Liberty",
    "state": " IA",
    "latitude": 41.745889899999995,
    "longitude": -91.60767757,
    "comments": "Four white lights swirled in arcs across the sky, then were absorbed into a red/blue orb which sped away.  Three of us saw four bright white lights this evening.   They began from a central point, then moved in arcs and circles across the horizon.   The density of the lights changed from bright white to paler white, then changed from white to light green.   The speed at which they moved varied from super fast to slow as well.     The lights silhouetted the surrounding clouds, so that it was easily apparent that they were either in or above the cloud cover.    After about half an hour, a large red/blue orb appeared in the midst of the lights.     The lights were absorbed into the large red orb, which then streaked across the sky.",
    "distance": 521.5739975617173
  },
  {
    "date_time": "11/9/2012 23:00",
    "shape": "Unknown",
    "duration": "explosion",
    "city": "Albuquerque",
    "state": " NM",
    "latitude": 35.09914887,
    "longitude": -106.6094405,
    "comments": "unknown explosion over Albuquerque NM.  I am a security officer in the Ventana Ranch area of Albuquerque NM during the midnight shift 20:00 - 04:00.    Some time between 23:00 11/09/2012 and 00:00 11/10/2012 myself and my partner were on patrol in the neighborhoods and watched a slow moving blue light cross the sky over the east mountains of Albuquerque.    Within minutes of seeing it there was a HUGE flash of white/blue light (lighting up the entire sky) focused on the light we saw descending on Albuquerque.    The light disappeared and there were several flaming balls of light falling like embers.    There was no sound or blast after the explosion.  It seems that some craft entered and exploded over either Albuquerque or the East Mountains.    I have never seen anything like it and would like to know what I saw&#8230;",
    "distance": 523.7083435082181
  },
  {
    "date_time": "11/9/2012 23:00",
    "shape": "Flash",
    "duration": null,
    "city": "Albuquerque",
    "state": " NM",
    "latitude": 35.09914887,
    "longitude": -106.6094405,
    "comments": "Blue/Green streaming flash of light shooting towards and over the Sandia Mountains near Tramway.  Driving toward the Sandia Mt. on Tramway we saw a big flashing stream a blue green light much like a rocket firecracker only it was as high in the sky as the Sandia Mt. shooting toward and over the mountain.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 523.7083435082181
  },
  {
    "date_time": "11/7/2012 14:00",
    "shape": "Light",
    "duration": "20 minutes till who know",
    "city": "Albuquerque",
    "state": " NM",
    "latitude": 35.09914887,
    "longitude": -106.6094405,
    "comments": "A star, a planet?  Can't possibly be.  North of the Sandia mountains, red, blue, &amp; green lights constantly blinked &amp; the object stays in same spot.  I did not check this object later, but I am going to check again tomorrow.  My brother who wittnessed this with me says he sees this same blinking object where he resides in Placitas, NM.  He says that the object is not there all of the time.  How interesting.  I am wondering what this object could be?  What would flash/blink those kind of colors?  I always figured Stars had color &amp; twinkled, but not the way this object does. Wow, I wonder.",
    "distance": 523.7083435082181
  },
  {
    "date_time": "11/4/2012 12:00",
    "shape": "Unknown",
    "duration": "10 seconds",
    "city": "Albuquerque",
    "state": " NM",
    "latitude": 35.09914887,
    "longitude": -106.6094405,
    "comments": "I believe I saw a UFO today ...... small object, moving slowly at first, picked up speed, and then accelerated to a very high speed.  I posted this on Facebook this evening. 11-04-12 - Sunday.  Okay. So I was working in the backyard today (Sunday, Nov 4th, 2012) and stopped to take a break. This was around noon.  I was looking at the beautiful New Mexcio clear blue sky.  Looking directly north up at the sky at about 50 degrees, a white object appeared out of nowhwere.  It started off slowly and began moving in a straight line directly east towards the Sandia Mountains.  I couldn't gaug e how big the object was nor how high it was.  It appeared to be pretty high, object was small and appeared white.  As it moved east, it slowly picked up speed and then &amp;quot;whoosh!&amp;quot;, .... it went so fast it was gone in a heartbeat.  Now I consider myself a pretty level headed person.  I'm not big on conspiracy theories, contrail chemicals, government cover-ups, or .... UFOs.  But ..... I know what I saw. I live in Paradise Hills was was looking north when I saw this.  Question:  Did anyone else in the Albuquerque area see this?  No .. I wasn't drinking nor taking drugs.  And yes .. I was plenty hydrated.  My primary need is I would like to know if anyone else witnessed this??? Thanks.",
    "distance": 523.7083435082181
  },
  {
    "date_time": "11/3/2012 0:00",
    "shape": "Disk",
    "duration": "&lt;10 seconds",
    "city": "Albuquerque",
    "state": " NM",
    "latitude": 35.09914887,
    "longitude": -106.6094405,
    "comments": "green orb like ufo new mexico albuquerque 11/3/12  While driving on the freeway just entering albuquerque i saw a light to the left side on my dashboard window.    At first i thought it was a shooting star until in got closer.  It flew across my as i looked closer windshild at a constant speed. Not very fast, and not like any aircraft ive ever seem.  If almost seem to be hoovering yet wobbling.  It was glowing with a green orb like light and for it being so close it did not make a sound.",
    "distance": 523.7083435082181
  },
  {
    "date_time": "11/13/2012 17:30",
    "shape": null,
    "duration": "2 hours",
    "city": "Longmont",
    "state": " CO",
    "latitude": 40.16941928,
    "longitude": -105.1020196,
    "comments": "I saw 6-8 different orange lights  in the sky over Longmont and Boulder area, hold there position for extended period, then move slowly  I live up on a hill where I can see the lights of Longmont, I saw 3 orange lights holding there place, then as I and 2 other witnesses watched, they would flare up then I watched 2 move together, brighten up then move horizontally with the horizon apart from each other.  At times the lights would form loose triangles, then slowly move from side to side, going in and out of brightness.  I got some binoculars and looked at them.  They looked like bright orange lights.  I looked towards Boulder and saw 3 more, they held position for a while then started to move horizontally with the horizon.  I have been at this location for 7 years and am use to watching planes in the sky, and watch the sky quite often.  I have never seen anything like this before.  The lights were not too high from the horizon, 1000ft at the most.  There was a huge amount of air traffic also occurring during this time from the local small airport.  I went inside for a half hour then went back o! ut and they were still doing the same thing.  This all occurred over about 2 hours. I took a video with my phone, but it was very poor quality.",
    "distance": 525.400996833413
  },
  {
    "date_time": "11/7/2012 23:45",
    "shape": "Triangle",
    "duration": "5 seconds",
    "city": "Boulder",
    "state": " CO",
    "latitude": 40.08298568,
    "longitude": -105.2163447,
    "comments": "Boulder CO Triangle/Chevron Object  Having recently witnessed an orange fireball object on 11/3/12, I was a little reluctant to report this new sighting.  However I felt compelled because my sighting was very similiar to another report in Boulder this month.  I was walking my dog at the Howard Hueston dog park last evening when I spotted an object that appeared to be a triangle or chevron shaped object.  It was extremely difficult to see.  It appeared to have deep red tones on the body of the object, it may have also had about 4 very dim lights on the leading edge of the object.  The object was silent and appeared to be gliding in the sky.  The object was heading west, then turned at a 45 degree angle and headed to the north.  I lost sight of the object when it went into tree line.  It is also important to note that this park is very close to Glenwood Dr similiar location to the other Boulder triangle report.",
    "distance": 527.1509026406998
  },
  {
    "date_time": "11/7/2012 19:00",
    "shape": null,
    "duration": "2 minutes",
    "city": "Boulder",
    "state": " CO",
    "latitude": 40.08298568,
    "longitude": -105.2163447,
    "comments": "Triangle of 3 lights - 2 minutes visable  We were driving on 75th st from Arapahoe heading North to our house in Heatherwood neighborhood.  Noticed 3 bright lights in the shape of a triangle that stood still in the sky.   One of the lights then grew much brighter than the other two.  The top light then shifted upwards diagonally towards the southeast and took off.  The other two followed suit.  Lasted apporx. 2mins  What followed seemed to be a TON of planes that were almost searching for the thing.   We must have watched 8 different things fly over our house back and forth and they sounded like planes.",
    "distance": 527.1509026406998
  },
  {
    "date_time": "11/6/2012 18:00",
    "shape": "Light",
    "duration": "1-2 minutes",
    "city": "Boulder",
    "state": " CO",
    "latitude": 40.08298568,
    "longitude": -105.2163447,
    "comments": "4 orange lights hovering above/near Rocky Flats former nuclear weapons plant  On November 6, 2012, at approximately 6pm MDT, after voting at Centennial Middle School, my wife and I were walking back to our home in north Boulder.  At the intersection of 19th and Norwood, which is located at the top of a steep hill that faces south, we observed 4 bright lights near the southern horizon.  The lights were located on a bearing just east of south, probably about 170 degrees.  They were all the same brightness, evenly spaced, and resembled sodium vapor street lights; they were orange in color.  They were no more than 5 degrees above the horizon from our vantage point. The lights were stationary during the minute or so that we viewed them.  My wife is an adamant skeptic regarding UFOs.  Nonetheless, she readily admitted these lights looked &amp;quot;weird&amp;quot;.  My wife and I both have bachelor's degrees in physics and we have both studied astronomy at the university level, including considerable observational experience.  Neither of us thought these lights looked &amp;quot;normal&amp;quot;.  I have a private pilot's license and I am familiar with the location and traffic patterns of all airports in the vicinity of Boulder.  Our line-of-sight to the unknown lights passed near the traffic pattern for the Rocky Mountain Regional Airport (RMRA) (formerly the Jefferson County Airport or &amp;quot;Jeffco&amp;quot;).  However I do not think these were conventional aircraft landing lights because  1) they were distinctly orange and not white;  2)  because normally we do not see landing lights from aircraft in the pattern at RMRA since the downwind leg for runway 29 R&amp;L points *away* from Boulder;  3) because there were *4* of them, all identical, evenly spaced, and they did not change their appearance at all during the minute or so we were observing them.  Normally, conventional aircraft landing lights only take on an unusually bright appearance (such as we observed) when they happen to be pointed directly at the observer, a condition that normally happens for only a few seconds when an aircraft is maneuvering in the pattern.  I was unable to imagine any plausible arrangement of conventional aircraft in the landing pattern that would produce the display of lights we observed.  In addition I should mention that the line-of-sight from us to the unknown lights passed more or less directly over the former Rocky Flats nuclear weapons facility.  The lights (if taken to be similar in brightness to aircraft landing lights) looked as though they were located right over the former nuclear facility.  Although Rocky Flats has not been used for nuclear weapon production in many years, the author is aware that UFOs are often sighted near sensitive military installations, and thus thought that this detail should be included in this report.  I was conflicted about whether to file this report or not, since we do have a large amount of conventional air traffic in our area at nearly all times, and therefore it is conceivable that what we saw was an unusual configuration of conventional aircraft.  However I decided to submit this report because I have thought about this sighting a number of times since it happened and I really am at a loss to explain those lights in a conventional manner.  Also, I reasoned that perhaps others saw these lights and may have already reported them, or, if not, perhaps my report will catalyze others into coming forward with corroborating information.  As far as I know there has been no mention in the local media about such lights, but I did not do a thorough search to confirm this.",
    "distance": 527.1509026406998
  },
  {
    "date_time": "11/4/2012 19:30",
    "shape": "Triangle",
    "duration": "10 seconds",
    "city": "Boulder",
    "state": " CO",
    "latitude": 40.08298568,
    "longitude": -105.2163447,
    "comments": "it moved fast and not easy to see ..  I went outside and was looking at the stars when something past over head.  It was a rough V shape brownish sort of like it was cloaked.  And moved north to south and moved about 25 to 30 degrees in like 4 or 5 seconds.    My location is boulder Colorado.  Glenwood dry it made no sound... there where no lights the only way I saw it was it passed over a star &#8230;   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 527.1509026406998
  },
  {
    "date_time": "11/4/2012 1:30",
    "shape": "Fireball",
    "duration": "3 seconds",
    "city": "Boulder",
    "state": " CO",
    "latitude": 40.08298568,
    "longitude": -105.2163447,
    "comments": "Boulder CO Fireball  I was outside on my deck looked up to witness an orange fireball.    It was descending, heading from west to east.   The object was silent.   ((NUFORC Note:  We spoke via telephone with this witness, and we found him to be unusually eloquent and sober-minded in his description of the event.  We suspect that the correct time should read 00:44 hrs., but we cannot be certain.  PD))",
    "distance": 527.1509026406998
  },
  {
    "date_time": "11/3/2012 20:00",
    "shape": "Oval",
    "duration": "20",
    "city": "Cedar Rapids",
    "state": " IA",
    "latitude": 41.97695199,
    "longitude": -91.677172,
    "comments": "I had just gotten off my computer giving a testimony in the name of jesus christ, to someone who needed it was on the wrong path.  I went got in my car and two objects were hoovering in the sky on top of my car they followed me from my house down to walmart on edgewood road, then to the guppys on the go on edgewood,    I rolled down my window to make sure i was not seeing things, i wasnt they were hoovering high but directly over my car they were moving fast they were yellow light balls, moving fast and almost blinking, hovering over my car, moving so fast I knew they were following me. i was very scared i got back in my car and i went to the caseys on collins they followed me there, then i kept driving and they eventually disappeared.  I then wen home to call my father and i felt as though they were hovering over my house although i did not see them..... My phone was rejecting calls to my father which my dad has never nor never wold restrict my calls, there was t! remendous scrambling on the phone.  It rejected my phone call to him about 9 times. then i woudl get phone calls and i would answer and it would be all scrambly. I KNOW FOR A FACT WHATEVER I SEEN WAS DOIGN THIS.    I did eventually call my dad on that phone and he was no longer rejecting my phone calls. It seemed as though it was something different every time one time it would be rejected and another time it was no longer in service, which my father has an answering machine.  I truly believe  whatever i seen was of a demonic force and was very upset to my testimony of Jesus Christ.  I do know in the book of ezikel there are these objects seen by him as well.  I am not sure if this was demonic or of something of that manner. I know i seen what i saw i always thought ufos were fake.  THEY INDEED ARE NOT.  i believe whatever it is can watch things. this happened after a testimony on facebook and rember about my phone line. whatever they are have the power of technology.",
    "distance": 532.082130325315
  },
  {
    "date_time": "11/3/2012 22:00",
    "shape": "Triangle",
    "duration": "3-5 minutes",
    "city": "Mount Vernon",
    "state": " IA",
    "latitude": 41.92460152,
    "longitude": -91.42415134,
    "comments": "My husband and I witnessed a large, very bright, amber colored light appear suddenly in the eastern sky. After hovering for a few moments at a curiously low altitude, it began rapidly flying toward us.  The object grew intensely brighter as it moved closer. It flew directly over us and toward the western horizon.  As it flew over us, we thought we were able to make out a dark, triangle shape craft, but the lights on the craft were so intensely bright, that it was difficult to tell for certain. The bright amber colored light that we had initially seen in the distance  was at its &quot;tail&quot; a smaller red light at it's &quot;nose,&quot; and two extremely bright, white, flashing strobe like lights on its &quot;wings.&quot;    It was large and flying at an unusually low altitude. It was not silent, but oddly quiet for how low it appeared to be flying. I don't know that I can even describe what it sounded like.    We watch planes fly over toward the Eastern Iowa Airport on a nightly basis.    This looked and sounded like no plane I have ever seen.",
    "distance": 537.1212203059129
  },
  {
    "date_time": "11/12/2012 20:00",
    "shape": "Circle",
    "duration": null,
    "city": "Folsom",
    "state": " LA",
    "latitude": 30.63172331,
    "longitude": -90.19503146,
    "comments": "Gold/yellowish light stops by what might be ufo then I see a circular object fly by with green and red lights  Around 8 pm we walked outside to see something far off in the distance.  When I grabbed the binoculars I seen something that was blinking green...red...orange...then repeats.  I don't know what that was but then 5 mins later a gold, yellowish ball shot out randomly from the sky and went next to what we thought was a UFO blinking green red and orange...it sat next to it for about 5 seconds then started coming over towards my house.   When it came over my house I looked through the binoculars...I saw a circular object!   A green light on the front, a red light on the back and one green light on both sides of the object...then we ran to the front to see and it was too far away.  I got a picture but its too small.  My dad and sister thought it was a plane...but before that happened two planes flew over us and I know what a plane looks like.  This was a ball of a bold gold/yellowish light and it was pretty big...  And a plane doesn't stop in the air...it happen to stop rig! ht by what we thought was already a UFO...then when it took off the gold/yellow light was turned off and green and red lights were seen then.  And I don't know if those planes I saw were after the object because they were going the opposite direction but the planes came around 2 minutes before the ball of light",
    "distance": 539.4249462960443
  },
  {
    "date_time": "11/12/2012 20:00",
    "shape": "Triangle",
    "duration": "10-15 seconds",
    "city": "Fort Collins",
    "state": " CO",
    "latitude": 40.5693246,
    "longitude": -105.08670900000001,
    "comments": "A &amp;quot;V&amp;quot; formation of 5 faint solid lights flies over Fort Collins heading west.  A triangle of five lights in &#8220;V&#8221; formation flew directly over Fort Collins, moving from east to west across the sky, around 8:00pm on November 12th, 2012.  The five lights were in a &#8220;V&#8221; formation of faint white light that were glowing solid as it moved across the night sky.    No sound could be heard coming from this object and the lights were not flashing as seen on any other identifiable aircraft in the air at night.    It moved quickly at a constant speed flying from the east, heading west.  I tracked it for about 10-15 seconds before I lost it beyond the haze in the western sky.",
    "distance": 540.6576664862695
  },
  {
    "date_time": "11/8/2012 22:30",
    "shape": "Fireball",
    "duration": "2 seconds",
    "city": "Fort Collins",
    "state": " CO",
    "latitude": 40.5693246,
    "longitude": -105.08670900000001,
    "comments": "Neon Green Flash Crashes South of Fort Collins  I was driving south on US-287 just south of Fort Collins around 22:30 MST and I noticed a green light flash across the sky slightly east of my direction of travel for aprox. 2 seconds.    The light had a trajectory similar to a meteor burning up in the atmosphere, but was a distinctly neon green color and was substantially larger.    My first thought was some sort of firework that ignited late, but its speed was also similar to something crashing to Earth.    The direction of travel was from East to West and looked to intersect my southbound direction of travel.  I, however, saw no signs after the flash indicating what happened.    The shape of the light I would describe as similar to the booster rocket assemblies used for Discovery and other spacecraft, except traveling in reverse.    I heard no noise (my car has substantial engine noise), smelled nothing other than my heater (it was cold), and felt nothing   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 540.6576664862695
  },
  {
    "date_time": "11/6/2012 23:30",
    "shape": "Circle",
    "duration": null,
    "city": "Fort Collins",
    "state": " CO",
    "latitude": 40.5693246,
    "longitude": -105.08670900000001,
    "comments": "Circle, multi color, zig and zag but stayed in the same area of the sky.  This was a circle craft with multi colors.  It stayed in the same area for the sky but would zig and zag every once in a while.  Took a photo but just got the sphere shape.  It didn't show the details that we show in the telescope (blinking lights and a circle craft).   We watch if for an hour.  It never left that area of the sky.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 540.6576664862695
  },
  {
    "date_time": "11/6/2012 20:35",
    "shape": "Unknown",
    "duration": "2 minutes",
    "city": "Evansdale",
    "state": " IA",
    "latitude": 42.46819202,
    "longitude": -92.28375298,
    "comments": "Slow moving object with numerous large lights all synchronized (Honey Comb in shape), travels over interstate  Final  Around 8:35pm I was traveling south on the interstate a few miles south of Evansdale Iowa. The sky was 100% cloudy, with rain from time to time. Stars and the moon were not visible due to the storm clouds covering the area.  As I traveled south a bright colorful light (blue, green mostly) began to flash within the clouds making the surrounding clouds light up with different colors. I thought this very strange and kept watching as suddenly I could clearly make out several round lights begin to take form from within the clouds.  Like the sun shining through thick clouds during the day, theses lights seemed to be the same size, giving the illusion that it was no higher up than a water tower, but I knew from the foggy mist overlapping the lights that the object was higher up. The lights were now solid and the pulsing flash had stopped.  Theses lights were perfectly spaced from one another giving me the idea that they were apart of one solid object. I could not make out the shape d! ue to the object clearly being deep within the clouds above but the lights were so bright that they shined through with no problem.  The object was moving incredible slow about the same speed as you would see a flock of geese travel.  I quickly decided to pull over and try to video tape it with my phone. As I got out the object was moving slowly over me heading west, for as low as it seemed to be the object put off no sound.  The lights were now  brightly white and were round in shape.  As I watched the object travel above, it presented itself to me with a natural flow, like it belonged in the sky.  I began to try and film the object but my phone could not focus on the lights or anything else in the dark.  The object then began to disappear in some thicker clouds and the lights began to fade away until I could not see them anymore. I stood on the side of the road for 30 more seconds and the pulses began to appear again but further in the distance.    (Lights formed a honey comb shape with another light in the center)    First draft i tried to make honey comb shape but after i sent it the shape then turned into a line. the object was a honey comb, pentagon shape.",
    "distance": 542.763996577859
  },
  {
    "date_time": "11/3/2012 8:30",
    "shape": "Cigar",
    "duration": "90 seconds",
    "city": "Corpus Christi",
    "state": " TX",
    "latitude": 27.77512953,
    "longitude": -97.46483795,
    "comments": "Saw a shiny white  bullet/cigar shape odject in the sky at a steady speed for a minute and half  Saturday November 3rd 2012 @ 8:30am central time in corpus christi texas.  The sky was very clear with no clouds. (light Blue Sky)  The bullet/Cigar shape with no wings was solid shinny white in color and came from the south and headed to the north over corpus christi texas at a straight and steady speed.  It left no white trail and eventually it disappearded far from my sight.   ((NUFORC Note:  Witness elects to remain totally anonymous.  PD))",
    "distance": 544.7636827649383
  },
  {
    "date_time": "11/6/2012 17:45",
    "shape": "Light",
    "duration": "5 seconds",
    "city": "Sioux Falls",
    "state": " SD",
    "latitude": 43.55312917,
    "longitude": -96.73157888,
    "comments": "bright rapid moving light  Ending a cell phone call and getting out of my truck a light streaking from the North East horizon traveling West at  VERY high rate of speed caught my eye.  I saw the object as it reflected the suns light and it disappeared in the South Western horizon.     It was moving extremely fast, and left no tail like a shooting star, comet or object entering the atmosphere.   I can't explain in words how fast this object traveled from one horizon to the other and was gone.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 546.4528518737756
  },
  {
    "date_time": "11/17/2012 23:00",
    "shape": "Diamond",
    "duration": "5 minutes",
    "city": "Peoria",
    "state": " IL",
    "latitude": 40.75990107,
    "longitude": -89.63170112,
    "comments": "Pattern of orange/red round objects seen over Peoria, IL at about 11:00 PM on 11/17/12  On November 17, 2012, at approximately 2300 hrs, my wife and I exited our apartment in Peoria, IL to take our dog out for a short walk.  Shortly after I stepped outside, I observed several (approximately 5 or 6) orange or red round objects in the sky to the north of our apartment.  For purposes of orientation, I can say that the objects were visible north of the intersection of Allen Rd. and Willow Knolls Rd. over that area&#8217;s car dealerships (Lexus, Toyota, Nissan).  The objects were in some sort of pattern, possibly a diamond shape.  At first I thought the pattern looked like a fireworks display of some sort, but I heard no explosions.  In fact, I did not hear any noise at all coming from the area.  I pointed the objects out to my wife and she began trying to take photos and video with my cellular phone.  Unfortunately, upon review of the video, the objects were not visible.  We also saw a male exit a vehicle up the road (unknown how many passengers we! re in the car) from our apartment to look at the objects, but we did not speak to each other.  As we continued to observe the objects in the sky, we noticed that some of the objects would suddenly fade away.  However, we also saw new orange/red round objects rising up from the ground in the same area north of our apartment.  While they were ascending, I noticed that the objects hovered in a manner that was somewhat similar to helicopters. But, I have never seen helicopters move quite like this and I can&#8217;t imagine why helicopters would be forming patterns in the sky at night.  The rising objects then joined the other objects before they also vanished.  By about 2305 hrs, all of the objects were gone.",
    "distance": 546.6059445983649
  },
  {
    "date_time": "11/17/2012 23:00",
    "shape": "Sphere",
    "duration": "5 minutes",
    "city": "Peoria",
    "state": " IL",
    "latitude": 40.75990107,
    "longitude": -89.63170112,
    "comments": "Red Orange spheres seen in Peoria Il  My husband and I were out to take our dog for her last potty break of the night at 11:00 pm when he pointed out a strange arrangement of lights north of us.  The lights were red and orange in color and brighter than any star in the sky.  The sky was clear and the stars were visible and the lights I saw were not stars or Chinese lanterns.  The lights were arranged forming a round x, five for each curved line, then more lights, four that I was able to spot.  I probably missed a few because I was trying to record it with a cell phone camera that did not capture a thing.  The four lights seemed to launch from below and join the moving x, then all the lights that were forming the curved x disappeared. After that, only three were left that just moved upward north and vanished into the sky.  This beautiful occurrence lasted only 5 min.",
    "distance": 546.6059445983649
  },
  {
    "date_time": "11/8/2012 23:21",
    "shape": "Disk",
    "duration": "45 seconds",
    "city": "Bogalusa",
    "state": " LA",
    "latitude": 30.78312469,
    "longitude": -89.86343625,
    "comments": "Craft emits no light or sound flys over just able to see reflection and blacked out stars as it passed  I happened to walk outside around 11 at night to let the dogs out and on my way in around 20 min later I noticed what looked like a dim reflection of a flying craft that was within 500 ft of the ground.  The craft then I could tell was indeed round and was blocking out the stars as it passed heading north to south at a slow speed making no noise and emitting no light but a reflection on the leading edge as it neared the southern edge of town near bens ford wildlife management area it took off at an extreme rate of speed with no sound",
    "distance": 547.4451447007526
  },
  {
    "date_time": "11/8/2012 23:00",
    "shape": "Light",
    "duration": "1 second",
    "city": "Scotts Bluff",
    "state": " NE",
    "latitude": 41.87002141,
    "longitude": -103.6597346,
    "comments": "green beam of light west to east  around eleven I was driving south down ave b in Scotts bluff. I had my wife and kids in the car the kids were sleeping and my wife was awake I seen a bright green beam of light.  Fall from the sky I wouldn't really say it was falling I guess.this is hard to describe.  It was like a giant green neon tube that shot down towards earth it did not hit earth it disappeared before it could it wasn't a meteor or nothing because it appeared and disappeared so fast like a blink of an eye the tail end lit up the clouds behind it yet it was like a huge green tube it wasn't too close to me because I could see antennas blinking red that were closer to me it was more outside of gering towards the wildcat hills and missile bases are out there.  I don't know what I seen but I got shivers and was totally freaked out.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 547.6701597403538
  },
  {
    "date_time": "11/13/2012 22:00",
    "shape": "Circle",
    "duration": "hour",
    "city": "Mussel Shoals",
    "state": " AL",
    "latitude": 34.75491955,
    "longitude": -87.64860661,
    "comments": "Round, flashing lights hovering in the same spot 2 nights in a row.  Located under Orion's Belt.  Seen 2 nights in a row.  Flashing red and white/blue light.  After 30 minutes I could see the object move a short distance and hover. Moving up and down and in circles.  Both nights there was what looked to be a shooting star directly underneath the object.  Both nights it showed up on the same spot and moved in the same direction.   ((NUFORC Note:  Possible sighting of Sirius.  PD))",
    "distance": 550.2248400503828
  },
  {
    "date_time": "11/2/2012 21:00",
    "shape": "Triangle",
    "duration": "10 minutes",
    "city": "Estherville",
    "state": " IA",
    "latitude": 43.3946832,
    "longitude": -94.83241732,
    "comments": "Orange lights in triangle formation over Emmet County, Iowa on 11/2/12.  Three bright orange lights in upside down triangle formation seen in western sky. Bottom light disappeared after approx. 5 minutes, the other two disappeared approx 5 mins later.",
    "distance": 550.88199226672
  },
  {
    "date_time": "11/10/2012 17:50",
    "shape": "Circle",
    "duration": "1 minute",
    "city": "Eldridge",
    "state": " IA",
    "latitude": 41.64459396,
    "longitude": -90.57813034,
    "comments": "Bright orange/yellow with red trim circular fast moving quiet light.  Coming fast from the south, we saw a bright round orange/yellowish light with an outer red light all the way around it.  There weren't any blinking lights like a plane.   It was moving very fast and made no sounds which was odd because it appeared somewhat close to us or at least it seemed like it in the night sky.   It continued moving straight north and then jUSt seemed to disappear.",
    "distance": 551.0407876013576
  },
  {
    "date_time": "10/30/2012 17:45",
    "shape": "Circle",
    "duration": "3 minutes",
    "city": "Franklin",
    "state": " TN",
    "latitude": 35.90672112,
    "longitude": -86.85985067,
    "comments": "Driving home I saw a very bright slow moving object going from east to west - not a plane,  I thought it was like a shooting start but it was moving to slow, and was very bright for 5:45 PM.   Not sure what it was and can not find anything anywhere on it.  There was an aircraft looking to be on approach to BNA that was north of the object neither seamed to react to each other.",
    "distance": 587.1801182320129
  },
  {
    "date_time": "11/10/2012 20:32",
    "shape": "Changing",
    "duration": "3-4 minutes",
    "city": "Cut Off",
    "state": " LA",
    "latitude": 29.51891068,
    "longitude": -90.32462271,
    "comments": "Low-flying, shape-changing aircraft seen in a small Southern Louisiana town.  My mother, aunt, cousin, boyfriend and I were driving up my street earlier to go to a fair.  My mom, who is a skeptic on such things, stops the car when she sees a low-flying craft right nearby.  It was dark, so we couldn't see much except for changing, flashing lights.   The lights came from different areas of the craft, and it looked a bit like a trapezoid, but then seemed to change shape.   Getting out of the car, there was a quiet drone unlike anything I've heard before.   Soon it started flying away at incredible speed.  That's the second UFO I see close to my home, and to think so live in a town so small, most maps don't even recognize it.",
    "distance": 588.3409649959522
  },
  {
    "date_time": "10/30/2012 17:00",
    "shape": "Unknown",
    "duration": "several minutes",
    "city": "Nashville",
    "state": " TN",
    "latitude": 36.21362309,
    "longitude": -86.78348894,
    "comments": "4 objects not visible to the naked eye, flying around odd vertical  &quot;rainbow.&quot;  Driving home at 5pm headed towards the city from Elm Hill and 40-W I saw a small vertical rainbow in the sky.  I pulled over to take a few pictures, since the vertical sliver of rainbow was something I had never seen.  When looking at the camera screen I noticed 4 objects flying around the&amp;quot; rainbow&amp;quot;.  I looked without using the camera and could not see the objects with the naked eye.  I once again looked at the screen and the objects were still moving around the &quot;rainbow.&quot;  I did this several times with the same result.  I cleaned my lens, as well as checked my camera by taking photos of other things in the area.  This was not a dirty lens.  The objects could be disc shaped but it is hard to tell.  I have a series of photos.",
    "distance": 591.299417756429
  },
  {
    "date_time": "10/30/2012 6:15",
    "shape": "Fireball",
    "duration": "5 minutes",
    "city": "Nashville",
    "state": " TN",
    "latitude": 36.21362309,
    "longitude": -86.78348894,
    "comments": "Huge bright object the size of a house slowly traveling across sky.  I was traveling towards Hermitage from Donelson and saw a huge ball of bright light the size of a house traveling at a slow steady pace.    I cannot figure out what this could have been could not have been a meteor it was traveling too slow.    I considered myself a skeptic about UFOs until now.  Very scary object.",
    "distance": 591.299417756429
  },
  {
    "date_time": "10/30/2012 6:10",
    "shape": "Circle",
    "duration": "5 seconds",
    "city": "Nashville",
    "state": " TN",
    "latitude": 36.21362309,
    "longitude": -86.78348894,
    "comments": "WE SAW A GREEN BALL SHAPE FALLING OUT OF THE SKY AT 6:10 AM ON TUESDAY OCTOBER 30TH 2012.  IT WAS VERY LARGE BUT WAS GONE IN 5 OR 10 SECONDS.  I WAS ON MY WAY TO WORK ON I-40 TO NASHVILLE, TN, COMING FROM HERMITAGE TN..",
    "distance": 591.299417756429
  },
  {
    "date_time": "10/27/2012 22:00",
    "shape": "Other",
    "duration": "60 seconds",
    "city": "Nashville",
    "state": " TN",
    "latitude": 36.21362309,
    "longitude": -86.78348894,
    "comments": "White light on small lunar lander shaped object  UFO Sighting I was driving north on second ave. Downtown Nashville TN. While stopped at a traffic light on the corner of 2nd ave.  And Korean veterans pkwy.  I saw a white light coming towards me traveling in a southwestern direction.  At first i thought it was an airplane but then i noticed it was lower than it seemed.  There was a tall building in front of me and i thought since it was of normal airplane altitude, it would go behind the building, but it went in front of the building. S o then i knew it was quite a bit lower than it seemed.  Maybe 100 feet off the ground.  I was able to get a pretty good look at it considering it was quite low.  It looked like a very small lunar lander, maybe 3 to 4 feet across.  It seemed to have very stable flight, very smooth.  Ruling out a flying toy or something like that.  It was traveling at about 30 to 40 MPH.  The street light turned green and i started moving while continuing to watch it as it moved passed me still traveling in a southwestern direction.   I then stopped at the next light and looked for it again and found it on the same path but climbing higher.",
    "distance": 591.299417756429
  },
  {
    "date_time": "11/8/2012 20:00",
    "shape": "Circle",
    "duration": "1 minute",
    "city": "Gulfport (near)",
    "state": " MS",
    "latitude": 30.435995000000002,
    "longitude": -89.05639642,
    "comments": "Circular aircraft casting green spiral light flying north from the gulf.  Driving on the I-10 east near the canal st exit, a circular strobing green light roughly 40 feet in diameter passed over the road.  The aircraft was moving perpendicularly to the road.  As it passed over the road the circular light strobed over the whole highway 2-3 times.    We then looked up toward the sky we saw a circular aircraft flying at an altitude of about 100-150 feet northbound.  Very hard to describe the light, but it was very bright, when we then discussed it afterward, we both drew the exact same picture.    This light had a very particular shape and pattern to it that was clear to both of us.",
    "distance": 599.7251892504778
  },
  {
    "date_time": "11/7/2012 11:30",
    "shape": "Changing",
    "duration": "10 minutes",
    "city": "Gulfport (near)",
    "state": " MS",
    "latitude": 30.435995000000002,
    "longitude": -89.05639642,
    "comments": "11:30am in gulfport,  MS cigar shape craft broke into two ships lasted 15 mins a plane couldnt land circled 3xs    I noticed a reg.plane circling and can't land.went into circles three times on hwy 49 in the back was a white sigcare shape going right then went left then broke off Into two shapes kept looking then they disappeared and noticed the plane had to Go towards biloxi from gulfport to keesler airforce base.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 599.7251892504778
  },
  {
    "date_time": "10/30/2012 15:00",
    "shape": "Circle",
    "duration": "unknown",
    "city": "Cullman",
    "state": " AL",
    "latitude": 34.17660902,
    "longitude": -86.82329734,
    "comments": "white circle, looked like it may have something on the bottom maybe an &quot;X,&quot; can't tell from pictures  Taking pictures of the rainbow effect seen yesterday around the sun, later when zooming in to look at the rainbow noticed the circle... took 4 pictures (three around the same time and 1 about 3 hours later) noticed that it was in all 4 shots in different areas (even the first three that were taken anywhere from 1 to 3 minutes apart the circle shows up in different areas).",
    "distance": 604.0297682369453
  },
  {
    "date_time": "11/18/2012 19:52",
    "shape": "Formation",
    "duration": "2 minutes",
    "city": "Terre Haute",
    "state": " IN",
    "latitude": 39.54301804,
    "longitude": -87.36046929999999,
    "comments": "Nearly invisible object flying in the sky.  I was standing outside looking up into the sky when I noticed a very faint object. At first I thought it was just a flock of birds but noticed it was much higher and there was no sound. It was heading south and was barely noticeable.  There were no lights and no sound.  It looked like 7 objects flying in a perfect &amp;quot;v&amp;quot; formation because the objects were faint enought to see but nothing else was visible.",
    "distance": 607.993232430531
  },
  {
    "date_time": "11/13/2012 18:00",
    "shape": "Unknown",
    "duration": "1-3 minutes",
    "city": "Danville",
    "state": " IL",
    "latitude": 40.1349179,
    "longitude": -87.61814150000001,
    "comments": "My Son reported to me that they saw something with a bluish light, zig zagging across the sky, they described it as a looking like a worm i was thinkimg like contrails or something, approximatley an hour later we heard numerous helicopters around our home",
    "distance": 612.996414533768
  },
  {
    "date_time": "11/18/2012 6:40",
    "shape": "Unknown",
    "duration": "30 seconds",
    "city": "Birmingham",
    "state": " AL",
    "latitude": 33.54944719,
    "longitude": -86.79825125,
    "comments": "Fast Light Moving  a bright light moving extremely fast over the red mountain express, with a tail of fire, lasted about 5 secs and the light went out.",
    "distance": 616.4120409090074
  },
  {
    "date_time": "11/13/2012 5:37",
    "shape": "Egg",
    "duration": "2-3 minutes",
    "city": "Birmingham",
    "state": " AL",
    "latitude": 33.54944719,
    "longitude": -86.79825125,
    "comments": "metallic object rolling across morning sky  Walking to my car this morning, I looked up into the sky and looked at a pair of stars for a moment.    All of the sudden a spherical/oval - metallic object (almost looked like it had a line down the middle) was moving past the first star, almost as if it was &amp;quot;rolling&amp;quot;.  Object continued moving past second star and over my head.  All I could do was stand there with my jaw dropped.  Checked satellite trackers and the only one that came through the area thirty five minutes prior - lasting for a duration of 5 minutes.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
    "distance": 616.4120409090074
  },
  {
    "date_time": "11/11/2012 22:30",
    "shape": "Unknown",
    "duration": "unknown",
    "city": "Mancos",
    "state": " CO",
    "latitude": 37.34482018,
    "longitude": -108.292772,
    "comments": "Unidentified tracks near 5 households appear overnight  On the night of Sunday the 11th my neighbor noticed strange tracks in her driveway.  The following day she called me to know if I had seen anything strange. In my driveway I found a multitude of single line tracks in the gravel of my yard some of which came right up to my house.  We checked with our other neighbors and found that in total 5 households within a 1/2 mile had been &amp;quot;visited&amp;quot; by the same single tracked entity.  I called to find out if someone had surveyed our area recently but there are no human foot prints associated with the straight line tracks we have observed  (Some of these are in soft dirt and snow and there are no associated prints or tread marks within the tracks) which resemble a heavy ball rolling up and down hill.  These tracks are very smooth and some enter very small areas ( between fence posts and under downspouts) and move with precision.  We have pictures and maps of all the tracks we could find.",
    "distance": 619.2809177059336
  },
  {
    "date_time": "11/1/2012 21:00",
    "shape": "Triangle",
    "duration": "2 minutes",
    "city": "Oneonta",
    "state": " AL",
    "latitude": 33.95200796,
    "longitude": -86.47247545,
    "comments": "immediate u- turn. no noise.  I came out to let my dog use the bathroom and was walking with her to the back yard.  I looked up above the trees on the mountain behind the house and seen three rectangular lights in a triangle shadow moving slow with no noise at all.  It was coming straight at me but then did an immediate u-turn and slowly went back over the trees.  I knocked on the back door and had my wife come look at it and as soon as she seen it, it shot off very fast. It did make a sound like loud wind.",
    "distance": 627.1478407169036
  },
  {
    "date_time": "10/28/2012 16:00",
    "shape": "Circle",
    "duration": "2 minutes",
    "city": "Bourbonnais",
    "state": " IL",
    "latitude": 41.16326698,
    "longitude": -87.88296856,
    "comments": "metalic blue round object over bourbonnais, IL dashes out of sight in 3 seconds  My Fiancee and I were driving home to wisconsin on I57 north bound between Bradley, IL, and Bourbonnais, IL.    As I was driving the glare from the sun off of an round object in the sky caught my eye, I looked over at the object sitting north west over the bourbonnais area, it was Blue in color and it sat in the sky in the same place for about 30 seconds to a minute befor it moved north west at a unkown speed it had to be at least 15-20 miles if not more in 3 seconds, it became a white dot in the sky,   I couldn't believe how fast it had dashed away, when it had been sitting in the sky it appeared to be a metalic blue.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 637.0277080555412
  },
  {
    "date_time": "11/17/2012 20:30",
    "shape": "Oval",
    "duration": "20-30 seconds",
    "city": "Oswego",
    "state": " IL",
    "latitude": 41.69175843,
    "longitude": -88.33400628,
    "comments": "4 silent orange balls of light flying across field of view chasing each other at decent rate of speed and quite low above Oswego, IL.  I had just arrived home in Aurora, IL with my wife, mother-in-law and two girls right about 8:30 pm. It was already dark outside being that it was mid-November. We had groceries in the car that we had to unload them before my wife was to take her mother home in Naperville, IL.  So we all got out of the car, the girls went inside followed by the rest of us carrying the groceries. I came back outside by myself to get the rest of the groceries. As I walked down to the car that was parked in the middle of the driveway, I noticed an orange ball of light with blurry edges come to view on my left moving south to north in a perfectly straight line. It was moving at a pretty good speed and awfully low which is why I stayed fixated on it!  All of a sudden, a second identical ball of light showed up right behind it! By then, the first ball of light was right in front of me, but disappeared behind my neighbor&#8217;s house that was also in front of me. I then turned by attention to the 2nd ball of light that was following the first and I watched it as it began to move in front of me&#8230;.Just as I stayed transfixed on it, I noticed yet another ball of light pop up behind it that looked just like the first two and chasing the second ball of light. It was then that I knew that these were not planes! All I can say was that they were bright orange balls of light chasing one another. I then instantly realized that these were not planes! Planes simply do not behave like this; they do not chase each other in this manner or fly so low.   I then ran into the house through the garage and I frantically told my wife, who was in the kitchen, to come with me and to make it fast because I had to show her something before they disappeared. She was actually pretty startled by my sense of excitement. She came running out and I pointed out the two lights. By then, the 2nd ball of light had just began to peek out again from being out of view due to my neighbor&#8217;s house all while the 3rd ball of light was just about to be covered by my neighbor&#8217;s house.   Suddenly, we both then noticed that an identical 4th ball of light appeared flying in the same manner, path and height as the other 3 balls of lights that preceded it. All 4 objects looked identical, flew in the same speed and height all while following each other and were very low. They were so low that they should have made some noise, but they were perfectly silent. They made no sound whatsoever. They all appeared to by flying along US-30 which would put them over in Oswego, IL air space which is the direction I was facing. As all of the objects peeked out from behind my neighbor&#8217;s home, they changed their direction all heading west towards Oswego at which time they simply disappeared in the distance.   My wife and I were left dumbfounded by what we just witnessed. After the last light disappeared, we simply got the rest of the groceries and came back into the house. I was left intrigued by the whole experience and I began to look over the internet for any mentions of the same from other people in the area. Though I did not find any mentions of today&#8217;s sightings from other area people, I did stumble upon several internet sites, including this site, referencing similar/recent sightings of the same orange lights in Oswego, IL.",
    "distance": 639.3467457693635
  },
  {
    "date_time": "11/1/2012 20:00",
    "shape": "Formation",
    "duration": "5 minutes",
    "city": "Joliet",
    "state": " IL",
    "latitude": 41.58227539,
    "longitude": -88.14783061,
    "comments": "7 Orange-Red lights hovering over Joliet, IL  My husband and I were driving toward Joliet from Louis Joliet Mall on Route 30, when we noticed about 7 red glowing lights in the sky by Auto Zone and Denny&#8217;s.  It was about 8pm.  It was completely strange.  To the north, three were floating pretty evenly spaced from one another and a little further south were three more in a slight triangular formation with another below them.  We tried to follow them, but they were disappearing.  We followed one onto a side street and noticed that it was EXTREMELY low to the ground (about 3 electrical poles high).  As soon as we got out of the car, we saw it just fade out.  That was it.  They were not planes, they were not flashing, they were orange-red glowing lights moving and hovering slowly.  This lasted about 5-10 minutes.",
    "distance": 642.4374304006233
  },
  {
    "date_time": "11/18/2012 18:15",
    "shape": "Light",
    "duration": "3 minutes",
    "city": "Rockton",
    "state": " IL",
    "latitude": 42.451009899999995,
    "longitude": -89.058911,
    "comments": "Orange orbs above tollway  Driving south on I-90 about a mile south of Illinois tollway plaza 1 we saw 6 orange orbs in a definite rectangle pattern that seemed to be moving north following the highway.  There was another further south by itself.",
    "distance": 645.5202653337949
  },
  {
    "date_time": "11/11/2012 18:45",
    "shape": "Triangle",
    "duration": "2:00 minutes",
    "city": "Grand Junction",
    "state": " CO",
    "latitude": 39.07100311,
    "longitude": -108.5478064,
    "comments": "Night time. Large triangle w/3 lights sighted hovering 75 ft over ground. Banked and flew fast over city, lost altitude then vanished  Night time. Driving northward on Redlands Parkway. See bright white lights hovering over neighborhood.  Closed distance and observed three bright white lights in an equilateral triangle pattern and two smaller red blinking lights (one dead center, the other between two of the triangle points) hovering perfectly still about 75-100 ft above ground.  Could vaguely make out a the dark edges of the hull- also a perfect triangle.  Turned onto South Rim Drive to pursue but upon making my turn the craft banked and sped along the geologic ridge.  I think they were watching me.  Observed the craft fly south, then bank southeast, then bank again northwest and fly directly over the city at about 200 ft altitude.  Craft gradually lost altitude over St Mary's Hospital, then vanished.",
    "distance": 658.792757168835
  },
  {
    "date_time": "10/31/2012 20:00",
    "shape": "Circle",
    "duration": "2 minutes",
    "city": "Carpentersville",
    "state": " IL",
    "latitude": 42.11708726,
    "longitude": -88.27451407,
    "comments": "Illinois Sky bright orange round object of light. Drone or UFO?  Aprox 8:30 pm Wednesday evening I stepped out on the deck to grab some soda when I noticed a bright orange round object of light, moving slowly without any noise in the Northern sky.  It's outer edges brighter and almost flame like than the center. Traveling North to South it started to jump around in all directions as if trying to register  coordinates of some sort. With a large burst like streak, it traveled at an extreme rate towards airline flight path and as it traveled closer to one of the planes the illumination from the object suddenly dimmed to nothing.  The whole event lasted no longer than 2 min.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 660.0963235808863
  },
  {
    "date_time": "11/18/2012 17:00",
    "shape": "Fireball",
    "duration": "50 minutes",
    "city": "Worth",
    "state": " IL",
    "latitude": 41.69045945,
    "longitude": -87.79050934,
    "comments": "Fireballs appear out of nowhere and morph shapes as they hover away.  My fiance' and I went out to take a walk. We looked to the east and a few miles away we seen fireballs hovering, lining up in formations (triangles, straight lines), changing shape, and moving. We watched more and more appear out of nowhere.  A bright light would start to form into something bigger and bigger, red and orangish.  It would stand still then slowly move to the east. Every object basically did the same thing, line up, hover, and then proceed to the east, one after another.  They would move east, we lost them behind trees, and then just fade away into the sky as if they were planes in a distance with no navigation lights.  Every move they made seemed to be for a reason. After about 20 minutes of watching we decided to call the local Police.    An officer pulled up to us and watched for about 10 minutes and made comments such as, &quot;That's weird,&quot; and &quot;Maybe were under attack.&quot;  The officer pulled off in hopes of getting closer to the objec! ts.  We watched for another 20 minutes before the last one just sat there. We left in frusteration because we knew we would never find the real truth.  It became frusterating watching objects so close to you and where your loved ones live and having no control as to what can happen next.",
    "distance": 661.7386621104174
  },
  {
    "date_time": "11/18/2012 17:00",
    "shape": "Changing",
    "duration": "45 minutes",
    "city": "Worth",
    "state": " IL",
    "latitude": 41.69045945,
    "longitude": -87.79050934,
    "comments": "Fireballs turning into plane like objects  My fianc&eacute; and I were walking around on 116th and Harlem Ave and noticed 3 bright red/orange lights in the eastern sky, twice the size of large stars, in a triangle form, they slowly started moving away, got smaller, as small as a plane in the sky, then turned into what looked like planes because they had small flashing white and red lights, exactly how planes do in the sky, and flew Northeast.    Then smaller lights started appearing out of no where, and within 5 minutes went for smaller orange/red lights into these large lights hovering and would slowly move then stop and hover some more all while turning brighter and brighter and larger, almost like they were going to burst.  After getting extremely bright and large they would then get smaller and smaller and eventually turn into small plane lighting objects and fly northeast.  There were as many as 4-6 in the sky as once and when they changed and flew away more would come out of nowhere and repeat the cycle.    We're very active sky watchers and this was something we've never seen before so we called a non emergency number in Worth IL, and reported the sight to have possibly have someone else come and see them.  A police officer was able to come by, he didn't get out of the car but said he noticed them as he was turning into the lot we were in. His first thought was Chinese lanterns, however, I've seen lanterns before but there was no way they were lanterns because of the distance they were incomparions to the brightness, as well as the way they were flying, stopping and changing shape.  He finally just said he doesn't know then, and said it was weird, and that he was going to drive closer to the area.  After about 50 mins no more appearing and we left.  They made no sound, and the strangest part was how they turned into what one might think are airplanes in the sky after being so larger and bright, almost like fireballs in the sky, but turning into planes and flying away, and the only! reason I keep saying plane like object is because of the way ! they loo ked like when they got small and flew away, they had a small red blinking light like planes do with a constant small white light.",
    "distance": 661.7386621104174
  },
  {
    "date_time": "11/16/2012 18:00",
    "shape": "Light",
    "duration": "~30 minutes",
    "city": "Chaska",
    "state": " MN",
    "latitude": 44.82133175,
    "longitude": -93.60444909,
    "comments": "these  things hovered and moved north  I have no idea what the heck is going on in the western skys but tonite the light appeared in the sky still for a few minutes then drifted north.   Shortly 2 more lights appeared one above the other. Top one moved north minutes later lower oner moved north.   This continued for a very long time with 2 lights coming up in the west sky amd one at a time moving north/northwest.  This kept repeating for approx 30inutes or more.  Not the first time i have seen this but for sure the most crafts i have ever seen   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 662.8193113322056
  },
  {
    "date_time": "11/1/2012 20:20",
    "shape": "Circle",
    "duration": "25 minutes",
    "city": "Apple Valley",
    "state": " MN",
    "latitude": 44.75040698,
    "longitude": -93.20239316,
    "comments": "Large halo in the SW sky that was atleast 1/2 mile long and few thousand feet off the ground.  No other light was near it and then it just vanished.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 664.7835120382472
  },
  {
    "date_time": "11/4/2012 20:30",
    "shape": "Circle",
    "duration": "not sure",
    "city": "Burnsville",
    "state": " MN",
    "latitude": 44.7800658,
    "longitude": -93.27845609,
    "comments": "The Mothership and its Orb  I went to let my dog out in the back yard as I was waiting I noticed an orb in the sky which seemed to be circling the area of my back yard but it was way up in the sky.  At first I thought it might be the spotlight from Mystic Lake, but I was wrong because it wasn't a beam of light it was an orb.  I ran in the house to get my roomate to see and he said him and his friend seen the same thing a few nights ago.  Then he looked to the west and hovering just above the neighbors trees was a huge object which my roomate commented was the Mothership and thats exactly what it looked like.    The orb itself was a light white greenish color and round the &amp;quot;Mothership&amp;quot; had faded lights all around it and a green hue behind it.  I have never seen anything so spectacular in my life!    We watch for about 10 mins and the orb just kept circling and the &amp;quot;Mothership&amp;quot; just stayed hovering.  I went back out about an hour later and they were both gone---",
    "distance": 665.4106136521208
  },
  {
    "date_time": "11/7/2012 22:30",
    "shape": "Circle",
    "duration": "5 seconds",
    "city": "Richfield",
    "state": " MN",
    "latitude": 44.87800472,
    "longitude": -93.28226088,
    "comments": "Yellowish/Orange sphere traveling across the sky.  I was sitting in my boyfriend&#8217;s car staring up at the sky listening to him talk about something and then all of a sudden I saw this circular, orange/yellow, object moving across the sky.    It lasted about five seconds and it was not a shooting star and it left sort of a trail of light behind it.    I live it the city so it&#8217;s not dark enough to see stars or shooting stars, so it had to be something else.   My first thought was that it was an airplane or helicopter but it was moving across the sky way too quickly.",
    "distance": 671.7064535678529
  },
  {
    "date_time": "10/31/2012 2:15",
    "shape": "Oval",
    "duration": "45",
    "city": "Campbellsville",
    "state": " KY",
    "latitude": 37.35427177,
    "longitude": -85.34176426,
    "comments": "are we alone??  i have always been a skeptic about any kind of &quot;ufo&quot; discussions i thought only weak minded people believed in this stuff till 2:15am this morning i was up and my friend wanted to go out side to smoke so i went with her and as we was standin there i noticed up in the sky what i thought was a aircraft like a plane but it was way too high in the sky and i commented on that right off well my friend started lookin at the object with me and we both noticed the object started movein in a zig zag type movement then it would just stop well to the objects left was another object movein towards it we saw some kind of light more like a missle or something i quick little flash well the new object just disappeared..  the moon as we was lookin up was to our right well the object started movein right like towards the moon it went from goin dead ahead straight to zig zag then a complete stop to movein right when it got to the moon it was gone..now this shocked me so much that i felt like i needed to tel someone,,anyone about this i couldnt call the cops they would thought i was on drugs..now idk this could have been military some kind of new plane or something idk but i know what i saw i woudnt go out of my way to report this on here i hope someone understands what im sayin..i am not makein this up this has really freaked me and my friend out..what was this &quot;thing&quot;??   i think ill never know ..   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  Witness does not indicate a duration for the sighting, and we have no way to contact him/her.  PD))",
    "distance": 675.8725641079405
  },
  {
    "date_time": "11/16/2012 19:25",
    "shape": "Circle",
    "duration": "what i saw was just a few",
    "city": "Indianapolis (SE side)",
    "state": " IN",
    "latitude": 39.7977199,
    "longitude": -86.0889603,
    "comments": "Lights went out on something in the sky and as soon as the last light went out it literally disappeared before my eyes.  My buddy and I were on the highway heading to martinsville,IN, for drumline practice and we were in the middle of a funny conversation and I just glanced up and to the left a little of my wind shield and noticed a semi circle of about 6 orange lights.  As I thought &amp;quot;what the hell&amp;quot; each light went out one by one and my buddy noticed it by time there were one 2 lights left one. I think there were lights all the way around it but they already went out.  And I almost hit a car because I was so focused on it.  All of a sudden while I was looking at it,like 3 seconds after the last light went out it was just gone. That area in the sky wasn't as dark and there was no sogn of it anywhere.  my friend saw the exact same thing and we can't explain it.  I've never believed in anything like that until now and we told people about it and they all think we were tired or crazy but i know what we saw....I've ever seen something like that in my life and I can't explain it.",
    "distance": 677.2502515329222
  },
  {
    "date_time": "11/10/2012 19:00",
    "shape": "Other",
    "duration": "15 minutes",
    "city": "Chattanooga",
    "state": " TN",
    "latitude": 35.04537556,
    "longitude": -85.25562318,
    "comments": "400 foot long craft with half circle lights  a long sequence of lights attached to a craft approximately 400 feet wide with half circle shaped lights on bottom followed by 6 other smaller crafts throughout the area.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 681.6703838738412
  },
  {
    "date_time": "10/29/2012 23:15",
    "shape": "Teardrop",
    "duration": "few seconds",
    "city": "Chattanooga",
    "state": " TN",
    "latitude": 35.04537556,
    "longitude": -85.25562318,
    "comments": "I saw a blue teardrop object fall from the sky.  I was driving northbound on I-75 in Chattanooga, TN, when I saw a blue light in the shape of a tear drop fall out of the sky.  This light seemed darker on the outside and lighter on the inside.   I only saw the object for a few seconds and then the object disappeared.",
    "distance": 681.6703838738412
  },
  {
    "date_time": "11/18/2012 19:20",
    "shape": "Fireball",
    "duration": "2 minutes",
    "city": "Russell Springs",
    "state": " KY",
    "latitude": 37.04976149,
    "longitude": -85.07448448,
    "comments": "Orange fireball passes directly overhead in southern KY  At approximately 7:15pm on 11/18/12 we observed in the sky a ball of fire moving from the north to the south.  I came almost directly overhead maybe 800 to 1000 feet off the ground.    I first thought it was an airplane on fire as it was moving toward local airport.  As it came overhead you could see that there was no structure on fire but just this huge ball of fire moving silently through the sky.    As it went on to the south it appeared to veer to the right moving westward and continued until it went out of sight over the horizon.    This thing cast an immense glow and you could see the flames jumping and flickering.  You would expect to hear something as you would with any other craft passing overhead but it was silent.    My ex-wife who is an RN witnessed this also.  She spotted it first.  I am a college graduate and am mostly skeptical of any UFO reports.    This was truly unexplainable.",
    "distance": 688.5562970600331
  },
  {
    "date_time": "11/18/2012 17:45",
    "shape": "Disk",
    "duration": "2 minutes",
    "city": "Russell springs",
    "state": " KY",
    "latitude": 37.04976149,
    "longitude": -85.07448448,
    "comments": "Red flame saucer over Kentucky  It was red.A disc or saucer shape.  Spinning,was visible for around two minutes.  Picture was taken.  Only one.  Observer is completely sane.",
    "distance": 688.5562970600331
  },
  {
    "date_time": "11/16/2012 4:50",
    "shape": "Triangle",
    "duration": "15 minutes",
    "city": "Stillwater",
    "state": " MN",
    "latitude": 45.04947468,
    "longitude": -92.82941618,
    "comments": "Triangular craft with red lights surrounding an orange center hovering and then retreating over hwy 95  My husband and I were driving on Highway 95 towards our home in Stillwater after work. The sky was mostly clear and many stars were visible, despite the bright lights of the city below. Listening quietly to a talk radio show while my husband drove, I gazed out the passenger side window of the car, not looking at anything specific, just mindlessly observing our surroundings. I then noticed ahead of us and slightly to the right of the highway a particularly bright object in the sky. Though, as I stated, many stars were visible, at a certain point they became drowned out by the lights of civilization. The object that I saw was well below this line. It was also significantly brighter and larger than any of the stars I could see.  While still staring curiously at the object, I asked my husband, &#8220;What is that?&#8221; and pointed to it. He responded that he had noticed it as well and was wondering the same thing. Upon more focused observation, I could discern that it was triangular in shape, and had red lights surrounding its yellow-orange center.  It seemed to be in a fixed position hovering over the earth, but as we drove towards its general direction, we seemed to be getting closer to it.  I watched it for about 10 more minutes from the car window, and it continued to stay in the same place. We parked in a parking lot to watch it without the car moving. Then suddenly it seemed to jump back into space slightly. I saw the movement and then noticed that it was smaller and dimmer, as if it had retreated. From then on it continued to stay in its new position, hovering without movement. I took several photos with my cellphone camera, and though not the greatest quality, in one of them you can clearly see its shape and the red lights around the center.  I cannot say I know for sure what it was. I just know that I saw something out of the ordinary and I have photos to prove it.",
    "distance": 690.6260891960841
  },
  {
    "date_time": "11/7/2012 19:30",
    "shape": "Sphere",
    "duration": "15-20 seconds",
    "city": "Casper",
    "state": " WY",
    "latitude": 42.85699582,
    "longitude": -106.32169259999999,
    "comments": "Saw a green orb floating/flying object above me while driving.  I was driving in my car on 2nd street going to the west side of town right by Hobby Lobby, and I noticed above me to my left, above buildings, and the electricity cables,    I then thought maybe Flight for Life helicopter headed to the hospital when suddenly the green floating orb, just disappeared.",
    "distance": 690.990876161888
  },
  {
    "date_time": "11/3/2012 20:00",
    "shape": "Light",
    "duration": "10 seconds",
    "city": "Kenosha",
    "state": " WI",
    "latitude": 42.56907582,
    "longitude": -87.84127915,
    "comments": "looking into the sky and seen a white light that flashed three times but moving very very fast and disapeared. no sound heard",
    "distance": 697.0911562673501
  },
  {
    "date_time": "11/16/2012 12:45",
    "shape": "Unknown",
    "duration": "1 hour",
    "city": "Oconomowoc",
    "state": " WI",
    "latitude": 43.107180299999996,
    "longitude": -88.50341318,
    "comments": "A light sitting still in the sky that is constantly changing color.  Looks to be rotating   saucer. Was seeing some strange flashing around the area i was watching it.  It really looks to be rotating and changing colors.  Very odd   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 697.3414182581363
  },
  {
    "date_time": "11/14/2012 5:45",
    "shape": "Sphere",
    "duration": "0:02",
    "city": "La Porte",
    "state": " IN",
    "latitude": 41.60467941,
    "longitude": -86.71452113,
    "comments": "Bright light seen in sky  I went outside for a cigarette and noticed that there was a thin layer of clouds in the sky also noticing that the planet Venus was not visible but Jupiter was.  I then looked toward the North and almost directly above me and seen a very bright light shining through the clouds and moving very slowly to the East in a direct flight path.  While viewing this object it also seemed to elluminate a small portion of the cloud making an aura around it.  This told me that if it was not in the cloud it was very close to the top of the cloud close enough to make the object to appear larger.  The approximate time was 5:45 a.m. because I did not have my watch on or my phone with me and when I came back inside the time was 5:48 on my phone.  I had to have viewed this object for a little over 2 minutes until I could no longer see it.  This was not an airplane because the light remained visible from viewing the front as it came toward my location and remained bright as it p! assed my location then dimmed out from thickness of the cloud.   My phone is currently not active this month but available through email.",
    "distance": 704.455035546165
  },
  {
    "date_time": "11/8/2012 22:35",
    "shape": "Triangle",
    "duration": "unknown",
    "city": "Germantown",
    "state": " WI",
    "latitude": 43.24154685,
    "longitude": -88.12291994,
    "comments": "Triangular UFO  Object first thought to be a helicopter.  Hovered in one spot and contained 3 lights, one very bright white, a small blue and small red however it was in the shape of a triangle.    Area was mildly residential.  No large incidents in area where a helicopter would be nessasary.",
    "distance": 717.5589834478527
  },
  {
    "date_time": "11/13/2012 21:30",
    "shape": "Triangle",
    "duration": "2 minutes",
    "city": "West point",
    "state": " GA",
    "latitude": 32.8789041,
    "longitude": -85.16159516,
    "comments": "triangle shaped lights over KIA motors manufacturing Georgia  At 9:30 pm I was walking towards the building I work at, KIA motors manufacturing Georgia.  Above the building and off in the distance I saw a large object flying overhead.  All I could make out was seven lights forming a triangle.    The object was moving a little slower than the airplanes that I am accustomed to seeing.  The object moved in complete silence.  I followed the object through the sky until the parking lot lights made it impossible to see the object anymore.  The whole encounter lasted about one minute     After arriving in the building and discussing this with other employees I learned I was not the only one who saw something strange.  A co worker of mine said he saw what looked like two shooting stars chasing each other.   Another said he could here jets flying overhead but saw nothing.",
    "distance": 720.6455906664661
  },
  {
    "date_time": "11/13/2012 0:25",
    "shape": "Triangle",
    "duration": "45 minutes",
    "city": "Muncie/Yorktown",
    "state": " IN",
    "latitude": 40.20052023,
    "longitude": -85.38847749,
    "comments": "A friend and I we're driving down a country road shortly after mid night when I noticed a very bright star or planet that almost just appeared.  It was Orange in color and was very bright, we were in awe of its size and brightness.  As we were looking and trying to determine what it was it started to move very slowly and take a triangle shape with twinkling lights on each point of the triangle, the lights were almost pulsating.  The craft kept moving in a very slow, linear path that looked like it was coming directly towards us.  It passed just to our right and was only 1,500-2,000 feet in the air, as it came closer we quickly determined it wasn't any airplane or helicopter because it made no sound.  When the craft passed us we noticed 3 more with identicle shapes appear, they were also moving slowly and had the same linear path just spaced further apart.  As we watched the other crafts as they moved closer we noticed one craft that was almost directly infront of us drop a small, light-like object to the ground.  My friend and I were already kinda freaked out about seeing these objects and became almost scared when we saw one drop something to the ground.  These crafts continued their straight, slow paths and when they passed they just sorta disappeared.  We drive for another 5-10 minutes before arriving at our destination, when we arrived we continued to look in the eastern sky where these crafts were coming from and ended up seeing three more that went right over our heads.  We got very good looks at the ones that went right over our heads, they were definitely large black triangles with lights on each point and a few lights in the middle and along the edges.  They were moving very slow and had no sound until they were just past us, then we heard a very light propulsion-like engine sound.  All of these objects basically just appeared and were all uniform in size, shape, and color, but their lights differed in slight color and patterns of the pulsations.  My friend and I are just a couple regular, football loving, family guys and neither one of us have ever seen anything that compares to what we saw this night.  After seeing these objects we tried to come up with logical explanations as to what these things were and we came up with nothing.  Neither of us are aviation experts, but due to the size, altitude, sound, and light configurations we were both very confident these objects were not planes or helicopters or weather ballons.",
    "distance": 721.9927813509504
  },
  {
    "date_time": "11/17/2012 19:13",
    "shape": "Fireball",
    "duration": "9 minutes",
    "city": "Cedarburg",
    "state": " WI",
    "latitude": 43.29713644,
    "longitude": -87.98934795,
    "comments": "8 red/orange fireball objects, evenly spaced  We saw (8) evenly spaced fireball-like objects, traveling at an absolutely even pace...a group of three gathered at the &amp;quot;end point&amp;quot; of where we saw them, and vanished.  They were all identical.  Red, orange, sphere-like &quot;torch end&quot; in appearance, and after the first 3 to 4, we could actually count when the next one would appear...and then they stopped.  They seemed to be going slow, and appeared to be in &quot;our{ atmosphere, not high in the sky, and totally silent.    We are husband and wife, we were in 2 different rooms, doing separate activities, wife got up and went outside for no apparent reason, called husband after counting the first 5, and he witnessed the last 3.",
    "distance": 725.071641591159
  },
  {
    "date_time": "11/17/2012 19:00",
    "shape": "Fireball",
    "duration": "20 minutes",
    "city": "Cedarburg",
    "state": " WI",
    "latitude": 43.29713644,
    "longitude": -87.98934795,
    "comments": "9 orange &amp;quot;fireballs&amp;quot; track across sky  7:00 PM My wife and I were standing on our deck when a strange very bright orange ball apppeared in the southern sky.  Soon several appeared following on the same track. The objects tracked from the southeast to the northwest flying directly over our location.  Each was in view for 1 to 2 minutes and there were 9 total.  The distance between them was relativly consistant as well as the speed.  They were at a low altitude no more than a few thousand feet and they made no sound.  Looking through the binoculars they looked like bright orange fireballs.",
    "distance": 725.071641591159
  },
  {
    "date_time": "11/13/2012 6:00",
    "shape": "Sphere",
    "duration": "60-70 seconds",
    "city": "Florence",
    "state": " KY",
    "latitude": 38.98404953,
    "longitude": -84.64687517,
    "comments": "Bright sphere heading west to east  I live in Northern Kentucky and on November 13 at 6:00 a.m. ET while in my back yard I witnessed a bright white orb overhead at the eleven o&#8217;clock position to my south heading west to east.  Altitude could not be determined but it appeared lower than most aircraft that do high flyovers but not as low as aircraft landing at the local airport.  I watched it through my 10x50 wide angle binoculars and could not see any flashing colored lights like commercial aircraft have.  The sighting lasted about 60-70 seconds and never deviated from it&#8217;s course.  This is the third time I&#8217;ve seen this in the last three years from my back yard. Always the same description, position, heading and speed. (On one other occasion, that my 9 year old daughter pointed out to me from our back yard, the object looked like a blueish-green light circulating counter clockwise, like it was in a circular flourescent bulb, at the same position, speed and heading as the three bright white orb sightings).  Afterwards I immediately checked the real-time ISS position but it was over Europe so it was not that, also it does not follow a direct straight west to east direction.  It had the brightness and was as large as Jupiter or Venus would appear but only moving much faster.  BTW Washington DC is directly east of me and many military bases are directly west of me, not that this has any known correlation.",
    "distance": 733.3756205749575
  },
  {
    "date_time": "10/28/2012 23:07",
    "shape": "Unknown",
    "duration": "10 seconds",
    "city": "Marietta",
    "state": " GA",
    "latitude": 33.95398699,
    "longitude": -84.55293782,
    "comments": "Sky changed color in several bright flashes.  The entire sky changed color red green and purple illuminating heavy cloud cover for the entire field of vision.  The event was in progress when I was told to observe, I do not know how long it had been going before it was noticed.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 734.1702009330768
  },
  {
    "date_time": "11/4/2012 20:45",
    "shape": "Fireball",
    "duration": "10 minutes",
    "city": "Woodstock",
    "state": " GA",
    "latitude": 34.09812942,
    "longitude": -84.51243034,
    "comments": "Woodstock Georgia 8:45pm 11/4/2012 several balls of fire in sky  This was witnessed in Downtown Woodstock.  There were at least nine, no  more than 12 balls of fire in the sky.  They didn't appear to be moving.  They didn't seem to be any type  of aircraft that was flying; they literally looked like balls of fire, like a constellation.   When I got to my car they were gone.  I tried to take pictures with my cell phone, but was unable to because it was dark and the phone couldn't focus.",
    "distance": 734.2861391683293
  },
  {
    "date_time": "11/15/2012 6:41",
    "shape": "Fireball",
    "duration": "seconds",
    "city": "Cincinnati",
    "state": " OH",
    "latitude": 39.14676961,
    "longitude": -84.54409483,
    "comments": "I do not know what it was.it was bright green rather large with the stuff around it when something is moving at a high rate of speed and it was coming at a angle and when it got ready to hit the ground there was no explosion or anything just gone and this would have been over the hamilton/fairfield area i was on 275 eastbound.  i wish i knew what it was",
    "distance": 741.553115621885
  },
  {
    "date_time": "11/10/2012 23:30",
    "shape": "Triangle",
    "duration": "~4 minutes",
    "city": "Hamilton",
    "state": " OH",
    "latitude": 39.40345918,
    "longitude": -84.57602673,
    "comments": "Navy triangle over my house  my wife and I were sitting on our upper deck and sighted a glowing plasma ball come from the south and flew off in a westerdly direction. after she went to bed I stayed up and was laying on the poorch carpent and begahearing a jet engine sound coming from the south. Standing up and looking over the annex's roof I saw a flat darkened object coming at me from the direction of our county airport. I thought to myself, &amp;quot;the FFA is going to pull this guy's licence&amp;quot;. The craft was no more than 100 feet off of the ground heading straight at me. As it got closer I noticed no tail on the craft and sounded as if it only had one jet engine. In front of it were what appeared to be two huge white lights projectinting out in front of it.  As it came closer it began to fly over the other side of the street on which I live and the detail was remarkable.  The craft was triangle shaped and painted in standard navy gloss grey top with creamey white belly. It was absolutely cleane no dirt streaks or oil on it.  What appeared to be a weapons bay was open and ran most of the full length of the craft.  There was no cockpit so was a remotely steered craft.  No markings of any kind could be seen but the weapons bay was lit up and you could see ribbing? and tubes for electrical or hydraulics inside.  The amazing thing was it's speed it was moving about the speed of a man fast walking.  A standard airfoil would not keep this craft up. Since it was running flat at very low speed the only thing floating it was probably a single gas jet generator pruducing some form of ionized, capacitive lift.  It was about the size of a large single engine private plane up to a private twin.the tail terminated in what appeared to be flaps that were set neutral   and again gave no assist in lift. most likely this is deriviant of the Bifield Brown lifting concept. It continued on in a wright Pat direction.   ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
    "distance": 744.694249650452
  },
  {
    "date_time": "11/6/2012 19:30",
    "shape": "Circle",
    "duration": "20 seconds",
    "city": "Hamilton",
    "state": " OH",
    "latitude": 39.40345918,
    "longitude": -84.57602673,
    "comments": "On November 06, 2012 we (five of us) at 7:30 pm saw seven to ten bright &amp;quot;balls&amp;quot; of light (orange in color) in the sky.  I was driving west on Princeton Road in Hamilton, Ohio.  I had in the car my youngest son (8-yrs age), my daughter (16-yrs age) and two of her friends (both 16-yrs).  It was starting to get dark and lights in the sky caught my eye.  I was turning off Princeton Road taking my daughter's friend home and this allowed us to park the car.  We got out and watched the lights which appeared round and orange in color.  They were not rapidly moving, but they were in motion.  I did not count but there was near 7 to 10 lights moving in random directions.  I could not tell how far or how big the lights actually were cause I did not any relative distance marker.  We watched near 20 to 30 seconds then the bright balls of light just disappeared.  My daughter compared the sight to an animated movie caused Tangels where Chinese lanterns were set off into the sky.  I don't know what we saw but it was an event unlike anything I have seen.  I am forty-five yrs age and never give! n UFO sightings much thought only in the movies.  But we saw something that may be can be explained by facts that I don't know about like Chinese lanterns or bright hot air balloons.  My daughter attempted to video the sight via her cell droid phone but could not get the images focused.",
    "distance": 744.694249650452
  },
  {
    "date_time": "11/18/2012 21:05",
    "shape": "Fireball",
    "duration": "1-2 minutes",
    "city": "Roswell",
    "state": " GA",
    "latitude": 34.01465617,
    "longitude": -84.34031652,
    "comments": "Reddish Orange fireballs over Roswell Georgia  My sighting started at approximately 9:05pm EST.  I was on the back porch of my home looking to the north,north east , away from the moon which was approximately 180 degrees the other direction and below the tree line. This is my largest view of the night sky as i am mostly surrounded by very tall trees.  I was sitting facing this direction and noticed 2 bright reddish orange lights emerging over the tree line at 30 degrees off compass north, which is my horizon and the lowest tree line in sight.  The lights appeared about an inch apart from my point of view moving from what appeared to be an East to West bearing.  The lights were bright but not as bright as Jupiter which was off to my right which i see regularly and is often the brightest object in the sky other than the moon.  The sky was completely clear, and i could see stars on the tree line/ horizon in the background, as well as a few passing/blinking planes in the same approximate area as for comparison. I am very familiar with the air traffic around this area and am very familiar with the the flight paths over this area as it seems to be a relatively high traffic area for planes.  However this was nothing like anything i have seen for myself before.  The 2 lights we diverging and disappeared in about 10-15 seconds.  They seemed to be ascending horizontally rather than any sort of decent, as possibly a flare would have, and were moving at a steady rate.   The relation to each other was about 12 o&#8217;clock and 5 o! &#8217;clock top to bottom, as if a plane was on an extremely high banking maneuver, although the lights seemed much too far apart and to quickly moving to be one object.  I quickly determined that these lights were not connected because they seemed to be drifting apart from one another while holding their bearing of East to West while moving at their own independent rates of speed.  When i stood up out of curiosity and took about 3 steps forward, about 10-15 sec later, 3-4 more of the same objects appeared as the 2 before over the same spot heading in the same direction.  My house is situated on a hill and i immediately went up the hill to gain a better perspective and as i did a total of 6-7 lights appeared moving in this similar direction.  I grabbed my iPhone and began recording what i could.  It was completely dark so i didn't know if they would show up or not, but despite the neighbor&#8217;s patio light glaring against the camera i managed to capture s few of the lights.  Unfortunately i stopped recording on accident when i starting moving up the stairs to the top of the hill, so when i got to the top i started another recording.   Although ! you can make out some of the lights in the video it really does no justice to the sighting as i was filming on a phone at night and had a bad glare.  I happen to be a videographer/ video editor and hesitate to post the footage due to its poor quality even though some of the lights are visible in the video it is certainly not a definitive piece of evidence in any way as to what these lights were or really even their bright reddish orange color. Mostly it will serve as documentation to myself that it actually happened.  With in about a minute all of the lights disappeared in front of me, not in any kind of sequence and although they were flying in some sort of formation relative to one another,  there was no recognizable pattern.  These lights were not blinking but had some sort of vague pulsing regularity that never stopped until they disappeared.  There was also no noise whatsoever before the sighting, during or after.  I stayed for about 20 min examining the sky for any further explanation but had no further sightings.",
    "distance": 745.139279281116
  },
  {
    "date_time": "11/2/2012 21:15",
    "shape": "Fireball",
    "duration": "6 minutes",
    "city": "Plymouth",
    "state": " WI",
    "latitude": 43.74095643,
    "longitude": -87.97133562,
    "comments": "Yellow /Orange light  ( fire in the sky) whitnessed by two in Plymouth WI  Traveling east on hwy 67 (southwest of Plymouth WI) to pick up a vehicle for repair at about 9:15 pm, turned right on oak rd,passed a man walking his dog, then right on sumac rd.  While traveling west on sumac noticed a light low in the sky that seemed out of context because of the color, I wondered if it was a yard light.    As i approched, I noticed that it was not a yard light and it was close to being directly above a nearby residence.  I slowed down and noticed the orange color, to me it looked like a campfire in the sky.  I sped to my destination which was about a half block away, when i arrived a male family member was walking out of the house, at that point we both noticed the light moving from east to west and he said &amp;quot;what is that&amp;quot;.   We spent the next two minutes trying to figure out what it was as it moved west and then seemed to turn south and rise into the sky while slowly dissapearing.",
    "distance": 747.1695167119207
  },
  {
    "date_time": "11/17/2012 17:00",
    "shape": "Unknown",
    "duration": "10 seconds",
    "city": "Knoxville",
    "state": " TN",
    "latitude": 35.9716528,
    "longitude": -83.95906226,
    "comments": "Brilliant bright light seen above high altitude airplane with no plume then disappears over Knoxville, TN.  Traveling 275 to I-40 West, approximately 5pm, right before taking the Alcoa Exit, noticed a high altitude aircraft toward the West with a white plume behind it.  In perspective, approximately 1-2 inches above this aircraft was a brilliant white light, shape unknown, with no trailing plume, which the light became even brighter than before, then completely disappeared. I believe this was too close to be another airplane.  Also, if it was an airplane, it would not have disappeared. It did not have a trail of any kind.  I was the front passenger in the car, and was telling the driver, my sister, to look at the object, and why it did not have a plume, when it completely disappeared.  She was driving and did not see it.  We were traveling to UT Medical Center with 2 grandchildren to see my new grandchild.  I have never seen a UFO before. I am 55 years old, have been a Registered Nurse for over 30 years, and have lived in Anderson County most all of my life.",
    "distance": 749.2332289737627
  },
  {
    "date_time": "11/14/2012 22:20",
    "shape": "Circle",
    "duration": "45 seconds",
    "city": "Knoxville",
    "state": " TN",
    "latitude": 35.9716528,
    "longitude": -83.95906226,
    "comments": "I observed what  I thought was a low flying plane, but as I approached I realized it was stationary and hovering.  On the evening of November 14th I was driving home from in the western suburbs of Knoxville, Tennessee on Westland Drive.  I was headed east when I noticed what appeared to be a very low flying airplane in the distance.  There is McGhee Tyson airport about 8 miles to the southwest, so I didn't, at that moment, think it was out of the ordinary, except for the altitude it was at.  For the next 45 seconds I had a clear view of this craft. I kept waiting for it to pull away and gain altitude, but as I got closer, I realized that I was gaining on it.  I slowed down as I got closer and realized that it was hovering about what appeared to be 400 feet above the road.  It had two white lights on either side of what I first thought were the wings, with a red light blinking in the center.  As I got closer and closer, now only going maybe 20 miles an hour I had a totally clear view of this craft.  As I drove under it, only then was I able to see that it had an oval or rounded shape to the underside of it.  I really wanted to pull over, get out and observe this craft, but I was just a little freaked by the whole experience.  As I drove away I kept looking in my rear view mirror, but never saw the lights or craft again.  I would really like to think that it was a plane or helicopter, as it was hovering, but I know of no plane that can do that and I've seen too many 'copters and it made no noise that I could hear.  The exact location was on Westland Drive right across from A.L. Lotts Elementary school.",
    "distance": 749.2332289737627
  },
  {
    "date_time": "11/3/2012 3:35",
    "shape": "Circle",
    "duration": "10 seconds",
    "city": "Knoxville",
    "state": " TN",
    "latitude": 35.9716528,
    "longitude": -83.95906226,
    "comments": "Circular object floating in place for a few seconds then darting off into the distance  I was driving home at 3:35 am and saw an object that looked like a shooting star but hovered over the horizon for a few seconds then darted off into the distance   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 749.2332289737627
  }
]