[
  {
    "date_time": "11/6/2012 14:00",
    "shape": "Disk",
    "duration": "15 minutes",
    "city": "Las Vegas",
    "state": " NV",
    "latitude": 36.19411448,
    "longitude": -115.3163733,
    "comments": "Saw small stationary clouds forming from thin air,later saw a saucer shaped craft fleeing the area.  As I am near Nellis AFB, I delight in watching all the aircraft.  On this day I watched a very loud B-1 bomber head out going NW and out of sight.  I thought it looked peculiar that there were only two very small clouds in the relatively clear low NW skyline.  So I'm looking,and two more small clouds formed from thin air in the same area.    After retrieving my binoculars to try and determine the source, I saw no aircraft but one more puff of cloud emerged similar to how shaving cream would come foaming out of a can.  These were not contrails,and if this were exhaust from an aircraft, it would have to be hovering, yet I saw no craft present near them.Just then two of the Thunderbird jet team entered into the air going roughly in that direction.    I continued to watch the area of the clouds as the jets went out of sight.Just then I saw a brownish green craft that appeared saucer shaped dart across the sky at sonic speed coming from that vicinity headed SW.Within minutes four! fighter jets emerged from the AFB, flew around near the area of the clouds,then returned to the base.The small clump of clouds that appeared from nowhere stayed as cloud vapor and did not dissapate as smoke might.I watched them slowly drift NW within the relatively calm air current for a half hour.I've never seen anything like this cloud birth before, and cannot possibly imagine an explanation for it.",
    "distance": 76.86815338081422
  },
  {
    "date_time": "10/31/2012 20:40",
    "shape": "Formation",
    "duration": "15 minutes",
    "city": "Las Vegas",
    "state": " NV",
    "latitude": 36.19411448,
    "longitude": -115.3163733,
    "comments": "YELLOW/ORANGE STATIONARY ORBS IN TRIANGULAR FORMATION IN NORTHWEST LAS VEGAS SKY. SPOTTED AT APPROX. 8:40PM, OBSERVED FOR APPROXIMATELY 5 MINUTES FROM STREET, THEN I LEFT THE AREA. RETURNED TO AREA AT 9PM AND THEY WERE GONE.",
    "distance": 76.86815338081422
  },
  {
    "date_time": "10/29/2012 10:55",
    "shape": "Light",
    "duration": "10",
    "city": "Las Vegas",
    "state": " NV",
    "latitude": 36.19411448,
    "longitude": -115.3163733,
    "comments": "UFO lights  There are two lights directly over the house now as I stand outside.  Flickering red and blue.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 76.86815338081422
  },
  {
    "date_time": "11/13/2012 2:30",
    "shape": "Circle",
    "duration": "18 seconds",
    "city": "Lake Arrowhead",
    "state": " CA",
    "latitude": 34.26198871,
    "longitude": -117.182336,
    "comments": "moving, flying, orb-like,  It was a clear sunny afternoon Driving in lake arrowhead, my girlfriend and I pulled off to sit on these steps that overlooked the lake.  There was some interesting metal work I was curious about and when walking down the steps looked up and saw what appeared to be a floating ball bearing about a mile in elevation and 2-3 miles away, this orb like craft moved on an upward scale at a steady pace reflecting the sun and clouds above it very clearly,  when I turned to tell my girlfriend the craft was gone about a half second of looking away.   I scoured the sky for the better part of our time at the steps and saw no more signs of the craft.  I am a believer and this was no weather baloon...",
    "distance": 93.72217450577288
  },
  {
    "date_time": "11/10/2012 19:40",
    "shape": "Circle",
    "duration": "8 minutes",
    "city": "Los Angeles",
    "state": " CA",
    "latitude": 34.61740854,
    "longitude": -117.83623850000001,
    "comments": "3 Red/Orange Circles blacking out in the night.  On the evening of November 10, at 7:40 pm, I was taking my dog outside to the bathroom.  I saw 2 red/orange circles in the sky moving SSE slowly at the same speed.  It was located to the west of my position.  I told my wife to come out and witness the movement.  There were no sounds that we could hear of. The lead circle would pulsate slightly and then die off.  Because it was dark, we weren&#8217;t sure if it blacked out or was masked by clouds.  About 10 seconds after, the second blacked out.  My wife went back into the house and I continued to walk the dog around the neighborhood.  Approximately 3 minutes later, I saw a third red/orange circle trailing the same route as the first two.  After about 1 to 2 minutes, the third blacked out as well.  I saw regular aircraft in the vicinity of these circles.  It was obvious that these red circles did not fit the profile of a normal aircraft.  Additionally, the movement was unnatural to a regular aircraft. It would shif! t mid-air.  When I got back into the house, my wife researched this to see if anyone else saw this pattern.  On the UFO Reporting Center, the description matched similar reports.  I&#8217;m a former Marine Corps Officer with a MBA and my wife has a masters as well.  We have never witnessed anything like this before.  My first assumption was that these might be police unmanned aerial vehicles.  Although I have no reference, it looked extremely high in altitude.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 109.48996546893122
  },
  {
    "date_time": "11/4/2012 9:15",
    "shape": "Circle",
    "duration": "10 seconds",
    "city": "Upland",
    "state": " CA",
    "latitude": 34.12302341,
    "longitude": -117.65661829999999,
    "comments": "Unusual faint white circle moving faster than a jet traveling south to northeast over Upland CA at approximately 09:10 am.  Was in the backyard taking photos of squirrels.   Looked up to the eastward sky as I followed the squirrel walk on the telephone line and saw a faint circle in the sky moving faster than a jet plane.    The object appeared to weave slightly and traveled from south to northeast and then disappeared into the blue sky.  The object was viewable for less than 10 seconds.    Personally have never seen an aircraft move at that high rate of speed.   I wonder if it may have been a satellite?   Usually the engines can be heard from normal airplane traffic.   There was no engine noise which could be heard from the object.    Because it flew too fast I was unable to snap a photo.",
    "distance": 119.7420760312439
  },
  {
    "date_time": "11/10/2012 19:30",
    "shape": "Circle",
    "duration": "3 minutes",
    "city": "Placentia",
    "state": " CA",
    "latitude": 33.87122323,
    "longitude": -117.85308859999999,
    "comments": "Clusters of orange &quot;lights,&quot; cylindrical in shape, traversing the night sky in the area above our heads  As we entered our autobmobile, once person looked out the rear view window and commented on seeing strange lights in the night sky.  We all got out and looked and above us traversing the sky were about 30 bright orange lights, spherical in shape, moving slowly across the sky, soundless, and soon disappearing as they floated out of view.  They were clearly delineated against the dark sky.  We could not attribute these objects to anything we had ever seen before.   One witness was a Ph.D. biolgy professor, one was an engineer, one was a high school teacher, the other two women were college educated and none were inclined to  make snap judgements concerning the nature of the objects.",
    "distance": 139.83523748124347
  },
  {
    "date_time": "11/7/2012 19:30",
    "shape": "Unknown",
    "duration": "hours",
    "city": "Lone Pine (Mt. Whitney)",
    "state": " CA",
    "latitude": 36.59177668,
    "longitude": -118.07828700000002,
    "comments": "encounter with et and being chased for 60 miles  returning home south bound on hwy 395 at around 19:20 hrs i noticed that on Mt Whitney there was a bright white light were there should not have been one, taking the next exist i follow a trail to a location that offered a view of the mountains and the area in front of the mountains, and from there i observed many light both on the mountains and from there base to the highway for 6 hours!  I also was able to photograph some of the lights which although having a full moon helped long shutter opening, were needed.   The light first light on mt whitney had disappeared when a few minutes later reappear with a second light and both light moved about the mountain until they reached the base, where they continued out onto the plain in front of the mountain for a few minutes then blink they were  gone.    This activity continued thru out the night, with one exception, a light appeared at the base of a small hill located to my left i watched as this ligh! t slowly moved toward hwy 395 then stopped and went off!  I wanted a closer look and moved without lights toward the small hill thinking a trail could be found that would lead me toward the mountain, but i only found a large field which confused me because my view had changed so back to old location was necessary, i was about to move on when i noticed that a light was moving towards my location from the hill slo wly using the trees and brush to hide its movement when it reached the last bush it bent over and rested on one knee then turned toward me.    This is what i saw the form was wearing a suit or something like that, light in color no other detail was viewed, a helmet was covering the head and was dark but for a copper like color coming from the inside view lens, I tried to use my glasses to see better but the form was not visable until i removed them, at this point my concern for my safety over came my interest to remain any longer so i left or tried to leave but was un! able to locate the exist which i had used to get into the fiel! d, stopp ed from going further i left my vehicle on foot to find the exist it took a few minutes but i found the track i needed getting back on to the trail there was a red blinking light to my right at first i did not notice but once i started to move so did the light when i stopped it did too i tried to creep slowly but this light maintained a safe distance from my vehicle. I finally got the camera out (Nikon D 3000 SLR) and started to shoot these light, there was a full moon that night but long shutter opening was necessary shooting the lights on the mountain was not good but taking the pictures of the red lights came out much better, I am not saying what i saw  i would rather hear what other see, but when i saw the first image on my camera i new it was time to get out of there quickly and that is just what i did! Once i was back on hwy 395 and just passed lone pine something i had not consider happened that red blinking light was now following me this i know because it appeared j! ust to my right and in front of my vehicle using the frontage road, my speed at the time was about 75 mph the light had no trouble keeping up nor did have trouble passing thru a second story building next to a railroad crossing pacing me for the next 60 miles until i stopped near red rock state park and could no loner see the light!",
    "distance": 144.83162030110807
  },
  {
    "date_time": "10/28/2012 13:33",
    "shape": "Other",
    "duration": "seconds",
    "city": "Lone Pine",
    "state": " CA",
    "latitude": 36.59177668,
    "longitude": -118.07828700000002,
    "comments": "Unusual object that appeared suddenly  http://i50.tinypic.com/313km5s.jpg  Images were taken 10sec apart at 1/200th second. Third image in the file shows a 100% zoom of the area.    This object was not actually seen during the event, but rather only when images were processed.   This was taken from the Alabama Hills, Lone Pine, CA.   ((NUFORC Note:  We strongly suspect that the object is a bird, possibly a hummingbird.  PD))",
    "distance": 144.83162030110807
  },
  {
    "date_time": "11/14/2012 5:00",
    "shape": "Light",
    "duration": "8 minutes",
    "city": "Mission Viejo",
    "state": " CA",
    "latitude": 33.61236218,
    "longitude": -117.66103100000001,
    "comments": "Two very bright red and white lights flashing in the sky completely still and silent befor disappearing at very high speeds.  I was watching television.  And at around 5:00 am I rolled over on the couch to see if the sun was up yet. I opened the blinds, and it was still very dark, that&#8217;s when I noticed a stationary red pulsating light over the neighbor&#8217;s apartment.  I continued to watch the light for about 2-3 minutes it would flash 9 times red then 1 time white.    As I continued to watch the light I noticed another red light seemingly to come from nowhere fly directly underneath the original red light.  I continued to watch the lights for about another minute, that&#8217;s when the second light to arrive shot off to my left over my roof, and out of sight.  I knew at that time that this was not a helicopter.  However I was still not sure of what I was seeing, the original red light was still there so I went outside on my doorstep to see if I could hear anything.  There was no sound.  It was completely still in the sky very bright, and very silent.    I went back inside and continued to watch the fla! shing light 9 red 1 white.  For some stupid reason I became a little anxious, I thought to myself, what if this thing is watching me watching it.  I have heard of UFO sightings being questionable, explainable, and somewhat brief.  I have never been a believer, nor have I ever had an interest in UFO&#8217;s or alien&#8217;s, until now.  I do not know what I saw, but I know what I saw and I do not believe it was anything man made.  I watched this UFO for a solid 8 minutes before it literally shot off to my right in the opposite direction as the second UFO, over the neighbors apartment and out of sight.    I paced back and fourth in my apartment trying to make sense of what I had witnessed trying to compare memories of what I have seen prior to in the sky.  Nothing matched.    I am a frequent flyer between here and the U.K  I know what planes look like at night time from the ground and in the air, I have seen many helicopters in the sky, this was neither of them.  I went onto the internet and searched what I had seen and to my surprise there are many similar sightings thank god, because for a minute there I started to doubt myself, but to deny myself what I had seen would just be a lie.   I know what I witnessed on 11/14/2012 at 5 am and I feel very privileged, even if my friends and family don&#8217;t believe me, I do not care.    I however on the other hand am now a believer, and I truly hope that this wont be my last sighting because the unexplainable is truly awesome!",
    "distance": 145.78567306955887
  },
  {
    "date_time": "11/3/2012 17:30",
    "shape": "Fireball",
    "duration": "2-5 minutes",
    "city": "Buena Park",
    "state": " CA",
    "latitude": 33.85802931,
    "longitude": -118.00834579999999,
    "comments": "red lights seen over buena park apparently marked as sign of &quot;apocalypse  about 3 red lights were seen over buena park.  My friend told me about the sighting so i did a little research on the side and found out it had something to do with a planet called nibiru or planet x.  I'm not a believer in the apocalypse by means of a planet crashing into us.  but apparently these red lights mean that nibiru or planet x will hit us in July.  the number of witnesses is just how many people i know that saw not sure if the whole city seen it or if he was the only one.  you guys don't have to believe me but what i know is the truth and isn't a hoax.  there have been other sightings of these red lights so there is some accumulating proof that these things or natural occurrences are out there.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 146.9687267292092
  },
  {
    "date_time": "11/4/2012 12:50",
    "shape": "Sphere",
    "duration": "3 minutes",
    "city": "Laguna Hills",
    "state": " CA",
    "latitude": 33.58112927,
    "longitude": -117.69139550000001,
    "comments": "2 goups of 20+ haphazardly-moving spheres or obs circulating around each other  2 groups of several spheres or orbs rotating around each other in a haphazard circular pattern.  These appeared to be a flock of birds at first, but a closer look revealed no apparent wings or wing-based flying motion and there also appeared to be a metallic quality visible as they turned into their circle.   The objects were circulating around in an unorganized 'follow-my-leader' kind of manner.    I ruled-out a bird formation when the circular motion appeared to be around a minimally-moving general axis tending towards a north-westerly direction.    There appeared to be 2 groups of these spheres/orbs - 1 group over the general area of Lake Forest and 1 closer west to the 5-Freeway.     As traffic progressed I was unable to keep constant eye contact and could not see the spheres in their general direction some 3 or 4 minutes later.",
    "distance": 148.56218199339148
  },
  {
    "date_time": "11/10/2012 19:00",
    "shape": "Sphere",
    "duration": "10 minutes",
    "city": "Bellflower",
    "state": " CA",
    "latitude": 33.89075851,
    "longitude": -118.1253662,
    "comments": "Several orange spheres seen in Lakewood and bellflower.  I was walking on south st going north and looked up and saw a bright orange shpere and then I saw three more of them flying in a triangle shape, the one at the bottom seemed to go a bit faster then the other two and was going up and down almost out of formation.  Then I saw four flying in a triangle shape with the fourth one in the middle again they seemed to speed up and slow down flying up and down out of formation.  Then I saw ones fling solo one after another a couple of them seemed to disappear and reappear then it was over.  There was a car pulled over with another witness I thought I was the only one.  I told my girlfriend about it. I hope she doesn't think I'm crazy, my phone was dead I wanted to try and capture it on video.  One thing I noticed about the last one I saw I was on Clark heading toward artesia was it seemed lower and looked like a fire as if it was a flying fire place yet it moved like it was under intelligence.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 150.56663679579097
  },
  {
    "date_time": "11/11/2012 22:50",
    "shape": "Chevron",
    "duration": "20 seconds",
    "city": "Westminster",
    "state": " CA",
    "latitude": 33.75020541,
    "longitude": -118.0026392,
    "comments": "2 grey with black chevron shaped crafts racing over Westminster, ca  I was in my backyard using a star app on my phone.  As I was looking up I saw 2 grey with black chevron shaped crafts flying right next to each other at one point 1 wing overlapped other crafts wing.   They were going really fast flying in a straight line south never changing direction.  They seemed to be racing.  There was no sound of there engines.  I could hear a nearby helicopter but nothing from these 2.  I have never seen anything like it.  The only thing that I can come up with is two stealth bombers flying together.",
    "distance": 151.82031231474525
  },
  {
    "date_time": "11/16/2012 20:00",
    "shape": "Fireball",
    "duration": "10 seconds?",
    "city": "Long Beach",
    "state": " CA",
    "latitude": 33.81998236,
    "longitude": -118.1437929,
    "comments": "Long Beach California November 16, 2012, appeared to be 2 large comets or fireballs over ocean.  Just saw 2 big objects in sky over ocean in Long Beach California. They looked just like comets except very big and very close.  Flying in odd patterns.  It really looked like falling stars to me, except very big and very close.",
    "distance": 154.5364248110065
  },
  {
    "date_time": "11/16/2012 20:00",
    "shape": "Fireball",
    "duration": "2 minutes",
    "city": "Long Beach",
    "state": " CA",
    "latitude": 33.81998236,
    "longitude": -118.1437929,
    "comments": "Flaming/Sparkling trails with following helicopter over Long Beach, CA  It was approximately 8pm, my wife and I were in the parking lot of a local CVS about a mile inland, and in the southern sky, likely just past the port of Long Beach were (2) flaming/sparking objects flying around criss crossing each other.  They were moving slower than planes would move and in a very unusual manner, snaking left and right and crossing back and forth.  Each one had a solid goldish colored light that would stay on the entire time, as well as a trail that looked like a comets trails.  Almost like a giant sparkler had been lit and was flying through the sky.  The sparkling trail would come on for roughly 10 seconds and then go out on each one.  This happened for about 2 minutes as the objects continued to fly south until both the solid gold light and the sparkling trail of each of the two extinguished.  For the entire incident we could see a helicopter a few miles away to the north which appeared to be following the objects, and continued to follow them south until all 3 craft were out of sight.  I spent all night trying to think of what the objects might be as well as search the internet and it appears others saw similar craft, but within the last week.",
    "distance": 154.5364248110065
  },
  {
    "date_time": "10/28/2012 10:00",
    "shape": "Light",
    "duration": "30 minutes",
    "city": "Beverly Hills",
    "state": " CA",
    "latitude": 34.07129261,
    "longitude": -118.4009034,
    "comments": "At least 20 round w/ sparkle of lights on them  My friend and I saw at least 20 round objects with a sparkle of light on them floating in the sky.    They made a straight line formation and then floated away.    We pointed it out to 2 other people in the area.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))  ((NUFORC Note:  Similar sighting from Altadena, CA, on the afternoon of the same date as this report.  PD))",
    "distance": 155.95769147209532
  },
  {
    "date_time": "11/9/2012 3:13",
    "shape": "Circle",
    "duration": "15-20 seconds",
    "city": "Oceanside",
    "state": " CA",
    "latitude": 33.23501964,
    "longitude": -117.30614109999999,
    "comments": "Redish circular UFO cruising south west in San Diego County  Hi! I thought what I just saw was rather interesting and was worth a google search to notify the appropriate people. I couldn't sleep and was out back having a cigarette- looking up at the stars (pretty clear for the most part with a few clouds north east of where I'm located. Next thing you know coming from the north heading south (almost bee lining it to the coast) I saw a circle with a ring above. The ring was very defiant and visible.  It lasted long enough for me to blink, blink again and it was still just cruising heading southwest.    I travel frequently and this thing was cruising in the same view as you would an ascending or decsending airplane.",
    "distance": 157.04735085935084
  },
  {
    "date_time": "11/18/2012 0:40",
    "shape": "Disk",
    "duration": "1-3 seconds",
    "city": "Carlsbad",
    "state": " CA",
    "latitude": 33.12929436,
    "longitude": -117.2821327,
    "comments": "Green saucer strobes in and out of sight into horizon  My friend was driving me home.  She pulled out of her parking spot and we drove down the street about a block. We were facing north at a stop sign.  I saw from the corner of my right eye a light flying north as well. It was moving at an incredible speed.  Way too fast to have been an airplane.  At first i thought it was a comet but it started turn on and off (would disappear and reappear, it did this 2 times) and was mint/pine green in color. I say it for about 1-3 seconds before it flew out into the distance.",
    "distance": 163.04200893393565
  },
  {
    "date_time": "11/9/2012 19:40",
    "shape": "Unknown",
    "duration": "9 minutes",
    "city": "Bakersfield",
    "state": " CA",
    "latitude": 35.36227241,
    "longitude": -119.0631528,
    "comments": "Red object displaying bizarre flight patterns before shooting directly upwards into space  While smoking a cigarette, I looked up into the sky and noticed an object moving at a far higher altitude than any plane I have seen.  The object, which appeared red to the best of my ability of sight, moved backwards, foward, sideways, then in a zig zag pattern.  Due to recent numerous similar events, I was convinced the object was far from any flight capable object I had ever seen.  When the object changed course west, it stopped near a star and the star began glowing brighter as did the flying object.  The object flew east at incredible speed, immediatly stopped, and flew upwards towards space in a similar fashion as a rocket ship, directly upwards.  As it was on its path towards space , the clouds behind it became thicker and formed behind the object, covering any way to continue viewing it.  Throughout it's flight patterns, it consistently flew behind clouds near the shining star.  I highly stress to inform this is not the first time I have seen an object mane! uver such bizarre flight patterns and shoot directly into space, seeming to somehow each time influence cloud patterns.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
    "distance": 168.73180947561383
  },
  {
    "date_time": "11/9/2012 19:00",
    "shape": "Circle",
    "duration": "2 seconds",
    "city": "Bakersfield",
    "state": " CA",
    "latitude": 35.36227241,
    "longitude": -119.0631528,
    "comments": "Circle shape with intense light coming from the back of it!  I took my dog outside to go to the bathroom and I was looking at the sky.  Then all of the sudden I seen a circle shape I believe.  It had this light behind it which was like no other!  Trailing behind the ufo then the light from the back of it went off then I couldn't see it any longer.    I'm still in shock!  And can believe what I just seen!",
    "distance": 168.73180947561383
  },
  {
    "date_time": "11/5/2012 21:52",
    "shape": "Triangle",
    "duration": "10 seconds",
    "city": "Del Mar",
    "state": " CA",
    "latitude": 32.96128635,
    "longitude": -117.2616405,
    "comments": "Overhead we saw V or chevron shaped with four lights on each side, huge, silent, very fast moving southward along coastline,amazing.  11/5/12:  My adult daughter and I were standing at the end of 28th street in Del Mar Ca looking at the beach, it was a hot day and dry, wind from the east, so no fog or clouds or dampness this evening. It was a clear night.  Next we were looking at the bright stars, and looking at the sky overhead, at approx. 9:52 pm a very fast moving group of lights passed overhead, it was completely silent if it was an object, and it moved very fast, passing overhead in a matter of seconds.  It was V shaped or Chevron shaped, we both thought it was one huge flying object that was absolutely silent, it had what we perceived as four lights on each side.  Of course this could have been several separate lights moving in perfect unison, or a formation, but we perceived it as being a V shaped object.  The lights, four on each side of the V shape, were a soft light, she thought beige, I though beige but with an orange hue.  They were moving so fast, that maybe 10 seconds of good overh! ead viewing time was all we had, maybe less, after moving from an overhead position, as it moved south, it became invisible, that is to say it disappeared very quickly from view after being almost directly overhead.  I would call this a UFO, although I am skeptical and wonder if it isn&#8217;t just a military aircraft that I am not familiar with, but it would have to be completely silent, and really huge,   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 173.18950195302853
  },
  {
    "date_time": "11/13/2012 2:00",
    "shape": "Sphere",
    "duration": "3-4 seconds",
    "city": "Porter Ranch",
    "state": " CA",
    "latitude": 36.07370666,
    "longitude": -119.03068429999999,
    "comments": "Witnessed red sphere traveling low, silent at very high rate of speed across valley at 2:00 a.m.  Upon awakening at 2:15 a.m., I was looking out a window, North facing in my house.  I then witnessed what appeared to be a small, bright red sphere flying very low (approx 300-400')in a NW direction.  This object was NOT man-made.  It traveled silently in an extreme straight attitude and traveled in what I estimate 2-3 miles in about 4 seconds.  I live high on a hill.  The most remarkable thing about my sighting is speed and attitude of the object. Straight as can be; fast, silent.",
    "distance": 175.15066612764113
  },
  {
    "date_time": "10/30/2012 19:00",
    "shape": "Light",
    "duration": "3 minutes",
    "city": "La Mesa",
    "state": " CA",
    "latitude": 32.77268727,
    "longitude": -117.02205579999999,
    "comments": "Large star-like object moved up and away in the south-east sky  At around 7pm I took my dogs out to the back.  It was early and not fully dark yet.  The stars in the sky were just becoming visible.  I looked up and noticed a bright, huge star.  I was moving in a south-east direction.  I hollered for my husband, but before he got outside the object moved up and away quickly and vanished.  It was like nothing I had seen before.",
    "distance": 180.68280702830407
  },
  {
    "date_time": "11/13/2012 18:30",
    "shape": "Oval",
    "duration": "4 minutes",
    "city": "Lemon Grove",
    "state": " CA",
    "latitude": 32.73485885,
    "longitude": -117.03610249999998,
    "comments": "large white light moving across the sky  We witnessed a large bright white light moving fast across the sky, then it disappeared into thin air.",
    "distance": 183.42114641798617
  },
  {
    "date_time": "10/29/2012 20:00",
    "shape": "Formation",
    "duration": "6 minutes",
    "city": "Exeter",
    "state": " CA",
    "latitude": 36.29569675,
    "longitude": -119.1438257,
    "comments": "2 Fighter Jets in Persuit of Fast moving formation of three blinking white lights  At  approximately 8:00 pm 10/29/12 my mother and  I began observing  three white blinking lights  moving  in a line formation starting at 230 degrees SSW at a 60 degree angle in the sky,  And Ended 180 degrees SSW at a 20 degrees angle in the sky.  The Blinking lights were on a flight path to the south and over  the city of Tulare when first observed.  The objects Continued to the south while the top object in the  formation of three lights ,  Began to move forward of the other two with increasing speed  while the other two began to  spread out.   About 4 minutes into our observation of this event  the objects where heading  into the distance  to the south  and fading  away when suddenly  we saw  jet after burners from a fighter jet moving from the NNE to the SSW attempting to catch up to the objects.  After we saw the after burners from the  fighter jet in pursuit,  The objects where fading out into the distance south .  Then  my mother noticed a second after burner  flash  from the direction Lemoore AFB heading south as well.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 186.25185598872636
  },
  {
    "date_time": "11/18/2012 18:00",
    "shape": "Light",
    "duration": "20 minutes",
    "city": "Santa Clara",
    "state": " UT",
    "latitude": 37.12420873,
    "longitude": -113.6523114,
    "comments": "Light that changed color from blue to green &amp; abruptly changed at a high rate of speed.  Outside of Santa Clara River Reserve. Large blue light that changed to green and back to blue on multiple occasions. Light was seen traveling at a high rate of speed into the sky &amp; back down to the horizon, then horizontal along the cliff faces of west Snow Canyon State Park. Light would change direction at a 45 degree angle. Disappeared mid-sky. Three witnesses and video.",
    "distance": 186.2519364335111
  },
  {
    "date_time": "11/16/2012 19:00",
    "shape": "Fireball",
    "duration": "5 minutes",
    "city": "Ventura",
    "state": " CA",
    "latitude": 34.36550949,
    "longitude": -119.31085449999999,
    "comments": "Huge black circle with fire ball!  Date we saw object: 11/16/12  Time: 8:30-9:00 pm  Where: Above Santa Cruz Island head south bound on the 101 freeway between Rincon and Seacliff.  My daughter, boyfriend and I were headed home after having dinner in Carpinteria, Ca.  We live in La Conchita, Ca.  Due to the freeway construction we now have to pass our town and exit Seacliff, then turn around on the freeway headed north to come home.  As I was driving past LC my daughter got all excited.  She said she just say a big bright light out over the ocean.  As we passed Mussel Shouls she screamed there it is! I turned and saw a bright orange and red ball of fire circling what looked like a blacked out moon hanging just above the Santa Cruz Island.  It was so bright I could see the outline of the mountains on the island.  We pulled to the side of the freeway just before Seacliff and got out of the car. I could see the oil rigs clearly.  The object we say was way past them and seemed to be at least 5 times bigger and 100 times brighter.  You could tell it was just above the island not moving.  Then the lights fadded and went out.  We got back in the car and started for home headed north bound now.  As we were coming up to Mussle Shouls the object reappeared.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 193.94241504355256
  },
  {
    "date_time": "11/7/2012 18:15",
    "shape": "Light",
    "duration": "20 minutes",
    "city": "Tonopah",
    "state": " NV",
    "latitude": 38.08052249,
    "longitude": -117.22543130000001,
    "comments": "Reentry followed by multiple lights hovering above city  Witnesses: 2 adults, both sober, driving from Bishop, CA to Tonopah, NV. I am retired  Both wife and I are ex-aerospace, and I am a pilot.  Date: 11/7/2012 Time: 6:15-6: 30 PM  Location-Central Nevada Weather-clear stars, starlight night. Dark. No wind. No clouds. No dust in the air.  Sightings (flap?): Driving from Bishop, CA to Tonopah, NV:  We approached Coledale Junction. I slowed and made the turn  from Hwy 6 onto Hwy 95.  I then saw a bright white light to my left. It was a craft flying less than 200 knots and in low level flight.  I assumed it was a training jet, or general aviation plane running North on Hwy 95 (towards Reno).  I  estimate that it was 2000 Ft. AGL, or lower. As it came abreast of the car and off into the desert &#188; mile east of the hwy, it turned into an orange glow and then dispersed in a shower of sparks like a meteor and trailed a comet-like tail and then burned up in level flight and was gone.  By the time I alerted my wife-she missed it. It was low and on the driver&#8217;s side of the car.  I assumed I saw a meteorite coming in-but was mystified by the slow, level flight pattern.  Then as we progressed Southbound on Hwy 95 towards Tonopah, I saw an orange circular light around two hand spans high in the windshield above the lights of Tonopah-some 12 miles distant &amp; high above the twinkling lights of Tonopah.  This was perhaps 7 minutes after the first sighting. I called attention to it and My Wife saw it too.  Then another orange glowing &quot;orb&quot; appeared to the right of the first one.  They were both spread out and at the same elevation-the distance of separation was the full width of windshield.  First the left one snapped shut-turned off.  Then the Right one went out. We both watched this.  As we approached our turn on Gabbs Pole Line road, these orange lights re-appeared-first the left one, then the right. It seemed they were stationary and in the same location still.  High above Tonopah. They stayed illuminated perhaps 20 seconds, then vanished in the same order.  We both saw these again.  We are around 70 Miles bee line from Area 51, and 35 Miles from TTR facility on the test range.  That&#8217;s it!",
    "distance": 204.6655071835178
  },
  {
    "date_time": "10/29/2012 21:00",
    "shape": "Rectangle",
    "duration": "30 seconds",
    "city": "Yuma",
    "state": " AZ",
    "latitude": 32.55805276,
    "longitude": -114.51296289999999,
    "comments": "4 rectangle solid red lights in a right banking turn. then each blinked once and went out. 4-3-2-1  Traveling from north east in a banking turn to the south west. looked to be around 2-3 thousand feet high.  Rectangles were outlined in black with very bright red light inside.  Speed seemed to slow for an object that long in length to be able to stay airborne.  No sound at all. There were four rectangle objects in perfect in-line formation. each the same size, banking right in turn.  I put my fist out and there length exceeded my fist.the angle of all four was about 130 degrees.  All four were solid red in color.   Then top #4 blinked once then went out, #3 then blinked once and then went out.#2 and #1 followed in same order.   Myself and neighbor both watched them for a full 30 seconds before all went out.",
    "distance": 207.41032192287767
  },
  {
    "date_time": "11/17/2012 20:23",
    "shape": "Light",
    "duration": "1 minutes",
    "city": "Phoenix",
    "state": " AZ",
    "latitude": 33.47809721,
    "longitude": -112.1164942,
    "comments": "It was a bright orange light.  Me and my dad was out side just looking up at the stars. When i saw the object in the south eastern sky. so i told my dad to look that's when he saw it. he told me to get his camera and to get my mom but by the time i got my mom and the camera it was gone. after that my dad went in and about a minute later the sky was full of helicopters.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 257.22355816603397
  },
  {
    "date_time": "11/2/2012 18:30",
    "shape": "Formation",
    "duration": "30 seconds",
    "city": "Phoenix",
    "state": " AZ",
    "latitude": 33.47809721,
    "longitude": -112.1164942,
    "comments": "At about 6:30pm in Phoenix my mom was walking me out to my truck.   I noticed 3 non-flashing bright white lights spaced evenly apart.  They were traveling west and being followed slowly by a helicopter.    I immediately turned my video on.    As the lights moved further east they appeared to be in a triangle formation.",
    "distance": 257.22355816603397
  },
  {
    "date_time": "11/2/2012 0:00",
    "shape": "Triangle",
    "duration": "5:00",
    "city": "Phoenix",
    "state": " AZ",
    "latitude": 33.47809721,
    "longitude": -112.1164942,
    "comments": "The object sounded like a helicopter but look like it was floating and the lights turned into one light then the other two turned back on.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 257.22355816603397
  },
  {
    "date_time": "10/28/2012 19:30",
    "shape": "Fireball",
    "duration": "5 minutes",
    "city": "Chandler",
    "state": " AZ",
    "latitude": 33.29173553,
    "longitude": -111.8942555,
    "comments": "Three fireballs flying close to the ground  Three UFO&#8217;s were observed overhead flying close to the ground.  They appeared to be flickering, as if on fire, and were of an orange color and round shape.  They started flying in a straight-line pattern and then moved to a triangular shape.  Objects moved much faster than a plane would move.  There was no sound present during their flight overhead.  The objects were very vibrant and bright.  Observers of the event were an educator, nursing student, financial analyst, hospital chaplain, two retired persons, and a nurse practitioner.",
    "distance": 274.7976935741366
  },
  {
    "date_time": "11/1/2012 0:00",
    "shape": "Light",
    "duration": "~1 minute",
    "city": "Merced",
    "state": " CA",
    "latitude": 37.29997037,
    "longitude": -120.4850166,
    "comments": "Two bright unidentified flying objects appear in Northern night sky, Southeast bound in Merced, Ca.  Two very bright, orange-yellowish, shining lights &#160;appear flying very low, overhead in the Northern night sky&#160;heading Southeast bound.  Appearing to be about 4 or 5 times the size of the Northern Star, they fly significantly close underneath all the fog and clouds.  They flew adjacent to each other and were pretty much flying in sync with each other, yet they each seemed to have an individual movement(like two cars driving side by side on a freeway).  Seconds go by then the one on the left starts to fade or flicker out.  Once the left one goes out, the one on the right follows right behind just mere seconds after.    Again, there were two objects observed.  They appeared to have no structure, just very bright with an orange and yellow shine like &#160;extremely radiant candle lights or illuminating orbs.  Adjacent and almost in sync but still with an individual movement about them.    This happened between 12:00 a.m. and 1:00 a.m., while celebrating Halloween.  The weather was completely overcast.    The Moon and stars were nowhere to be seen and absolutely in no way, shape, or form, could be seen that night.    Other observers witnessed the same but were slightly intoxicated due to &quot;the reason for the season.&quot;  I was sober.  I do not drink.",
    "distance": 283.04677722967796
  },
  {
    "date_time": "11/6/2012 19:30",
    "shape": "Changing",
    "duration": "5 minutes",
    "city": "Arizona City",
    "state": " AZ",
    "latitude": 32.75024515,
    "longitude": -111.67153090000001,
    "comments": "Phoenix lights all over again  I went outside and across the empty field along the horizon there were these 4 orange orbs just floating there for about two minutes.  Then one of them disappeared and then they all followed suit an disappeared as well.  About 30 seconds later then all came back again.  Then they all just sat there for about 2 minutes and then left.  Then in the sky, a few miles to the left, an orb came.  After that orb, another one came right next to it and then in a single line, about 7 in total showed up.  But after the 3rd one came up, the first one slowly began to disappear, and when the 4th came, the second one began to disappear.  This happened slow at first then extremely fast, probably a whole 20 seconds in total.  This reminds me exactly like the Phoenix Lights",
    "distance": 306.1816630774174
  },
  {
    "date_time": "11/2/2012 23:58",
    "shape": "Fireball",
    "duration": "5-10 minutes",
    "city": "Marina Del Rey",
    "state": " CA",
    "latitude": 36.67600356,
    "longitude": -121.77951019999999,
    "comments": "Red glowing, pulsating orbs flying low over Marina Del Rey.  One emitted a &amp;quot;search light&amp;quot; &amp;  they all disappeared in depth int  Marina Del Rey, CA just before 11:00 pm.    My husband and I had just laid down to go to bed.  We have a clear view of flight path for LAX.  Looked out our window and saw two glowing orbs that we thought were helicopters that were approaching, possibly looking for someone in the peninsula area, which is not atypical.  They were not moving very fast, they had an odd glowing red light unlike an airplane or helicopter- the orbs were slowly pulsating rather than blinking and the light was much brighter than any landing gear or anything.  I thought they were possibly far off on the other side of LAX, but an airplane had just taken off and clearly passed behind one of the orbs.    A third orb appeared and was in line of the other two.  The first orb turned towards the sea, and a fourth appeared in line behind the third.  I thought it was weird that they were so close and yet there was no sound like you would expect to hear from a helicopter, so I jumped up to observe them.    The first one, which had turned, was no longer red (perhaps the red was only in front) and proceeded out towards the sea in a straight line until the light simply disappeared into a pinhole size.  It was not like a shooting star, it simply faded like it disappeared in depth.  The fourth orb appeared to be about over the water channel and a light suddenly appeared to illuminate a large area (perhaps over the water) to the east of the orb, BUT there was no light trail emitting  from the orb, there was no visible  &amp;quot;spotlight&amp;quot; on the red orb, and the illumination was pinkish purple.  I watched these orbs turn out to the sea, and one by one they slowly shrank into pinhole size lights before they disappeared.  The orbs never appeared to bank and did not follow any common flight pattern.  I thought perhaps they were small planes, yet a small plane pasted a few minutes later- you could hear the small plane and it did not appear to shrink as the orbs did about ten m! inutes before.  Last night was extremely clear, and all the ai! rplanes in the area were flying in typical patterns, they banked out over long beach as typical and never appeared to shrink and disappear as the orbs had.   This was an unexplainable phenomenon.  I have grown up flying in small planes, including at night time, and these orbs were nothing like airplanes.  They flew low like helicopters but had no sound.  The light they emitted was so bright you could not actually see their shape.  The light that the fourth orb emitted over such a large area should presumably come from a visible spot from the craft- there was no &amp;quot;spotlight&amp;quot;.  These orbs disappeared more quickly and in such an odd fashion that it looked like an optical illusion&#8230; The pictures you have posted over the marina with the glowing orbs look like the same ones that were hovering over the Marina last night&#8230;..",
    "distance": 333.5990454741719
  },
  {
    "date_time": "10/28/2012 9:40",
    "shape": "Oval",
    "duration": "5 minutes",
    "city": "Carmel",
    "state": " CA",
    "latitude": 36.55424396,
    "longitude": -121.9225655,
    "comments": "cylinder/oval emitting light, should have been back lit by sun, later simply disappeared  Glancing out kitchen window at approximately 0940, 11/28/12, easterly direction toward Santa Lucia mountains.  At elevation of approximately 25 degrees, very bright oval/cylindrical object (approx. size of 2 to 3 book type match heads held at arm's length) at great distance out over Santa Lucias, should have been back lit which caught attention.  Sun&#8217;s reflection could not be on side observed as it was to back and left of object hence light was not reflection, but apparently originating from object.   Moving very slowly from left to right for less than 5 minutes and then simply, disappeared, vanished, gone.  Observed by both wife and self.  (This is same brilliance/non-reflection as was another sighting in same direction some 2 years ago, likewise in morning light which should have been only back lit.  Similar, prior sighting drifted towards me, maintain a dull yellow/tan bright color then morphed into a geometric &#8220;spiral&#8221; of 3 arms of 3 tendrils each with right angle bends.   I had not heretofore reported this prior sighting but have clearly remembered it since&#8230;. Similar in front lighting with sun behind, same general direction.)",
    "distance": 339.1959647534032
  },
  {
    "date_time": "10/30/2012 20:30",
    "shape": "Changing",
    "duration": "&gt;1 hour",
    "city": "Marana",
    "state": " AZ",
    "latitude": 32.4169584,
    "longitude": -111.1000819,
    "comments": "Orange lights appearing and disappearing around Marana  My husband saw orange lights appear and disappear as he traveled west on Ina road.  He picked me up and we got on I-10 to see if we could see them.  I spotted them about 3 miles outside of Marana heading north.  We pulled off the road.  They had disappeared at that point.  We waited about 10 minutes and then they appeared again.  They appeared and disappeared one at a time. We do not know how many there were.  This lasted for probably 20 seconds or so.  We waited again for about half an hour and they appeared again off in the distance.  They had moved quite a ways west but it is difficult to say how far.",
    "distance": 346.6363463072617
  },
  {
    "date_time": "11/5/2012 21:30",
    "shape": "Unknown",
    "duration": "30 minutes",
    "city": "Diamond Springs",
    "state": " CA",
    "latitude": 38.68329529,
    "longitude": -120.82125,
    "comments": "I would describe the objects as orange in color and moving across the sky at a slow to moderate speed keeping the same distance apart from the SE to the NE.    Looking at the objects through my binoculars, I could a slight shape that was jagged on the top and rough on the bottom kind of a triangle shape.  The objects moved at different speed and then stopped, as they were stopped the one in the trail position started glowing bright and dim about 5 to 6 times and then dropped what looked to me like a small missile but the light from that faded quickly, I saw that happen 3 times and the trailing object jest faded away and disappeared.    The other object still in one position started doing the same thing, started glowing bright and dim about 5 to 6 times and then dropped what looked to me like a small missile the light from the object it dropped also faded away quickly and the object also started fading until it disappeared.    I was with my wife and neighbor who also witnessed this event",
    "distance": 352.6793906066063
  },
  {
    "date_time": "11/17/2012 17:45",
    "shape": "Circle",
    "duration": "5 minutes",
    "city": "Santa Cruz",
    "state": " CA",
    "latitude": 36.98342284,
    "longitude": -122.0295131,
    "comments": "4 red/ orange orbs moved slowly across the sky together disappearing individually.  Three circular objects were moving slowly across the sky together, red/orange in color without flashing, no noise, under high clouds.  Individually they faded out.  I went inside and then out a minute later and there was one moving across the sky toward the east moving northward.  It flickered a bit and then faded out completely.",
    "distance": 352.91610534776464
  },
  {
    "date_time": "11/11/2012 18:15",
    "shape": "Formation",
    "duration": "1-2 minutes",
    "city": "Santa Cruz",
    "state": " CA",
    "latitude": 36.98342284,
    "longitude": -122.0295131,
    "comments": "Formation of 10 to 15 bright red-orange lights appeared over Monterey Bay in California  In the early evening on a clear night sky with calm winds (confirmed by weather stations), numerous (10 to 15) bright red-orange lights were seen over the Monterey Bay, in the central coast of California.   The lights appeared near the surface of the bay and looked to be slightly vibrating. However, there was no noise associated with the lights.  The formation of lights behaved analogously to a flock of birds in the sky.  Initially the formation was extremely tightly packed together near the ocean's surface.  The lights moved very fluently and had floating like motions in which the lights had the ability to move smoothly in all directions(up, down, right, left, etc.).    The lights began to spread out in a purposeful way with a triangular formation of three lights in the center (near the rear of fleet) remaining close together in that small triangle shape.  The lights were moving outward towards the open pacific ocean from the bay.  The lights that spread the furthest and were closer to the direction towards open ocean disappeared 1st then the rest sequentially disappeared, but almost simultaneously.  The light that was the closest to the oceans surface was the last to disappear but only by a small fraction.",
    "distance": 352.91610534776464
  },
  {
    "date_time": "11/3/2012 21:00",
    "shape": "Light",
    "duration": "1 hour",
    "city": "Burbank",
    "state": " CA",
    "latitude": 37.32529836,
    "longitude": -121.9378138,
    "comments": "Small motionless red flashing light.  Then it moves very slowly to another position. There is no noise.  Same flashing red light I saw at 5 o'clock am this morning.  It appears motionless for some time then very slowly moves to another position and stops.    I have seen air craft and they are always moving in a direction, this seems to be motionless for some time then moves.",
    "distance": 356.17751881662576
  },
  {
    "date_time": "11/3/2012 5:00",
    "shape": "Light",
    "duration": "1 hour",
    "city": "Burbank",
    "state": " CA",
    "latitude": 37.32529836,
    "longitude": -121.9378138,
    "comments": "A flashing red light to the right of the moon. motionless for 30 minutes then began to move west.   Stopped motionless for 20 minutes then began to move very slowly west.   Through my binoculars I could only see a flashing light.",
    "distance": 356.17751881662576
  },
  {
    "date_time": "10/29/2012 7:35",
    "shape": "Triangle",
    "duration": "1 minute",
    "city": "Burbank/Glendale border",
    "state": " CA",
    "latitude": 37.32529836,
    "longitude": -121.9378138,
    "comments": "I was driving from Burbank, CA towards Glendale, CA, on Glenoaks blvd.  As I looked up I realized an unusual object in the sky.  It had a triangular shape with white lights at each corner, and a big red blinking light in the middle.  It was floating around.  I decided to follow it, but it js zoomed off.  I came home and did some research to find that what I had seen others had seen as well.    So, therefore I am convinced that I saw a UFO.",
    "distance": 356.17751881662576
  },
  {
    "date_time": "11/3/2012 20:00",
    "shape": "Sphere",
    "duration": "1 hour",
    "city": "Elk Grove",
    "state": " CA",
    "latitude": 38.43556808,
    "longitude": -121.3778503,
    "comments": "Orange Orbs  I was leaving a store around 8pm and looked up for the moon. I noticed orange/yellow pulsating lights ascending from the north/east part of the sky.  First I thought they were the street lights but there were too many of them and they were forming patterns, there were about 12 orange/yellow orbs. They were orange in the middle and yellow around them. They looked like pulsating balls of energy.  I watched them for for five minutes across the street before calling my wife. I told her to go outside and look east but her view from our home was obstructed and too far away.  They formed into two circle patterns and then broke away from each other and then reformed into two circles again.  I watched them for another 5 minutes and came home.  I grabbed the video camera and went back to the store, all but two had left.  I tried to record them but they wouldn't show up on the camera.  And then a few minutes later they both extinguished.   Also when I arrived back for the second time there was an ambulance and firetruck in the parking lot where I had seen them and the paramedics had loaded someone into the ambulance.  The orbs had been right over where the ambulance and firetruck were and I'm not sure if that was just a coincidence.  My feeling of the objects was just amazement and awe.  After this happened I posted my sighting on the Mufon website. Well on November 7 I had another experience.  I was at the store the same store where I had first saw these orbs and went to swipe my rewards card and all 4 of the self checkouts simultaneously froze.  I didn't think anything of it but then about ten minutes later I was at a drive through restaurant and saw one singular orb, the same color and distinction as the previous ones.  I went to ask a group of people if they saw it too, turned around and it was gone.  Now this was bizarre.  When I told my wife she became concerned and told me that the only way to get rid of them is through prayer and she prayed that they will leave me alone.  Haven't seen anymore, but I am still curious.  I don't know what the hell they were.  I didn't follow up with Mufon because it is scary and I don't want any investigation as to what they are,  I don't think that I want to know.  Someone said they could be plasma balls controlled by magnetism, but I'm not sure what I believe or who is responsible.",
    "distance": 365.9402204910774
  },
  {
    "date_time": "11/14/2012 20:10",
    "shape": "Light",
    "duration": "10 minutes",
    "city": "Union City",
    "state": " CA",
    "latitude": 37.60397097,
    "longitude": -122.0206304,
    "comments": "12 red color UFOs, at Union City, Ca    they are red color, and much higher than airplant. they are disappearing one by one at the same spot on the sky.  (It is like go away from earth,that kind of disappear)",
    "distance": 367.8884677083735
  },
  {
    "date_time": "11/14/2012 20:08",
    "shape": "Light",
    "duration": "18 minutes",
    "city": "Union City",
    "state": " CA",
    "latitude": 37.60397097,
    "longitude": -122.0206304,
    "comments": "12 Orange Lights Flying Objects  At first I saw 8 orange &quot;lights&quot; on the sky, they followed each other one by one in a curve line. They were heading toward the same direction, and eventually disappeared at the same point on the sky.  After about 20 seconds 2 more &quot;lights&quot; came to that position again, and they disappeared at the same place.  At that time I saw some planes are flying around that area.  And then there was no more weird stuff any more, so we drove away.  Several minutes later we saw 2 more again, but since we were driving we didn't pay much attention to those.  The brightness and the color of the flying objects are pretty similar to the street lights.",
    "distance": 367.8884677083735
  },
  {
    "date_time": "11/7/2012 21:30",
    "shape": "Triangle",
    "duration": "30-45 seconds",
    "city": "Tucson",
    "state": " AZ",
    "latitude": 32.19471234,
    "longitude": -110.83235049999999,
    "comments": "Bright, orange, triangular light north of Tucson moving towards the south then turning east and disappearing  A bright, orange, triangular light appeared in the NNE ski from NW Tucson (Marana), approximately 30 deg above the horizon.  It was moving at a fast airplane speed towards the south.  Thought it was a meteorite at first, but moved too slow for that.  We watched it for about 20 seconds as it moved almost directly towards us then it suddenly turned toward the east and quickly faded away and disappeared.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 368.3288116554118
  },
  {
    "date_time": "11/9/2012 23:00",
    "shape": "Light",
    "duration": "15 minutes",
    "city": "Antioch",
    "state": " CA",
    "latitude": 37.9871287,
    "longitude": -121.7955986,
    "comments": "3 BRIGHT ORANGE LIGHTS HOVERED IN SKY.  Two bright orange lights hovered in the same place for 5 minutes.  Then one faded out and reappeared on the other side of first light.  Then third light below appeared.  They stayed for 10 minutes then one by one blinked out.",
    "distance": 368.7458101718174
  },
  {
    "date_time": "11/15/2012 7:45",
    "shape": "Light",
    "duration": "still happening",
    "city": "Lakeside",
    "state": " CA",
    "latitude": 38.41638433,
    "longitude": -121.47065330000001,
    "comments": "I am an advertising company owner and my son and his girlfriend are in the hospitality business. We were outside and noticed movement in the sky, at least 15 orbs of light were going in and out of the clouds &quot;playing.&quot;  It's an amazing sight!  We thought at first they may be a spot light of some sort but the orbs did not make routine movements they flitted here and there in all different directions and moving around each other.  Unfortunately our video camera was not with us, I would love to share this with everyone.",
    "distance": 369.30949893234674
  },
  {
    "date_time": "11/11/2012 21:00",
    "shape": "Unknown",
    "duration": "1 hour",
    "city": "Warm Springs",
    "state": " NV",
    "latitude": 39.68731651,
    "longitude": -119.96751189999999,
    "comments": "pulsating orange lights by area 51  saw your report on rense-i drive out to our refinery about 5 times a week past (road to area 51) tonopah, nv.  at night past base camp, on to mile post 106 on hiway 6-i see these orange pulsating stuff out there like your reporting-  i see it all the time sometimes they &quot;fly&quot;  right in front of me, kind of showing off-  it is very quiet out there-  very few cars.  i now have my sony camera with me because the dash cam did not show them very well.  will e mail you if i get some good photos",
    "distance": 372.63538082634796
  },
  {
    "date_time": "10/31/2012 22:25",
    "shape": "Sphere",
    "duration": "10 seconds",
    "city": "Sacramento",
    "state": " CA",
    "latitude": 38.57639834,
    "longitude": -121.463047,
    "comments": "Soundless gray sphere near Sacramento International airport  I live 7 miles southeast of Sacramento Intl airport and see and hear aircraft constantly.  On Wed 10-31-12 at 10:25pm while standing just outside my garage door I noticed a soundless low flying sphere shaped object heading north approx 150 ft up and estimated 500 yds away to the NW of my position on Del Paso Road.  There were no lights on it or coming from within, but it appeared gray in color at night.  It was moving way faster than a bird could fly.  It flew in a straight line north but seemed to bob up and down irregularly. Then suddenly, just before it left my line of sight right above the distant tree line, it vanished for a split second then I saw a brilliant white/yellow flash.  What baffled me most was the shape and size of this flash.  Its shape looked like a pie slice with hard edges and about 5 times the original size of the sphere.  The duration of the event was no longer than 10 seconds.    There was a light rain falling and calm winds.  Gray.",
    "distance": 375.34217550098526
  },
  {
    "date_time": "11/10/2012 23:20",
    "shape": "Triangle",
    "duration": "20 seconds",
    "city": "Roseville",
    "state": " CA",
    "latitude": 38.76909448,
    "longitude": -121.2899943,
    "comments": "A v shape triangle UFO glided across the night sky in Roseville, CA.    It only happened minutes ago, and while I have seen what I thought was a UFO, this is the only that has scared me to death.   I feel very scared because it was flying very low, probably at about 1000 feet.  Minutes later a light beam crossed the sky in the other direction.    ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 375.9486042131778
  },
  {
    "date_time": "11/5/2012 0:00",
    "shape": "Disk",
    "duration": "hour",
    "city": "Spring Creek",
    "state": " NV",
    "latitude": 40.715486600000006,
    "longitude": -115.57957739999999,
    "comments": "This wasn't just a normal sighting we had time to get a telescope and point it south over lamoille canyon (south).    All four of us saw a white coin shaped object.  Outlining the craft was a bright green light.  From the naked eye it flashed colors.  The telescope revealed runes on whatever it was.   Shortly after we drove.  I looked east towards Wells and saw a Huge vapor trail 3 times the width of the moon and miles wide.    We pulled over to inspect it.  It was long and would pinch off at points and expand.    We continued down the road and saw a blue streak shoot north across our windshield quickly.  It was huge with blue tracers unlike a comet meteor or shooting star.  ((e-address deleted))",
    "distance": 377.4705194085392
  },
  {
    "date_time": "11/14/2012 22:45",
    "shape": "Diamond",
    "duration": "5 seconds",
    "city": "Berkeley",
    "state": " CA",
    "latitude": 37.87934951,
    "longitude": -122.27793759999999,
    "comments": "Green non flashing flies north diamond in shape  2 green bar lights surrounding a rectangular block   Object diamond in shape.  Close to ground no streaks of light, solid flow no flashing.  Object hovered then flew towards north.  Seen over Emeryville/Berkeley above 80 freeway towards sacramanto",
    "distance": 388.6784444059436
  },
  {
    "date_time": "11/18/2012 18:00",
    "shape": "Changing",
    "duration": "2 minutes",
    "city": "Olivehurst",
    "state": " CA",
    "latitude": 39.08392185,
    "longitude": -121.54707749999999,
    "comments": "2 Sightings in one day  Driving southbound to go home my husband and I saw a weird shape in the sky during daylight. It appeared translucent and we had thought it might have been a plastic bag at first.  It then was a lot bigger with a round shape but as it started going off in the distance looked like it changed shape.  Later that night we had seen a large object that appeared like it was touching down with large red flashing lights.  Our attention was on this triangle shaped object that we failed to notice the hovering, identical craft right above it.  We only saw this long enough for us to get on the exit and it disappeared.",
    "distance": 400.3777534454224
  },
  {
    "date_time": "11/10/2012 18:20",
    "shape": "Fireball",
    "duration": "12 minutes",
    "city": "Payson",
    "state": " UT",
    "latitude": 40.03553237,
    "longitude": -111.73636850000001,
    "comments": "ORANGE BALL OF FIRE  Orange in center Yellow second layer with Red on the third layer barely visible outer perimiter layer, looked like it was on ball of Fire with the flames etc as it headed toward us, as it passed over, it seemed to be close it would hover and come to a complete stop, without any kind of a sound and then change directions or speed up suddenly as it headed toward North (toward Spanish Fork?).  as it completely disappeared far North (the light seemed to suddenly turn off, just before it was completely out of eye sight, when we turned around or looked up it would be instantly back again just either right south of us headed toward us again, or suddenly right over our heads, until it disappeared again, and then this process repeated again three to four times...it looked quit different from the back and not as bright; flatter with three spaced out circles the middle being the largest of the three.  From the back the lights flashed on and off once in awhile, but when it flashed it flashed to a red or to an orange (from the back only) the front always stayed the same looking like a ball of fire. It made no sound and the last pass was unusually close overhead.",
    "distance": 405.92006589567177
  },
  {
    "date_time": "11/10/2012 21:30",
    "shape": "Light",
    "duration": "~10 minutes",
    "city": "San Anselmo",
    "state": " CA",
    "latitude": 37.98547861,
    "longitude": -122.5697147,
    "comments": "Red/orange noiseless lights in formation at low altitude.  I was closing my bedroom window when I noticed a very bright red/orange light coming over Mount. Tamapais (from a westerly direction).  It was too low to be a plane, so I ran outside to the front yard, and looked up the street towards the mountain.    There I saw at least 5 more of the same craft, slowly hovering, moving East, over the valley where we live. More appeared over the course of the next 5 minutes.  They were in formation, moving towards us, like they would land soon in the street in front of us.    My neighbors were also outside observing the lights. They were noiseless, moved always in formation, and in the next 5 minutes, seemed to move South, and disappear.    My husband used binoculars, and said they looked &quot;diamond&quot; in shape, said it was hard to define the shape.  Very bright, deep, orange/red.",
    "distance": 406.1873879274664
  },
  {
    "date_time": "11/10/2012 21:15",
    "shape": "Changing",
    "duration": null,
    "city": "San Anselmo",
    "state": " CA",
    "latitude": 37.98547861,
    "longitude": -122.5697147,
    "comments": "Unexplainable 30 reddish lights in sky in varying formation over San Anselmo, CA.  Citizen reported to the police department that she observed approximately 30 red lights in the sky varying in formation.  She took photos on her iPhone from her bedroom.",
    "distance": 406.1873879274664
  },
  {
    "date_time": "11/14/2012 21:45",
    "shape": "Other",
    "duration": "2 minutes",
    "city": "Tooele",
    "state": " UT",
    "latitude": 40.54759431,
    "longitude": -112.3082895,
    "comments": "Rotating-Steady set of lights in the sky in Western Utah near (just south of) the I-80 corridor.  On Wednesday November 14, 2012, at 21:45 Mountain Time, looking west towards the mountains just west of Tooele Army Depot (possibly as far west as North end of Dugway Proving Grounds), I observed for approximately 2 minutes, clock-wise rotation of lights in the sky.  The lights &quot;disappeared&quot; on the southern end of the object, and &quot;appeared&quot; on the northern end of the object.  With each single light, it appeared to rotate in a clockwise rotation, held steady in the sky, and did not hear any sound.  There did not appear to be any other aircraft in the surrounding area in the sky.   In reading Utah reports, the report submitted for 08/15/2012 @ 07:30 in Tooele reads exactly also like what I witnessed.  However, I observed that rotation and lights for a longer duration.  I did capture one very grainy picture via my cell phone.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 418.5615526483718
  },
  {
    "date_time": "11/14/2012 20:00",
    "shape": "Light",
    "duration": "2 minutes",
    "city": "Orem",
    "state": " UT",
    "latitude": 40.3008719,
    "longitude": -111.6996462,
    "comments": "We saws ourselves up in the sky! some UFO's! they were blinkin up theres, from red to white.  Up there a scheming.  There were 7 and they slowly dropped off one by one. UFO's!",
    "distance": 421.8182839417484
  },
  {
    "date_time": "11/14/2012 21:20",
    "shape": "Fireball",
    "duration": "5 minutes",
    "city": "West Jordan",
    "state": " UT",
    "latitude": 40.60761595,
    "longitude": -111.996137,
    "comments": "We were in our car driving west (oquirrh mountains). I look up and I thought I saw a shooting star because I see a big ball with little lights coming from behind it.  So I turn to my husband and I ask him if he can see what I'm seeing. We are stopped and we are just staring at it and it's so big and bright and not moving.  There is no way it could be a plane.  So we are looking at it trying to figure out what it is and then all of a sudden the little lights behind the big ball of fire just turn off one by one and then it just disappears.   We tried to search for what we saw in the sky but we couldnt find it again.  It was so big I want to know if anyone else saw what we saw or can explain it.",
    "distance": 430.64315057719455
  },
  {
    "date_time": "11/13/2012 19:00",
    "shape": "Circle",
    "duration": "1-2 seconds",
    "city": "Sebastopol",
    "state": " CA",
    "latitude": 38.4013622,
    "longitude": -122.83100590000001,
    "comments": "Circular fast-moving object appears in early evening sky in Northern California.  I was sitting on a bench in my apartment complex, looking at stars.  I looked up at the sky straight ahead of me and saw a round object approximately 20-30% of the size of the moon, moving very fast in what appeared to be a northward direction.  I heard no sound.  The most startling aspect was the speed which this object moved and that I had seen a similar, but larger object moving in a different direction yesterday.",
    "distance": 431.8176880808632
  },
  {
    "date_time": "11/12/2012 6:30",
    "shape": "Circle",
    "duration": "1-2 seconds",
    "city": "Sebastopol",
    "state": " CA",
    "latitude": 38.4013622,
    "longitude": -122.83100590000001,
    "comments": "Fast moving large circular object appears in early evening sky in Northern California.  I was sitting on the patio of the community building in my apartment complex, looking at stars and a few airplanes descend or ascend.  This is approximately 50 miles north of the San Francisco airport.  I looked at the sky straight ahead of me and saw a round object approximately half to one-third the size of the moon, moving very fast in what appeared to be a westward direction.  It disappeared behind trees, which there are a fair amount in this area.  I heard no sound.  The most startling aspect was the speed with which this object moved.",
    "distance": 431.8176880808632
  },
  {
    "date_time": "11/14/2012 21:15",
    "shape": "Rectangle",
    "duration": "15-20 seconds",
    "city": "Salt Lake City",
    "state": " UT",
    "latitude": 40.78590003,
    "longitude": -111.95788529999999,
    "comments": "Eight dim red rectangles in a string traveled slowly then went out one by one, appearing to dissolve.  My friend and I, both men, were traveling westbound on 300 E 7000 S in Salt Lake City, Utah, at 9:15 pm on Wednesday, November 14 2012.  I first noticed the string of approximately 8 rectangular objects in a line traveling northbound towards the Salt Lake City Airport just faster than a plane would have traveled on approach, which still appeared slow.  Together they formed a line approximately 2 - 3 times the length of an airplane in the sky, and as thick as two airplanes stacked on top of each other. They appeared to be a little bit higher in the sky than the approaching planes.  The objects were very close to each other, but had a distinctly dividing black line between each light.  Each rectangular object shined dimly in red light.  I alerted my friend and asked &amp;quot;What is that?&amp;quot;.  He noticed it and we both watched it travel from south to north for about 10 - 15 seconds.  Then, the first in the line went out followed closely by the second then the third a! ll the way back to the end of the line.  The manner in which they turned off made the string appear to dissolve away.",
    "distance": 442.15087571496946
  },
  {
    "date_time": "11/5/2012 6:45",
    "shape": "Triangle",
    "duration": "20 minutes",
    "city": "Salt Lake City",
    "state": " UT",
    "latitude": 40.78590003,
    "longitude": -111.95788529999999,
    "comments": "((NUFORC Note:  Witness provides no information.  PD))",
    "distance": 442.15087571496946
  },
  {
    "date_time": "11/17/2012 3:00",
    "shape": "Light",
    "duration": "90 minutes",
    "city": "Salt Lake",
    "state": " UT",
    "latitude": 40.83557401,
    "longitude": -111.91182309999999,
    "comments": "Bright orange lights hovering in the sky.  I noticed a bright orange light in the sky.  There was a slight cloud cover, but I could still see this orange light.  I was not sure what it was so I watched it for a while.  It appeared that another light and up to 2 more lights appeared and stayed together in the same area.  They appear like a star but I have never seen stars or planets that are in this area that are orange.    I work night shifts so I am awake at night.  These lights are still there.  I can distinctly see two of them.  They are not moving.  They appear to just be sitting in the same spot. I wondered if it was a reflection of some sort but I don't know of what. It almost has the color of fire in the sky. They appear to be definate points of light, like a star, but I have seen up to three of them, then it goes down to two or one. Right now I can see two. I will keep watching to see if I can figure out what this is.   ((NUFORC Note:  Possible sightings of stars??  PD))",
    "distance": 446.33719168533844
  },
  {
    "date_time": "11/11/2012 22:30",
    "shape": "Unknown",
    "duration": "unknown",
    "city": "Mancos",
    "state": " CO",
    "latitude": 37.34482018,
    "longitude": -108.292772,
    "comments": "Unidentified tracks near 5 households appear overnight  On the night of Sunday the 11th my neighbor noticed strange tracks in her driveway.  The following day she called me to know if I had seen anything strange. In my driveway I found a multitude of single line tracks in the gravel of my yard some of which came right up to my house.  We checked with our other neighbors and found that in total 5 households within a 1/2 mile had been &amp;quot;visited&amp;quot; by the same single tracked entity.  I called to find out if someone had surveyed our area recently but there are no human foot prints associated with the straight line tracks we have observed  (Some of these are in soft dirt and snow and there are no associated prints or tread marks within the tracks) which resemble a heavy ball rolling up and down hill.  These tracks are very smooth and some enter very small areas ( between fence posts and under downspouts) and move with precision.  We have pictures and maps of all the tracks we could find.",
    "distance": 456.23094620080565
  },
  {
    "date_time": "11/15/2012 19:45",
    "shape": "Light",
    "duration": "10 minutes",
    "city": "Ogden",
    "state": " UT",
    "latitude": 41.31372756,
    "longitude": -111.9602794,
    "comments": "Unusual, Twinkling orange light, hovering, then ascending  Looked up to see strange orange light, appearing to move silently towards us, at a very low altitude.  Watched as no sound could be heard, trying to judge distance, then slowly ascended till gone.  See many aircraft around, but this was very unusual, and peculiar.",
    "distance": 473.5022928195599
  },
  {
    "date_time": "11/11/2012 18:45",
    "shape": "Triangle",
    "duration": "2:00 minutes",
    "city": "Grand Junction",
    "state": " CO",
    "latitude": 39.07100311,
    "longitude": -108.5478064,
    "comments": "Night time. Large triangle w/3 lights sighted hovering 75 ft over ground. Banked and flew fast over city, lost altitude then vanished  Night time. Driving northward on Redlands Parkway. See bright white lights hovering over neighborhood.  Closed distance and observed three bright white lights in an equilateral triangle pattern and two smaller red blinking lights (one dead center, the other between two of the triangle points) hovering perfectly still about 75-100 ft above ground.  Could vaguely make out a the dark edges of the hull- also a perfect triangle.  Turned onto South Rim Drive to pursue but upon making my turn the craft banked and sped along the geologic ridge.  I think they were watching me.  Observed the craft fly south, then bank southeast, then bank again northwest and fly directly over the city at about 200 ft altitude.  Craft gradually lost altitude over St Mary's Hospital, then vanished.",
    "distance": 490.42606304016414
  },
  {
    "date_time": "11/2/2012 21:18",
    "shape": "Circle",
    "duration": "1 minute",
    "city": "Logan",
    "state": " UT",
    "latitude": 41.75154838,
    "longitude": -111.82442879999999,
    "comments": "Orange lights in the sky  I went out to let the dogs inside and saw 6-8 bright orange lights low in the sky, but arranged like a constellation.    I was fascinated and watched them moved around a little almost like a satellite, but there was no pattern and they always moved back.    After about 30 secs I went to get my camera and when I came back outside (15secs later) all but 4 had dissppeared.   I watched as the last 4 slowly faded away.",
    "distance": 503.37850300158834
  },
  {
    "date_time": "11/6/2012 23:15",
    "shape": "Sphere",
    "duration": "1 minute",
    "city": "Twin Falls",
    "state": " ID",
    "latitude": 42.56270296,
    "longitude": -114.45769879999999,
    "comments": "Heading west on 2700 towards filer     Orange sphere in sky then suddenly disappeared to the west at a high rate of speed it was a clear night",
    "distance": 511.54736884004495
  },
  {
    "date_time": "11/9/2012 23:00",
    "shape": "Unknown",
    "duration": "explosion",
    "city": "Albuquerque",
    "state": " NM",
    "latitude": 35.09914887,
    "longitude": -106.6094405,
    "comments": "unknown explosion over Albuquerque NM.  I am a security officer in the Ventana Ranch area of Albuquerque NM during the midnight shift 20:00 - 04:00.    Some time between 23:00 11/09/2012 and 00:00 11/10/2012 myself and my partner were on patrol in the neighborhoods and watched a slow moving blue light cross the sky over the east mountains of Albuquerque.    Within minutes of seeing it there was a HUGE flash of white/blue light (lighting up the entire sky) focused on the light we saw descending on Albuquerque.    The light disappeared and there were several flaming balls of light falling like embers.    There was no sound or blast after the explosion.  It seems that some craft entered and exploded over either Albuquerque or the East Mountains.    I have never seen anything like it and would like to know what I saw&#8230;",
    "distance": 534.3600884477263
  },
  {
    "date_time": "11/9/2012 23:00",
    "shape": "Flash",
    "duration": null,
    "city": "Albuquerque",
    "state": " NM",
    "latitude": 35.09914887,
    "longitude": -106.6094405,
    "comments": "Blue/Green streaming flash of light shooting towards and over the Sandia Mountains near Tramway.  Driving toward the Sandia Mt. on Tramway we saw a big flashing stream a blue green light much like a rocket firecracker only it was as high in the sky as the Sandia Mt. shooting toward and over the mountain.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 534.3600884477263
  },
  {
    "date_time": "11/7/2012 14:00",
    "shape": "Light",
    "duration": "20 minutes till who know",
    "city": "Albuquerque",
    "state": " NM",
    "latitude": 35.09914887,
    "longitude": -106.6094405,
    "comments": "A star, a planet?  Can't possibly be.  North of the Sandia mountains, red, blue, &amp; green lights constantly blinked &amp; the object stays in same spot.  I did not check this object later, but I am going to check again tomorrow.  My brother who wittnessed this with me says he sees this same blinking object where he resides in Placitas, NM.  He says that the object is not there all of the time.  How interesting.  I am wondering what this object could be?  What would flash/blink those kind of colors?  I always figured Stars had color &amp; twinkled, but not the way this object does. Wow, I wonder.",
    "distance": 534.3600884477263
  },
  {
    "date_time": "11/4/2012 12:00",
    "shape": "Unknown",
    "duration": "10 seconds",
    "city": "Albuquerque",
    "state": " NM",
    "latitude": 35.09914887,
    "longitude": -106.6094405,
    "comments": "I believe I saw a UFO today ...... small object, moving slowly at first, picked up speed, and then accelerated to a very high speed.  I posted this on Facebook this evening. 11-04-12 - Sunday.  Okay. So I was working in the backyard today (Sunday, Nov 4th, 2012) and stopped to take a break. This was around noon.  I was looking at the beautiful New Mexcio clear blue sky.  Looking directly north up at the sky at about 50 degrees, a white object appeared out of nowhwere.  It started off slowly and began moving in a straight line directly east towards the Sandia Mountains.  I couldn't gaug e how big the object was nor how high it was.  It appeared to be pretty high, object was small and appeared white.  As it moved east, it slowly picked up speed and then &amp;quot;whoosh!&amp;quot;, .... it went so fast it was gone in a heartbeat.  Now I consider myself a pretty level headed person.  I'm not big on conspiracy theories, contrail chemicals, government cover-ups, or .... UFOs.  But ..... I know what I saw. I live in Paradise Hills was was looking north when I saw this.  Question:  Did anyone else in the Albuquerque area see this?  No .. I wasn't drinking nor taking drugs.  And yes .. I was plenty hydrated.  My primary need is I would like to know if anyone else witnessed this??? Thanks.",
    "distance": 534.3600884477263
  },
  {
    "date_time": "11/3/2012 0:00",
    "shape": "Disk",
    "duration": "&lt;10 seconds",
    "city": "Albuquerque",
    "state": " NM",
    "latitude": 35.09914887,
    "longitude": -106.6094405,
    "comments": "green orb like ufo new mexico albuquerque 11/3/12  While driving on the freeway just entering albuquerque i saw a light to the left side on my dashboard window.    At first i thought it was a shooting star until in got closer.  It flew across my as i looked closer windshild at a constant speed. Not very fast, and not like any aircraft ive ever seem.  If almost seem to be hoovering yet wobbling.  It was glowing with a green orb like light and for it being so close it did not make a sound.",
    "distance": 534.3600884477263
  },
  {
    "date_time": "11/10/2012 5:39",
    "shape": "Changing",
    "duration": "still seeing them",
    "city": "Nampa",
    "state": " ID",
    "latitude": 43.58099384,
    "longitude": -116.56747779999999,
    "comments": "bright multi colored orbs/UFO'S.  We are looking at them as i write this they are fairly low in the sky and are what we would describe as bright multi colored orbs.  That change shape as well as color.    We have been observing these UFO's for over a month now and this is the second encounter where they have been sitting this low in the sky.",
    "distance": 575.1189076511617
  },
  {
    "date_time": "11/5/2012 23:00",
    "shape": "Other",
    "duration": "2.5 seconds",
    "city": "Boise",
    "state": " ID",
    "latitude": 43.61401228,
    "longitude": -116.24745159999998,
    "comments": "Supersonic, silent aircraft with multiple lights, and one extremely bright white flashing light.  11:00pm (approx) sky conditions: night, mostly clear, little ambient brightness, dim moon  PRE-SIGHTING  I was walking towards a house, about to knock on the door to enter when a helicopter began to amble by, a few hundred feet off the ground parallel to me, maybe half a mile away. the fact that it sounded heavy and had distinct lighting gave me the impression that it was a military helicopter, so i studied it as i knocked on the door. it was flying West to East.  SIGHTING  it was at this point an object emerged from the eastern horizon, flying east to west at over supersonic speeds. it flew maybe 800+ feet above (although not directly 'above', likely on its flank a bit as it was hard to tell from my angle) the chopper. it made no sound at all and gave no heat or other effects and crossed the entire sky in about 2 and a half seconds.  It had one indescribably bright light on the center of the object, that flashed at regular intervals. the 'light' had only a few chances to flash due to the objects' speed. the light was so bright, so intensely white that you could see every color of the rainbow streaming within the light. there were perhaps other, dimmer white lights that stayed on constantly, placed around the craft.  The main body of the craft was very hard to distinguish in the darkness, but the lights on its own body gave some ambient illumination to itself. i could barely make out the greyed outline of a bizarre, somewhat triangle shaped craft. when the light would flash, it would be blocked out by the intensity. when it was off briefly, there was still light emerging from the craft, although not as bright. the lights on the object far outshone that of the helicopters', even the moon. the light was distinctly inhuman.  Because of the sudden nature of the event, i did not really try to make sure i would remember the details of the craft itself, as i was still what i would describe as 'calmly-lobotomized', staring like an idiot into the sky away from their house as someone opened the door.  I believe there is a possibility that the chopper pilots may have also seen the craft, although given its speed and silent nature there is a chance they only saw a white flash in the corner of the eyes. Choppers seemed to remain in the sky for the rest of the night as i saw one driving a few hours later and also heard another when i got home.  I give an estimate of 900+ feet for the elevation of the craft, and perhaps about the size of a good boat, quit a bit larger than a fighter jet.  I have seen F-16s, F-15s, F-22s, F-18s, MiGs, at night, at day, flying high, low, supersonic, really slow, you name it. I have looked down the barrel an A-10 Warthogs' Gatling gun.  I  have seen b-2 spirits, Stealth fighters, both parked and flying in close detail(although men guarded the F117 nighthawk) i have been in a V-22 Osprey helicopter, hueys, Apaches, UH-60 Blackhawk, freaking chinooks.  I have been on countless commercial aircraft of all make and size my whole life.  This was NOT a known aircraft, to be certain. it demonstrated distinctly inhuman traits. if it was human, i conjecture top secret military craft.  It should be noted that this was certainly a 'craft', and not a natural phenomenon.  It was NOT a meteor or balloon of any type.  It was not ball lightning. it was not an aurora,a moon halo, it was not swamp gas, sun dogs, it was not a lenticular cloud, or any other type of electromagnetic/plasma phenomenon. it was not gary busey eyeing the world dangerously as he travels in his home-made craft powered out of fear and childrens' screams. it was not santa, it was not a satellite, it was not a missile test. as someone who is extensively familiar with both military/civilian aircraft and astronomical phenomenon, all i can say with absolute assurance is this was an unidentified, constructed object exhibiting inhuman traits flying in proximity to aircraft with zero explanation and no other way of seeing it was there (radar?) other than eyesight.",
    "distance": 576.8720165267774
  },
  {
    "date_time": "11/3/2012 19:50",
    "shape": "Rectangle",
    "duration": "4 minutes",
    "city": "Eureka",
    "state": " CA",
    "latitude": 40.7899683,
    "longitude": -124.1652006,
    "comments": "November 3, 2012 Time: approx. 7:50pm Eureka, CA UFO spotted travelling from East to West over Eureka.  Large orange flickering object moving slowly overhead.  NO sound was detected.  Unlit portions of object were vaguely distinguishable in the night sky.  As object approached western horizon small glowing pinpoints of light ( three to four) appeared to shoot out in front of the object as it appeared to increase speed before plummeting out of view.  It seemed to flicker out once, then come back before falling out of view.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 582.3433829773193
  },
  {
    "date_time": "11/4/2012 18:34",
    "shape": "Fireball",
    "duration": "~3 seconds",
    "city": "Ranchos de Taos",
    "state": " NM",
    "latitude": 36.36515077,
    "longitude": -105.600834,
    "comments": "Large westward moving blue-white meteor  18:34 MT seen from Taos, NM  This was almost certainly a large meteor.  It was a very bright white (nearly blue-white) ball.  It appeared directly overhead and headed straight west at high speed covering 30 to 35 degrees of sky in approximately 3 seconds.  It then appeared to simply go out, which I assume was its  burning up in the atmosphere.  I have witnessed many meteor showers and this was very similar.",
    "distance": 591.3464061622655
  },
  {
    "date_time": "11/4/2012 14:30",
    "shape": "Rectangle",
    "duration": "1-2 minute",
    "city": "North Hollywood",
    "state": " CA",
    "latitude": 41.76790159,
    "longitude": -124.2197903,
    "comments": "Woman witnesses a very strange, rectangular object, which suddenly accelerates and zips off.  TELEPHONED REPORT:    A young woman telephoned the NUFORC Hotline at 15:04 hrs. to report having witnessed a very strange looking, rectangular object, hovering beside the highway she was driving.  She reported that she slowed her car, in order to get a better look at the object, which then suddenly accelerated, and almost instantly disappeared from her sight.  She said that she will submit a written report from her workplace on Monday, November 05th.",
    "distance": 628.5567237155616
  },
  {
    "date_time": "11/4/2012 13:00",
    "shape": "Rectangle",
    "duration": "2 minutes",
    "city": "North Hollywood",
    "state": " CA",
    "latitude": 41.76790159,
    "longitude": -124.2197903,
    "comments": "Silvery and very distinct  tail lights super fast  I was the passenger of my boyfriend's car, we were going east on Magnolia Blvd.  Less then half a block before we turn, I was looking up and barely above this two story apartment building, I noticed this rectangular shaped silvery moving object.  It looked like the back end with two small red tail lights and a exhaust pipe.  It was almost like something out of Star Wars.  I started kind of yelling oh look at that to my boyfriend but, he couldn't of course because he was driving.  Turning right on to Riverton Ave.  I was still looking up at the sky and noticed that the object had ascended 150 ft. high, but I could still see the silvery object.",
    "distance": 628.5567237155616
  },
  {
    "date_time": "11/7/2012 3:15",
    "shape": "Light",
    "duration": "1 minute",
    "city": "Studio City",
    "state": " CA",
    "latitude": 41.85361957,
    "longitude": -124.1497348,
    "comments": "Bright flash of light appears from deep space blackness 7 or 8 times and then suddenly disappears  My wife and I were star gazing after the election on Nov. 6th.  After we missed the Orionids, due to rainy/cold conditions, we made it our mission to see the Taurids early morning light show Nov. 4th and 5th.  We are both extreme creatures of habit, so staying up late to seek shooting stars has become our normal routine.  Together, we've probably seen over 75 shooting stars in the last 5 days, but what we saw last night was most certainly not like anything either of us has ever seen.  At around 3:15 am PST, my wife pointed at the sky to where she had just seen a bright flash of light between the constellation of Orion and Jupiter.  Being that we are very close to LAX, when I saw the blink of very bright white light a few seconds later, I immediately thought it was an airplane.  However the light did not appear to have any sort of intervaled blinking and it did not move.  It was Bright! Brighter than even Jupiter, which was to the NW of the flash.  Through my binoculars I saw the flash come and go about 4 times.  Each was abrupt, bright, and in the same spot between two very small distant stars. Based on the other celestrial and orbital objects around it, this light appeared to be coming from deep space.  No object or shape could be made out, but it lit up approx. 7 or 8 times within a minute and then disappeared.  I've spent the last 24 hrs researching Weather Balloon citings, Iridium Flares, and other logical explanations for what we saw.  None of them have even come so close as to mimick our happenstance.    Needless to say, we're out here again tonight!  I don't see this curiousity ceasing ANYtime soon.",
    "distance": 629.9915332769107
  },
  {
    "date_time": "11/3/2012 19:50",
    "shape": "Disk",
    "duration": "10 seconds",
    "city": "Studio City",
    "state": " CA",
    "latitude": 41.85361957,
    "longitude": -124.1497348,
    "comments": "Bright green lights hover over Los Angeles then back down to earth.  It was flat and round with 3 bright green lights with a red light behind the green lights.  It went straight up then just stopped suddenly and hovered for about 3 seconds then slowly ascended back down to earth out of our view.  It WASN'T a helicopter or anything either of us had ever seen.  It was flat, like a round trash can lid.  Couldn't really tell the size cause of how far away it was but it looked fairly big cause of how bright the green lights were.   ((NUFORC Note:  Witness provides no contact information.  PD))",
    "distance": 629.9915332769107
  },
  {
    "date_time": "11/8/2012 23:00",
    "shape": "Unknown",
    "duration": "20 seconds",
    "city": "Pueblo",
    "state": " CO",
    "latitude": 38.36518317,
    "longitude": -104.7067416,
    "comments": "Huge smoke like trail going across the sky  I was on my way to get my mother from work about 11:00pm downtown in Pueblo, Colorado, on the night of 11/8/12.    Heading from North to the South I saw a huge white cloud looking object appear and go across the sky and then disappear, kind of how airplanes leave a trail of smoke, only this was much larger and late at night.  It lasted about 20 to 30 seconds.   I saw it while I was driving and didn't know what I was seeing.    I pulled over to check it out.  It went across the sky very fast but the stream behind it was extreamly long and lasted a long time.",
    "distance": 663.6482290022938
  },
  {
    "date_time": "11/8/2012 1:30",
    "shape": "Fireball",
    "duration": "2 minutes",
    "city": "Pueblo",
    "state": " CO",
    "latitude": 38.36518317,
    "longitude": -104.7067416,
    "comments": "Multicolored flashing ball of light (disco-ball)  At approximatly 1:30 am i took my dogs outside to relieve themselves and was looking up at the night sky when i noticed a ball of light that flashed multiple colors white then blue then green the yellow then red and so on.  It was stationary and never moved but it was bright and not anything like a planet or star.  I've seen these objects here in Pueblo before.    About 4 years ago i was talking a walk through the park late at night and there must of been 10 to 15 of these lights in the sky.  I've never seen these lights anywhere else except in Pueblo.   ((NUFORC Note:  Possible observation of the star, Sirius, we suspect.  PD))",
    "distance": 663.6482290022938
  },
  {
    "date_time": "11/8/2012 22:30",
    "shape": "Flash",
    "duration": "1 hour",
    "city": "Roswell",
    "state": " NM",
    "latitude": 33.38086066,
    "longitude": -104.525642,
    "comments": "Bright flashes in sky east of Roswell.  Decended with not trail towards the ground.  Working on southern end of Roswell when co-worker called on radio claiming sighting of bright flash east of town.  Met up with 3 co workers on east side of town.  Saw one bright flash while togther.  Shortly after another co-worker called and asked if we had seen the flashes in the sky.  Thought it might be meteors.",
    "distance": 671.2778553598354
  },
  {
    "date_time": "11/4/2012 18:00",
    "shape": "Light",
    "duration": null,
    "city": "Lakewood",
    "state": " CO",
    "latitude": 39.70626515,
    "longitude": -105.1078368,
    "comments": "5 strange bright lights lined up in the sky over Lakewood Colorado.  As my husband was coming home from the store on the night of November 4, 2012, he claimed to have seen 5 bright lights lined up in the sky.  I didn't believe him at first, but as he went on and on about these strange lights I decided to go for a drive and see if I could see them for myself.  I figured if he was telling the truth they would have probably dissapeared by now though.  Strangely enough as I was pulling up to where he had told me to go I did infact see 5 bright lights lined up in the sky they were too big and bright to be stars and they couldn't have been any sort of aircraft because they stood completly still. I was in shock, I couldn't believe I was actually wittnessing this.    I reached over to grab my phone to record it then I realized I had forgotten my phone at home.  I rushed back home to grab my phone.  My husband decided to come along with me this time.  When we arrived the strange bright lights were no longer in a straight line but instead all over the place still near eachother though.  We recorded them on our phone and then left to go back home.",
    "distance": 674.2687919668368
  },
  {
    "date_time": "11/7/2012 23:45",
    "shape": "Triangle",
    "duration": "5 seconds",
    "city": "Boulder",
    "state": " CO",
    "latitude": 40.08298568,
    "longitude": -105.2163447,
    "comments": "Boulder CO Triangle/Chevron Object  Having recently witnessed an orange fireball object on 11/3/12, I was a little reluctant to report this new sighting.  However I felt compelled because my sighting was very similiar to another report in Boulder this month.  I was walking my dog at the Howard Hueston dog park last evening when I spotted an object that appeared to be a triangle or chevron shaped object.  It was extremely difficult to see.  It appeared to have deep red tones on the body of the object, it may have also had about 4 very dim lights on the leading edge of the object.  The object was silent and appeared to be gliding in the sky.  The object was heading west, then turned at a 45 degree angle and headed to the north.  I lost sight of the object when it went into tree line.  It is also important to note that this park is very close to Glenwood Dr similiar location to the other Boulder triangle report.",
    "distance": 679.9386572037392
  },
  {
    "date_time": "11/7/2012 19:00",
    "shape": null,
    "duration": "2 minutes",
    "city": "Boulder",
    "state": " CO",
    "latitude": 40.08298568,
    "longitude": -105.2163447,
    "comments": "Triangle of 3 lights - 2 minutes visable  We were driving on 75th st from Arapahoe heading North to our house in Heatherwood neighborhood.  Noticed 3 bright lights in the shape of a triangle that stood still in the sky.   One of the lights then grew much brighter than the other two.  The top light then shifted upwards diagonally towards the southeast and took off.  The other two followed suit.  Lasted apporx. 2mins  What followed seemed to be a TON of planes that were almost searching for the thing.   We must have watched 8 different things fly over our house back and forth and they sounded like planes.",
    "distance": 679.9386572037392
  },
  {
    "date_time": "11/6/2012 18:00",
    "shape": "Light",
    "duration": "1-2 minutes",
    "city": "Boulder",
    "state": " CO",
    "latitude": 40.08298568,
    "longitude": -105.2163447,
    "comments": "4 orange lights hovering above/near Rocky Flats former nuclear weapons plant  On November 6, 2012, at approximately 6pm MDT, after voting at Centennial Middle School, my wife and I were walking back to our home in north Boulder.  At the intersection of 19th and Norwood, which is located at the top of a steep hill that faces south, we observed 4 bright lights near the southern horizon.  The lights were located on a bearing just east of south, probably about 170 degrees.  They were all the same brightness, evenly spaced, and resembled sodium vapor street lights; they were orange in color.  They were no more than 5 degrees above the horizon from our vantage point. The lights were stationary during the minute or so that we viewed them.  My wife is an adamant skeptic regarding UFOs.  Nonetheless, she readily admitted these lights looked &amp;quot;weird&amp;quot;.  My wife and I both have bachelor's degrees in physics and we have both studied astronomy at the university level, including considerable observational experience.  Neither of us thought these lights looked &amp;quot;normal&amp;quot;.  I have a private pilot's license and I am familiar with the location and traffic patterns of all airports in the vicinity of Boulder.  Our line-of-sight to the unknown lights passed near the traffic pattern for the Rocky Mountain Regional Airport (RMRA) (formerly the Jefferson County Airport or &amp;quot;Jeffco&amp;quot;).  However I do not think these were conventional aircraft landing lights because  1) they were distinctly orange and not white;  2)  because normally we do not see landing lights from aircraft in the pattern at RMRA since the downwind leg for runway 29 R&amp;L points *away* from Boulder;  3) because there were *4* of them, all identical, evenly spaced, and they did not change their appearance at all during the minute or so we were observing them.  Normally, conventional aircraft landing lights only take on an unusually bright appearance (such as we observed) when they happen to be pointed directly at the observer, a condition that normally happens for only a few seconds when an aircraft is maneuvering in the pattern.  I was unable to imagine any plausible arrangement of conventional aircraft in the landing pattern that would produce the display of lights we observed.  In addition I should mention that the line-of-sight from us to the unknown lights passed more or less directly over the former Rocky Flats nuclear weapons facility.  The lights (if taken to be similar in brightness to aircraft landing lights) looked as though they were located right over the former nuclear facility.  Although Rocky Flats has not been used for nuclear weapon production in many years, the author is aware that UFOs are often sighted near sensitive military installations, and thus thought that this detail should be included in this report.  I was conflicted about whether to file this report or not, since we do have a large amount of conventional air traffic in our area at nearly all times, and therefore it is conceivable that what we saw was an unusual configuration of conventional aircraft.  However I decided to submit this report because I have thought about this sighting a number of times since it happened and I really am at a loss to explain those lights in a conventional manner.  Also, I reasoned that perhaps others saw these lights and may have already reported them, or, if not, perhaps my report will catalyze others into coming forward with corroborating information.  As far as I know there has been no mention in the local media about such lights, but I did not do a thorough search to confirm this.",
    "distance": 679.9386572037392
  },
  {
    "date_time": "11/4/2012 19:30",
    "shape": "Triangle",
    "duration": "10 seconds",
    "city": "Boulder",
    "state": " CO",
    "latitude": 40.08298568,
    "longitude": -105.2163447,
    "comments": "it moved fast and not easy to see ..  I went outside and was looking at the stars when something past over head.  It was a rough V shape brownish sort of like it was cloaked.  And moved north to south and moved about 25 to 30 degrees in like 4 or 5 seconds.    My location is boulder Colorado.  Glenwood dry it made no sound... there where no lights the only way I saw it was it passed over a star &#8230;   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 679.9386572037392
  },
  {
    "date_time": "11/4/2012 1:30",
    "shape": "Fireball",
    "duration": "3 seconds",
    "city": "Boulder",
    "state": " CO",
    "latitude": 40.08298568,
    "longitude": -105.2163447,
    "comments": "Boulder CO Fireball  I was outside on my deck looked up to witness an orange fireball.    It was descending, heading from west to east.   The object was silent.   ((NUFORC Note:  We spoke via telephone with this witness, and we found him to be unusually eloquent and sober-minded in his description of the event.  We suspect that the correct time should read 00:44 hrs., but we cannot be certain.  PD))",
    "distance": 679.9386572037392
  },
  {
    "date_time": "11/13/2012 17:30",
    "shape": null,
    "duration": "2 hours",
    "city": "Longmont",
    "state": " CO",
    "latitude": 40.16941928,
    "longitude": -105.1020196,
    "comments": "I saw 6-8 different orange lights  in the sky over Longmont and Boulder area, hold there position for extended period, then move slowly  I live up on a hill where I can see the lights of Longmont, I saw 3 orange lights holding there place, then as I and 2 other witnesses watched, they would flare up then I watched 2 move together, brighten up then move horizontally with the horizon apart from each other.  At times the lights would form loose triangles, then slowly move from side to side, going in and out of brightness.  I got some binoculars and looked at them.  They looked like bright orange lights.  I looked towards Boulder and saw 3 more, they held position for a while then started to move horizontally with the horizon.  I have been at this location for 7 years and am use to watching planes in the sky, and watch the sky quite often.  I have never seen anything like this before.  The lights were not too high from the horizon, 1000ft at the most.  There was a huge amount of air traffic also occurring during this time from the local small airport.  I went inside for a half hour then went back o! ut and they were still doing the same thing.  This all occurred over about 2 hours. I took a video with my phone, but it was very poor quality.",
    "distance": 687.9829162800323
  },
  {
    "date_time": "10/31/2012 19:42",
    "shape": "Fireball",
    "duration": "25-30 seconds",
    "city": "Commerce City",
    "state": " CO",
    "latitude": 39.90330148,
    "longitude": -104.88019840000001,
    "comments": "Slow moving orange ball of fire.  While trick or treating with my son tonight, he spotted something directly over us and pointed up.  Myself along with a few neighbors looked up to see a large, round, orange object, moving fairly slow.  It seemed to have a weird haze around it, almost like it was on fire.   It was very bright, silent, and seemed to be twice the size of a 737 airplane.    Since it was dark, it was hard to tell how high it was, but I&#8217;m guessing maybe 1,500 feet or less.    The object moved toward the west.  My son was terrified and demanded to go home and stop trick or treating.  I have seen meteors, shooting stars, the Northern lights, airplanes, helicopters, etc., nothing compares to this.    It was only around for maybe 25-30 seconds (I was trying to get my phone for video, but was too late) and then it started to fade in and out, until finally it was completely gone.  I called the local police department and they suggested it was a helicopter, but it wasn&#8217;t.    I feel like it&#8217;s an insult to my intelligence when everyone I tell says it must have been a plane or a helicopter.  My son is almost nine and is now scared to sleep in his bed alone tonight because of what he saw.    I am a female criminologist in my late thirties, college educated, and honestly never really believed in UFO&#8217;s before tonight.  After experiencing what we saw, I don&#8217;t believe there is currently anything that can explain it.",
    "distance": 690.8264399226326
  },
  {
    "date_time": "11/8/2012 23:00",
    "shape": "Flash",
    "duration": "5-10 seconds",
    "city": "Tucumcari",
    "state": " NM",
    "latitude": 35.17130606,
    "longitude": -103.7267162,
    "comments": "On Hwy 54 headed North, the entire sky lit up in a bright blue light beginning in the north horizon and encompassing entire 360 view.  While traveling Northeast on Highway 54 as we passed over the overpass right outside of Tucumcari, NM heading towards Logan, NM the entire sky lit up in a bright blue light beginning in the north horizon. It encompassed the entire sky from horizon to horizon and it faded the same way it appeared but faded from the south horizon to the north horizon. It lit up everything in view like daylight except in a blue tone.",
    "distance": 696.5099598751541
  },
  {
    "date_time": "11/12/2012 20:00",
    "shape": "Triangle",
    "duration": "10-15 seconds",
    "city": "Fort Collins",
    "state": " CO",
    "latitude": 40.5693246,
    "longitude": -105.08670900000001,
    "comments": "A &amp;quot;V&amp;quot; formation of 5 faint solid lights flies over Fort Collins heading west.  A triangle of five lights in &#8220;V&#8221; formation flew directly over Fort Collins, moving from east to west across the sky, around 8:00pm on November 12th, 2012.  The five lights were in a &#8220;V&#8221; formation of faint white light that were glowing solid as it moved across the night sky.    No sound could be heard coming from this object and the lights were not flashing as seen on any other identifiable aircraft in the air at night.    It moved quickly at a constant speed flying from the east, heading west.  I tracked it for about 10-15 seconds before I lost it beyond the haze in the western sky.",
    "distance": 701.2491359438783
  },
  {
    "date_time": "11/8/2012 22:30",
    "shape": "Fireball",
    "duration": "2 seconds",
    "city": "Fort Collins",
    "state": " CO",
    "latitude": 40.5693246,
    "longitude": -105.08670900000001,
    "comments": "Neon Green Flash Crashes South of Fort Collins  I was driving south on US-287 just south of Fort Collins around 22:30 MST and I noticed a green light flash across the sky slightly east of my direction of travel for aprox. 2 seconds.    The light had a trajectory similar to a meteor burning up in the atmosphere, but was a distinctly neon green color and was substantially larger.    My first thought was some sort of firework that ignited late, but its speed was also similar to something crashing to Earth.    The direction of travel was from East to West and looked to intersect my southbound direction of travel.  I, however, saw no signs after the flash indicating what happened.    The shape of the light I would describe as similar to the booster rocket assemblies used for Discovery and other spacecraft, except traveling in reverse.    I heard no noise (my car has substantial engine noise), smelled nothing other than my heater (it was cold), and felt nothing   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 701.2491359438783
  },
  {
    "date_time": "11/6/2012 23:30",
    "shape": "Circle",
    "duration": null,
    "city": "Fort Collins",
    "state": " CO",
    "latitude": 40.5693246,
    "longitude": -105.08670900000001,
    "comments": "Circle, multi color, zig and zag but stayed in the same area of the sky.  This was a circle craft with multi colors.  It stayed in the same area for the sky but would zig and zag every once in a while.  Took a photo but just got the sphere shape.  It didn't show the details that we show in the telescope (blinking lights and a circle craft).   We watch if for an hour.  It never left that area of the sky.   ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
    "distance": 701.2491359438783
  },
  {
    "date_time": "11/10/2012 23:45",
    "shape": "Circle",
    "duration": "3-4 minutes",
    "city": "Creswell",
    "state": " OR",
    "latitude": 43.91948462,
    "longitude": -123.01828290000002,
    "comments": "Very bright lights like an airplane, but went dark and saw a round, gray object at a high altitude.  Object seen on Saturday, November 10, 2012 at approximately 11:45 pm.  My wife and I had just returned from watching a football game locally.  We pulled up in front of our house. (suburban neighborhood) and I noticed very bright lights to the south.  Since we have a small airport here in town (behind me and on the other side of a freeway to my east) I assumed it was a low flying airplane making an approach to land. I walked my wife to the door and turned to look at the lights again.  I realized that there were no red and green lights as required and the lights seemed brighter than a small plane. So I assumed maybe it was a commercial airliner making its approach into Eugenes regional airport to my northwest.  The craft appeared to stop its forward motion.  I ran inside to grab a pair of binoculars.  When I came out and looked at the object, it almost appeared that instead of what I thought were lights, almost looked like it was on fire.  Flickering but I saw no smoke or vapor trail.  (Maybe the atmosphere causing the lights to appear to be flickering) It was then I realized that the object was not an altitude for a plane making an approach locally, but at what I would estimate to be at least 30,000 feet.  I have observed jetliners flying over my town at high altitudes with my binoculars, high enough to produce a vapor trail.  And I could see that it was a plane with wings and lights etc&#8230;so I felt confident estimating the objects altitude.  The lights all of a sudden went dark. I pulled the binoculars down straining to catch a glimpse of the craft with the naked eye.  And that&#8217;s when I saw a faint, gray object, traveling about the speed of a satellite orbiting earth.  I found it with my binoculars again.  It was at a very high altitude, no lights, no smoke or vapor trail.  Grey, round, not like a ball but like a disk from my vantage point.  I followed the object in my binoculars for at least another minute or two as it headed north, and finally disappeared behind some clouds and my roofline.  I called a local news station the next day to ask if anyone else had reported strange lights, but no one had.  I talked to my dad the next morning. He is retired from Boeing and once held his pilots license. I asked him if what I saw could have been a weather balloon, but he said they don&#8217;t have lights (especially that bright) and wouldn&#8217;t have been traveling at the rate of speed.  I honestly don&#8217;t know what I saw that night, but it was not normal.",
    "distance": 702.4211101012364
  },
  {
    "date_time": "11/8/2012 22:10",
    "shape": "Unknown",
    "duration": "5 minutes",
    "city": "Eugene",
    "state": " OR",
    "latitude": 44.12841117,
    "longitude": -123.13973370000001,
    "comments": "3 amber lights moving over Eugene slowly at 3000ft. below clouds silently  UFO crafts flew from the south , northward over the city below clouds at a height of about 3000ft. in line at a distance of about 400 yards apart from each other.   Amber in color solid lights moving at what looked like 30 mph silently.   We are a train crew that stopped and watched with amazement all of us knowing what it was!   We did report this to the management .",
    "distance": 717.7671422838442
  },
  {
    "date_time": "11/7/2012 19:30",
    "shape": "Sphere",
    "duration": "15-20 seconds",
    "city": "Casper",
    "state": " WY",
    "latitude": 42.85699582,
    "longitude": -106.32169259999999,
    "comments": "Saw a green orb floating/flying object above me while driving.  I was driving in my car on 2nd street going to the west side of town right by Hobby Lobby, and I noticed above me to my left, above buildings, and the electricity cables,    I then thought maybe Flight for Life helicopter headed to the hospital when suddenly the green floating orb, just disappeared.",
    "distance": 739.820303311748
  }
]